{"prestidigitation":{"description":"*Transmutation cantrip*  \n**Casting Time:** 1 action  \n**Range:** 10 feet  \n**Components:** V, S  \n**Duration:** Up to 1 hour  \n\n---\n\nThis spell is a minor magical trick that novice spellcasters use for practice. You create one of the following magical effects within range:\n\n- You create an instantaneous, harmless sensory effect, such as a shower of sparks, a puff of wind, faint musical notes, or an odd odor.\n- You instantaneously light or snuff out a candle, a torch, or a small campfire.\n- You instantaneously clean or soil an object no larger than 1 cubic foot.\n- You chill, warm, or flavor up to 1 cubic foot of nonliving material for 1 hour.\n- You make a color, a small mark, or a symbol appear on an object or a surface for 1 hour.\n- You create a nonmagical trinket or an illusory image that can fit in your hand and that lasts until the end of your next turn.\n\nIf you cast this spell multiple times, you can have up to three of its non-instantaneous effects active at a time, and you can dismiss such an effect as an action.","sources":["SRD","PHB"]},"mage hand":{"description":"*Conjuration cantrip*  \n**Casting Time:** 1 action  \n**Range:** 30 feet  \n**Components:** V, S  \n**Duration:** 1 minute  \n\n---\n\nA spectral, floating hand appears at a point you choose within range. The hand lasts for the duration or until you dismiss it as an action. The hand vanishes if it is ever more than 30 feet away from you or if you cast this spell again.\n\nYou can use your action to control the hand. You can use the hand to manipulate an object, open an unlocked door or container, stow or retrieve an item from an open container, or pour the contents out of a vial. You can move the hand up to 30 feet each time you use it.\n\nThe hand can't attack, activate magic items, or carry more than 10 pounds.","sources":["SRD","PHB"]},"fire bolt":{"description":"*Evocation cantrip*  \n**Casting Time:** 1 action  \n**Range:** 120 feet  \n**Components:** V, S  \n**Duration:** Instantaneous  \n\n---\n\nYou hurl a mote of fire at a creature or object within range. Make a ranged spell attack against the target. On a hit, the target takes [1d10 fire damage](roll \"1d10\"). A flammable object hit by this spell ignites if it isn't being worn or carried.\n\nThis spell's damage increases by 1d10 when you reach 5th level ([2d10](roll \"2d10\")), 11th level ([3d10](roll \"3d10\")), and 17th level ([4d10](roll \"4d10\")).","sources":["SRD","PHB"]},"thaumaturgy":{"description":"*Transmutation cantrip*  \n**Casting Time:** 1 action  \n**Range:** 30 feet  \n**Components:** V  \n**Duration:** Up to 1 minute\n\n---\n\nYou manifest a minor wonder, a sign of supernatural power, within range. You create one of the following magical effects within range:\n\n- Your voice booms up to three times as loud as normal for 1 minute.\n- You cause flames to flicker, brighten, dim, or change color for 1 minute.\n- You cause harmless tremors in the ground for 1 minute.\n- You create an instantaneous sound that originates from a point of your choice within range, such as a rumble of thunder, the cry of a raven, or ominous whispers.\n- You instantaneously cause an unlocked door or window to fly open or slam shut.\n- You alter the appearance of your eyes for 1 minute.\n\nIf you cast this spell multiple times, you can have up to three of its 1-minute effects active at a time, and you can dismiss such an effect as an action.","sources":["SRD","PHB"]},"acid splash":{"description":"*Conjuration cantrip*  \n**Casting Time:** 1 action  \n**Range:** 60 feet  \n**Components:** V, S  \n**Duration:** Instantaneous  \n\n---\n\nYou hurl a bubble of acid. Choose one creature you can see within range, or choose two creatures you can see within range that are within 5 feet of each other. A target must succeed on a Dexterity saving throw or take [1d6 acid damage](roll \"1d6\").\n\nThis spell's damage increases by 1d6 when you reach 5th level ([2d6](roll \"2d6\")), 11th level ([3d6](roll \"3d6\")), and 17th level ([4d6](roll \"4d6\")).","sources":["SRD","PHB"]},"chill touch":{"description":"*Necromancy cantrip*  \n**Casting Time:** 1 action  \n**Range:** 120 feet  \n**Components:** V, S  \n**Duration:** 1 round  \n\n---\n\nYou create a ghostly, skeletal hand in the space of a creature within range. Make a ranged spell attack against the creature to assail it with the chill of the grave. On a hit, the target takes [1d8 necrotic damage](roll \"1d8\"), and it can't regain hit points until the start of your next turn. Until then, the hand clings to the target.\n\nIf you hit an undead target, it also has disadvantage on attack rolls against you until the end of your next turn.\n\nThis spell's damage increases by 1d8 when you reach 5th level ([2d8](roll \"2d8\")), 11th level ([3d8](roll \"3d8\")), and 17th level ([4d8](roll \"4d8\")).","sources":["SRD","PHB"]},"dancing lights":{"description":"*Evocation cantrip*  \n**Casting Time:** 1 action  \n**Range:** 120 feet  \n**Components:** V, S, M (a bit of phosphorus or wychwood, or a glowworm)  \n**Duration:** Concentration, up to 1 minute  \n\n---\n\nYou create up to four torch-sized lights within range, making them appear as torches, lanterns, or glowing orbs that hover in the air for the duration. You can also combine the four lights into one glowing vaguely humanoid form of Medium size. Whichever form you choose, each light sheds dim light in a 10-foot radius.\n\nAs a bonus action on your turn, you can move the lights up to 60 feet to a new spot within range. A light must be within 20 feet of another light created by this spell, and a light winks out if it exceeds the spell's range.","sources":["SRD","PHB"]},"light":{"description":"*Evocation cantrip*  \n**Casting Time:** 1 action  \n**Range:** Touch  \n**Components:** V, M (a firefly or phosphorescent moss)  \n**Duration:** 1 hour  \n\n---\n\nYou touch one object that is no larger than 10 feet in any dimension. Until the spell ends, the object sheds bright light in a 20-foot radius and dim light for an additional 20 feet. The light can be colored as you like. Completely covering the object with something opaque blocks the light. The spell ends if you cast it again or dismiss it as an action.\n\nIf you target an object held or worn by a hostile creature, that creature must succeed on a Dexterity saving throw to avoid the spell.","sources":["SRD","PHB"]},"mending":{"description":"*Transmutation cantrip*  \n**Casting Time:** 1 minute  \n**Range:** Touch  \n**Components:** V, S, M (two lodestones)  \n**Duration:** Instantaneous  \n\n---\n\nThis spell repairs a single break or tear in an object you touch, such as broken chain link, two halves of a broken key, a torn cloak, or a leaking wineskin. As long as the break or tear is no larger than 1 foot in any dimension, you mend it, leaving no trace of the former damage.\n\nThis spell can physically repair a magic item or construct, but the spell can't restore magic to such an object.","sources":["SRD","PHB"]},"minor illusion":{"description":"*Illusion cantrip*  \n**Casting Time:** 1 action  \n**Range:** 30 feet  \n**Components:** S, M (a bit of fleece)  \n**Duration:** 1 minute  \n\n---\n\nYou create a sound or an image of an object within range that lasts for the duration. The illusion also ends if you dismiss it as an action or cast this spell again.\n\nIf you create a sound, its volume can range from a whisper to a scream. It can be your voice, someone else's voice, a lion's roar, a beating of drums, or any other sound you choose. The sound continues unabated throughout the duration, or you can make discrete sounds at different times before the spell ends.\n\nIf you create an image of an object—such as a chair, muddy footprints, or a small chest—it must be no larger than a 5-foot cube. The image can't create sound, light, smell, or any other sensory effect. Physical interaction with the image reveals it to be an illusion, because things can pass through it.\n\nIf a creature uses its action to examine the sound or image, the creature can determine that it is an illusion with a successful Intelligence (Investigation) check against your spell save DC. If a creature discerns the illusion for what it is, the illusion becomes faint to the creature.","sources":["SRD","PHB"]},"poison spray":{"description":"*Conjuration cantrip*  \n**Casting Time:** 1 action  \n**Range:** 10 feet  \n**Components:** V, S  \n**Duration:** Instantaneous  \n\n---\n\nYou extend your hand toward a creature you can see within range and project a puff of noxious gas from your palm. The creature must succeed on a Constitution saving throw or take [1d12 poison damage](roll \"1d12\").\n\nThis spell's damage increases by 1d12 when you reach 5th level ([2d12](roll \"2d12\")), 11th level ([3d12](roll \"3d12\")), and 17th level ([4d12](roll \"4d12\")).","sources":["SRD","PHB"]},"ray of frost":{"description":"*Evocation cantrip*  \n**Casting Time:** 1 action  \n**Range:** 60 feet  \n**Components:** V, S  \n**Duration:** Instantaneous  \n\n---\n\nA frigid beam of blue-white light streaks toward a creature within range. Make a ranged spell attack against the target. On a hit, it takes [1d8 cold damage](roll \"1d8\"), and its speed is reduced by 10 feet until the start of your next turn.\n\nThe spell's damage increases by 1d8 when you reach 5th level ([2d8](roll \"2d8\")), 11th level ([3d8](roll \"3d8\")), and 17th level ([4d8](roll \"4d8\")).","sources":["SRD","PHB"]},"shocking grasp":{"description":"*Evocation cantrip*  \n**Casting Time:** 1 action  \n**Range:** Touch  \n**Components:** V, S  \n**Duration:** Instantaneous  \n\n---\n\nLightning springs from your hand to deliver a shock to a creature you try to touch. Make a melee spell attack against the target. You have advantage on the attack roll if the target is wearing armor made of metal. On a hit, the target takes [1d8 lightning damage](roll \"1d8\"), and it can't take reactions until the start of its next turn.\n\nThe spell's damage increases by 1d8 when you reach 5th level ([2d8](roll \"2d8\")), 11th level ([3d8](roll \"3d8\")), and 17th level ([4d8](roll \"4d8\")).","sources":["SRD","PHB"]},"true strike":{"description":"*Divination cantrip*  \n**Casting Time:** 1 action  \n**Range:** 30 feet  \n**Components:** S  \n**Duration:** Concentration, up to 1 round  \n\n---\n\nYou extend your hand and point a finger at a target in range. Your magic grants you a brief insight into the target's defenses. On your next turn, you gain advantage on your first attack roll against the target, provided that this spell hasn't ended.","sources":["SRD","PHB"]},"shillelagh":{"description":"[h:encode(\"Spell Attack\")]\n\n*Transmutation cantrip*  \n**Casting Time:** 1 bonus action  \n**Range:** Touch  \n**Components:** V, S, M (mistletoe, a shamrock leaf, and a club or quarterstaff)  \n**Duration:** 1 minute\n\n---\n\nThe wood of a club or quarterstaff you are holding is imbued with nature's power. For the duration, you can use your spellcasting ability instead of Strength for the attack and damage rolls of melee attacks using that weapon, and the weapon's damage die becomes a [d8](roll \"1d8+spell\"). The weapon also becomes magical, if it isn't already. The spell ends if you cast it again or if you let go of the weapon.","sources":["SRD","PHB"]},"resistance":{"description":"*Abjuration cantrip*  \n**Casting Time:** 1 action  \n**Range:** Touch  \n**Components:** V, S, M (a miniature cloak)  \n**Duration:** Concentration, up to 1 minute\n\n---\n\nYou touch one willing creature. Once before the spell ends, the target can roll a [d4](roll \"1d4\") and add the number rolled to one saving throw of its choice. It can roll the die before or after making the saving throw. The spell then ends.","sources":["SRD","PHB"]},"produce flame":{"description":"*Conjuration cantrip*  \n**Casting Time:** 1 action  \n**Range:** Self  \nComponents:** V, S  \n**Duration:** 10 minutes\n\n---\n\nA flickering flame appears in your hand. The flame remains there for the duration and harms neither you nor your equipment. The flame sheds bright light in a 10-foot radius and dim light for an additional 10 feet. The spell ends if you dismiss it as an action or if you cast it again.\n\nYou can also attack with the flame, although doing so ends the spell. When you cast this spell, or as an action on a later turn, you can hurl the flame at a creature within 30 feet of you. Make a ranged spell attack. On a hit, the target takes [1d8 fire damage](roll \"1d8\").\n\nThis spell's damage increases by 1d8 when you reach 5th level ([2d8](roll \"2d8\")), 11th level ([3d8](roll \"3d8\")), and 17th level ([4d8](roll \"4d8\")).","sources":["SRD","PHB"]},"guidance":{"description":"*Divination cantrip*  \n**Casting Time:** 1 action  \n**Range:** Touch  \n**Components:** V, S  \n**Duration:** Concentration, up to 1 minute\n\n---\n\nYou touch one willing creature. Once before the spell ends, the target can roll a [d4](roll \"1d4\") and add the number rolled to one ability check of its choice. It can roll the die before or after making the ability check. The spell then ends.","sources":["SRD","PHB"]},"druidcraft":{"description":"*Transmutation cantrip*  \n**Casting Time:** 1 action  \n**Range:** 30 feet  \n**Components:** V, S  \n**Duration:** Instantaneous\n\n---\n\nWhispering to the spirits of nature, you create one of the following effects within range:\n\n- You create a tiny, harmless sensory effect that predicts what the weather will be at your location for the next 24 hours. The effect might manifest as a golden orb for clear skies, a cloud for rain, falling snowflakes for snow, and so on. This effect persists for 1 round.\n- You instantly make a flower blossom, a seed pod open, or a leaf bud bloom.\n- You create an instantaneous, harmless sensory effect, such as falling leaves, a puff of wind, the sound of a small animal, or the faint odor of skunk. The effect must fit in a 5-foot cube.\n- You instantly light or snuff out a candle, a torch, or a small campfire.","sources":["SRD","PHB"]},"eldritch blast":{"description":"*Evocation cantrip*  \n**Casting Time:** 1 action  \n**Range:** 120 feet  \n**Components:** V, S  \n**Duration:** Instantaneous\n\n---\n\nA beam of crackling energy streaks toward a creature within range. Make a ranged spell attack against the target. On a hit, the target takes [1d10 force damage](roll \"1d10\").\n\nThe spell creates more than one beam when you reach higher levels: two beams at 5th level, three beams at 11th level, and four beams at 17th level. You can direct the beams at the same target or at different ones. Make a separate attack roll for each beam.","sources":["SRD","PHB"]},"vicious mockery":{"description":"*Enchantment cantrip*  \n**Casting Time:** 1 action  \n**Range:** 60 feet  \n**Components:** V  \n**Duration:** Instantaneous\n\n---\n\nYou unleash a string of insults laced with subtle enchantments at a creature you can see within range. If the target can hear you (though it need not understand you), it must succeed on a Wisdom saving throw or take [1d4 psychic damage](roll \"1d4\") and have disadvantage on the next attack roll it makes before the end of its next turn.\n\nThis spell's damage increases by 1d4 when you reach 5th level ([2d4](roll \"2d4\")), 11th level ([3d4](roll \"3d4\")), and 17th level ([4d4](roll \"4d4\")).","sources":["SRD","PHB"]},"sacred flame":{"description":"*Evocation cantrip*  \n**Casting Time:** 1 action  \n**Range:** 60 feet  \n**Components:** V, S  \n**Duration:** Instantaneous\n\n---\n\nFlame-like radiance descends on a creature that you can see within range. The target must succeed on a Dexterity saving throw or take [1d8](roll \"1d8\") radiant damage. The target gains no benefit from cover for this saving throw.\n\nThe spell's damage increases by 1d8 when you reach 5th level ([2d8](roll \"2d8\")), 11th level ([3d8](roll \"4d8\")), and 17th level ([4d8](roll \"4d8\")).","sources":["SRD","PHB"]},"spare the dying":{"description":"*Necromancy cantrip*  \n**Casting Time:** 1 action  \n**Range:** Touch  \n**Components:** V, S  \n**Duration:** Instantaneous\n\n---\n\nYou touch a living creature that has 0 hit points. The creature becomes stable. This spell has no effect on undead or constructs.","sources":["SRD","PHB"]},"bless":{"description":"*1st-level enchantment*  \n**Casting Time:** 1 action  \n**Range:** 30 feet  \n**Components:** V, S, M (a sprinkling of holy water)  \n**Duration:** Concentration, up to 1 minute\n\n---\n\nYou bless up to three creatures of your choice within range. Whenever a target makes an attack roll or a saving throw before the spell ends, the target can roll a [d4](roll \"1d4\") and add the number rolled to the attack roll or saving throw.\n\n***At Higher Levels.*** When you cast this spell using a spell slot of 2nd level or higher, you can target one additional creature for each slot level above 1st.","sources":["SRD","PHB"]},"cure wounds":{"description":"*1st-level evocation*  \n**Casting Time:** 1 action  \n**Range:** Touch  \n**Components:** V, S  \n**Duration:** Instantaneous\n\n---\n\nA creature you touch regains a number of hit points equal to [1d8 + your spellcasting ability modifier](roll \"1d8+spell\"). This spell has no effect on undead or constructs.\n\n***At Higher Levels.*** When you cast this spell using a spell slot of 2nd level or higher, the healing increases by [1d8](roll \"1d8+1d8*slot1+spell\") for each slot level above 1st.","sources":["SRD","PHB"]},"protection from evil and good":{"description":"*1st-level abjuration*  \n**Casting Time:** 1 action  \n**Range:** Touch  \n**Components:** V, S, M (holy water or powdered silver and iron, which the spell consumes)  \n**Duration:** Concentration, up to 10 minutes\n\n---\n\nUntil the spell ends, one willing creature you touch is protected against certain types of creatures: aberrations, celestials, elementals, fey, fiends, and undead.\n\nThe protection grants several benefits. Creatures of those types have disadvantage on attack rolls against the target. The target also can't be charmed, frightened, or possessed by them. If the target is already charmed, frightened, or possessed by such a creature, the target has advantage on any new saving throw against the relevant effect.","sources":["SRD","PHB"]},"sanctuary":{"description":"*1st-level abjuration*  \n**Casting Time:** 1 bonus action  \n**Range:** 30 feet  \n**Components:** V, S, M (a small silver mirror)  \n**Duration:** 1 minute  \n\n---\n\nYou ward a creature within range against attack. Until the spell ends, any creature who targets the warded creature with an attack or a harmful spell must first make a Wisdom saving throw. On a failed save, the creature must choose a new target or lose the attack or spell. This spell doesn't protect the warded creature from area effects, such as the explosion of a fireball.\n\nIf the warded creature makes an attack, casts a spell that affects an enemy, or deals damage to another creature, this spell ends.","sources":["SRD","PHB"]},"disguise self":{"description":"*1st-level illusion*  \n**Casting Time:** 1 action  \n**Range:** Self  \n**Components:** V, S  \n**Duration:** 1 hour\n\n---\n\nYou make yourself—including your clothing, armor, weapons, and other belongings on your person—look different until the spell ends or until you use your action to dismiss it. You can seem 1 foot shorter or taller and can appear thin, fat, or in between. You can't change your body type, so you must adopt a form that has the same basic arrangement of limbs. Otherwise, the extent of the illusion is up to you.\n\nThe changes wrought by this spell fail to hold up to physical inspection. For example, if you use this spell to add a hat to your outfit, objects pass through the hat, and anyone who touches it would feel nothing or would feel your head and hair. If you use this spell to appear thinner than you are, the hand of someone who reaches out to touch you would bump into you while it was seemingly still in midair.\n\nTo discern that you are disguised, a creature can use its action to inspect your appearance and must succeed on an Intelligence (Investigation) check against your spell save DC.","sources":["SRD","PHB"]},"sleep":{"description":"*1st-level enchantment*  \n**Casting Time:** 1 action  \n**Range:** 90 feet  \n**Components:** V, S, M (a pinch of fine sand, rose petals, or a cricket)  \n**Duration:** 1 minute\n\n---\n\nThis spell sends creatures into a magical slumber. Roll [5d8](roll \"5d8\"); the total is how many hit points of creatures this spell can affect. Creatures within 20 feet of a point you choose within range are affected in ascending order of their current hit points (ignoring unconscious creatures).\n\nStarting with the creature that has the lowest current hit points, each creature affected by this spell falls unconscious until the spell ends, the sleeper takes damage, or someone uses an action to shake or slap the sleeper awake. Subtract each creature's hit points from the total before moving on to the creature with the next lowest hit points. A creature's hit points must be equal to or less than the remaining total for that creature to be affected.\n\nUndead and creatures immune to being charmed aren't affected by this spell.\n\n***At Higher Levels.*** When you cast this spell using a spell slot of 2nd level or higher, roll an additional [2d8](roll \"5d8+2d8*slot1\") for each slot level above 1st.","sources":["SRD","PHB"]},"healing word":{"description":"*1st-level evocation*  \n**Casting Time:** 1 bonus action  \n**Range:** 60 feet  \n**Components:** V  \n**Duration:** Instantaneous\n\n---\n\nA creature of your choice that you can see within range regains hit points equal to [1d4 + your spellcasting ability modifier](roll \"1d4+spell\"). This spell has no effect on undead or constructs.\n\n***At Higher Levels.*** When you cast this spell using a spell slot of 2nd level or higher, the healing increases by [1d4](roll \"1d4+1d4*slot1+spell\") for each slot level above 1st.","sources":["SRD","PHB"]},"unseen servant":{"description":"*1st-level conjuration (ritual)*  \n**Casting Time:** 1 action  \n**Range:** 60 feet  \n**Components:** V, S, M (a piece of string and a bit of wood)  \n**Duration:** 1 hour  \n\n---\n\nThis spell creates an invisible, mindless, shapeless, Medium force that performs simple tasks at your command until the spell ends. The servant springs into existence in an unoccupied space on the ground within range. It has AC 10, 1 hit point, and a Strength of 2, and it can't attack. If it drops to 0 hit points, the spell ends.\n\nOnce on each of your turns as a bonus action, you can mentally command the servant to move up to 15 feet and interact with an object. The servant can perform simple tasks that a human servant could do, such as fetching things, cleaning, mending, folding clothes, lighting fires, serving food, and pouring wine. Once you give the command, the servant performs the task to the best of its ability until it completes the task, then waits for your next command.\n\nIf you command the servant to perform a task that would move it more than 60 feet away from you, the spell ends.","sources":["SRD","PHB"]},"mage armor":{"description":"*1st-level abjuration*  \n**Casting Time:** 1 action  \n**Range:** Touch  \n**Components:** V, S, M (a piece of cured leather)  \n**Duration:** 8 hours\n\n---\n\nYou touch a willing creature who isn't wearing armor, and a protective magical force surrounds it until the spell ends. The target's base AC becomes 13 + its Dexterity modifier. The spell ends if the target dons armor or if you dismiss the spell as an action.","sources":["SRD","PHB"]},"magic missile":{"description":"*1st-level evocation*  \n**Casting Time:** 1 action  \n**Range:** 120 feet  \n**Components:** V, S  \n**Duration:** Instantaneous\n\n---\n\nYou create three glowing darts of magical force. Each dart hits a creature of your choice that you can see within range. A dart deals [1d4 + 1](roll \"1d4+1\") force damage to its target. The darts all strike simultaneously, and you can direct them to hit one creature or several.\n\nAt Higher Levels. When you cast this spell using a spell slot of 2nd level or higher, the spell creates one more dart for each slot level above 1st.","sources":["SRD","PHB"]},"shield":{"description":"*1st-level abjuration**  \n**Casting Time:** 1 reaction, which you take when you are hit by an attack or targeted by the magic missile spell  \n**Range:** Self  \n**Components:** V, S  \n**Duration:** 1 round\n\n---\n\nAn invisible barrier of magical force appears and protects you. Until the start of your next turn, you have a +5 bonus to AC, including against the triggering attack, and you take no damage from magic missile.","sources":["SRD","PHB"]},"detect evil and good":{"description":"*1st-level divination*  \n**Casting Time:** 1 action  \n**Range:** Self  \n**Components:** V, S  \n**Duration:** Concentration, up to 10 minutes\n\n---\n\nFor the duration, you know if there is an aberration, celestial, elemental, fey, fiend, or undead within 30 feet of you, as well as where the creature is located. Similarly, you know if there is a place or object within 30 feet of you that has been magically consecrated or desecrated.\n\nThe spell can penetrate most barriers, but it is blocked by 1 foot of stone, 1 inch of common metal, a thin sheet of lead, or 3 feet of wood or dirt.","sources":["SRD","PHB"]},"detect poison and disease":{"description":"*1st-level divination (ritual)*  \n**Casting Time:** 1 action  \n**Range:** Self  \n**Components:** V, S, M (a yew leaf)  \n**Duration:** Concentration, up to 10 minutes\n\n---\n\nFor the duration, you can sense the presence and location of poisons, poisonous creatures, and diseases within 30 feet of you. You also identify the kind of poison, poisonous creature, or disease in each case.\n\nThe spell can penetrate most barriers, but it is blocked by 1 foot of stone, 1 inch of common metal, a thin sheet of lead, or 3 feet of wood or dirt.","sources":["SRD","PHB"]},"guiding bolt":{"description":"*1st-level evocation*  \n**Casting Time:** 1 action  \n**Range:** 120 feet  \n**Components:** V, S  \n**Duration:** 1 round\n\n---\n\nA flash of light streaks toward a creature of your choice within range. Make a ranged spell attack against the target. On a hit, the target takes [4d6](roll \"4d6\") radiant damage, and the next attack roll made against this target before the end of your next turn has advantage, thanks to the mystical dim light glittering on the target until then.\n\n***At Higher Levels.*** When you cast this spell using a spell slot of 2nd level or higher, the damage increases by [1d6](roll \"4d6+1d6*slot1\") for each slot level above 1st.","sources":["SRD","PHB"]},"charm person":{"description":"*1st-level enchantment*  \nCasting Time: 1 action  \nRange: 30 feet  \nComponents: V, S  \nDuration: 1 hour\n\n---\n\nYou attempt to charm a humanoid you can see within range. It must make a Wisdom saving throw, and does so with advantage if you or your companions are fighting it. If it fails the saving throw, it is charmed by you until the spell ends or until you or your companions do anything harmful to it. The charmed creature regards you as a friendly acquaintance. When the spell ends, the creature knows it was charmed by you.\n\n***At Higher Levels.*** When you cast this spell using a spell slot of 2nd level or higher, you can target one additional creature for each slot level above 1st. The creatures must be within 30 feet of each other when you target them.","sources":["SRD","PHB"]},"faerie fire":{"description":"*1st-level evocation*  \n**Casting Time:** 1 action  \n**Range:** 60 feet  \n**Components:** V  \n**Duration:** Concentration, up to 1 minute\n\n---\n\nEach object in a 20-foot cube within range is outlined in blue, green, or violet light (your choice). Any creature in the area when the spell is cast is also outlined in light if it fails a Dexterity saving throw. For the duration, objects and affected creatures shed dim light in a 10-foot radius.\n\nAny attack roll against an affected creature or object has advantage if the attacker can see it, and the affected creature or object can't benefit from being invisible.","sources":["SRD","PHB"]},"burning hands":{"description":"*1st-level evocation*  \n***Casting Time:*** 1 action  \n***Range:*** Self (15-foot cone)  \n***Components:*** V, S  \n***Duration:*** Instantaneous\n\n---\n\nAs you hold your hands with thumbs touching and fingers spread, a thin sheet of flames shoots forth from your outstretched fingertips. Each creature in a 15-foot cone must make a Dexterity saving throw. A creature takes [3d6](roll \"3d6\") fire damage on a failed save, or half as much damage on a successful one.\n\nThe fire ignites any flammable objects in the area that aren't being worn or carried.\n\n***At Higher Levels.*** When you cast this spell using a spell slot of 2nd level or higher, the damage increases by [1d6](roll \"3d6+1d6*slot1\") for each slot level above 1st.","sources":["SRD","PHB"]},"detect magic":{"description":"*1st-level divination (ritual)*  \n***Casting Time:*** 1 action  \n***Range:*** Self  \n***Components:*** V, S  \n***Duration:*** Concentration, up to 10 minutes\n\n---\n\nFor the duration, you sense the presence of magic within 30 feet of you. If you sense magic in this way, you can use your action to see a faint aura around any visible creature or object in the area that bears magic, and you learn its school of magic, if any.\n\nThe spell can penetrate most barriers, but it is blocked by 1 foot of stone, 1 inch of common metal, a thin sheet of lead, or 3 feet of wood or dirt.","sources":["SRD","PHB"]},"thunderwave":{"description":"*1st-level evocation*  \n***Casting Time:*** 1 action  \n***Range:*** Self (15-foot cube)  \n***Components:*** V, S  \n***Duration:*** Instantaneous\n\n---\n\nA wave of thunderous force sweeps out from you. Each creature in a 15-foot cube originating from you must make a Constitution saving throw. On a failed save, a creature takes [2d8](roll \"2d8\") thunder damage and is pushed 10 feet away from you. On a successful save, the creature takes half as much damage and isn't pushed.\n\nIn addition, unsecured objects that are completely within the area of effect are automatically pushed 10 feet away from you by the spell's effect, and the spell emits a thunderous boom audible out to 300 feet.\n\nAt Higher Levels. When you cast this spell using a spell slot of 2nd level or higher, the damage increases by [1d8](roll \"2d8+1d8*slot1\") for each slot level above 1st.","sources":["SRD","PHB"]},"invisibility":{"description":"*2nd-level illusion*  \n**Casting Time:** 1 action  \n**Range:** Touch  \n**Components:** V, S, M (an eyelash encased in gum arabic)  \n**Duration:** Concentration, up to 1 hour\n\n---\n\nA creature you touch becomes invisible until the spell ends. Anything the target is wearing or carrying is invisible as long as it is on the target's person. The spell ends for a target that attacks or casts a spell.\n\n***At Higher Levels.*** When you cast this spell using a spell slot of 3rd level or higher, you can target one additional creature for each slot level above 2nd.","sources":["SRD","PHB"]},"pass without trace":{"description":"*2nd-level abjuration*  \n**Casting Time:** 1 action  \n**Range:** Self  \n**Components:** V, S, M (ashes from a burned leaf of mistletoe and a sprig of spruce)  \n**Duration:** Concentration, up to 1 hour\n\n---\n\nA veil of shadows and silence radiates from you, masking you and your companions from detection. For the duration, each creature you choose within 30 feet of you (including you) has a +10 bonus to Dexterity (Stealth) checks and can't be tracked except by magical means. A creature that receives this bonus leaves behind no tracks or other traces of its passage.","sources":["SRD","PHB"]},"hold person":{"description":"*2nd-level enchantment*  \n**Casting Time:** 1 action  \n**Range:** 60 feet  \n**Components:** V, S, M (a small, straight piece of iron)  \n**Duration:** Concentration, up to 1 minute\n\n---\n\nChoose a humanoid that you can see within range. The target must succeed on a Wisdom saving throw or be paralyzed for the duration. At the end of each of its turns, the target can make another Wisdom saving throw. On a success, the spell ends on the target.\n\n***At Higher Levels.*** When you cast this spell using a spell slot of 3rd level or higher, you can target one additional humanoid for each slot level above 2nd. The humanoids must be within 30 feet of each other when you target them.","sources":["SRD","PHB"]},"spike growth":{"description":"*2nd-level transmutation*  \n**Casting Time:** 1 action  \n**Range:** 150 feet  \n**Components:** V, S, M (seven sharp thorns or seven small twigs, each sharpened to a point)  \n**Duration:** Concentration, up to 10 minutes\n\n---\n\nThe ground in a 20-foot radius centered on a point within range twists and sprouts hard spikes and thorns. The area becomes difficult terrain for the duration. When a creature moves into or within the area, it takes [2d4 piercing damage](roll \"2d4\") for every 5 feet it travels.\n\nThe transformation of the ground is camouflaged to look natural. Any creature that can't see the area at the time the spell is cast must make a Wisdom (Perception) check against your spell save DC to recognize the terrain as hazardous before entering it.","sources":["SRD","PHB"]},"mirror image":{"description":"*2nd-level illusion*  \n**Casting Time:** 1 action  \n**Range:** Self  \n**Components:** V, S  \n**Duration:** 1 minute\n\n---\n\nThree illusory duplicates of yourself appear in your space. Until the spell ends, the duplicates move with you and mimic your actions, shifting position so it's impossible to track which image is real. You can use your action to dismiss the illusory duplicates.\n\nEach time a creature targets you with an attack during the spell's duration, roll a d20 to determine whether the attack instead targets one of your duplicates.\n\nIf you have three duplicates, you must roll a 6 or higher to change the attack's target to a duplicate. With two duplicates, you must roll an 8 or higher. With one duplicate, you must roll an 11 or higher.\n\nA duplicate's AC equals 10 + your Dexterity modifier. If an attack hits a duplicate, the duplicate is destroyed. A duplicate can be destroyed only by an attack that hits it. It ignores all other damage and effects. The spell ends when all three duplicates are destroyed.\n\nA creature is unaffected by this spell if it can't see, if it relies on senses other than sight, such as blindsight, or if it can perceive illusions as false, as with truesight.","sources":["SRD","PHB"]},"misty step":{"description":"*2nd-level conjuration*  \n**Casting Time:** 1 bonus action  \n**Range:** Self  \n**Components:** V  \n**Duration:** Instantaneous\n\n---\n\nBriefly surrounded by silvery mist, you teleport up to 30 feet to an unoccupied space that you can see.","sources":["SRD","PHB"]},"blur":{"description":"*2nd-level illusion*  \n**Casting Time:** 1 action  \n**Range:** Self  \n**Components:** V  \n**Duration:** Concentration, up to 1 minute\n\n---\n\nYour body becomes blurred, shifting and wavering to all who can see you. For the duration, any creature has disadvantage on attack rolls against you. An attacker is immune to this effect if it doesn't rely on sight, as with blindsight, or can see through illusions, as with truesight.","sources":["SRD","PHB"]},"silence":{"description":"*2nd-level illusion (ritual)*  \n**Casting Time:** 1 action  \n**Range:** 120 feet  \n**Components:** V, S  \n**Duration:** Concentration, up to 10 minutes\n\n---\n\nFor the duration, no sound can be created within or pass through a 20-foot-radius sphere centered on a point you choose within range. Any creature or object entirely inside the sphere is immune to thunder damage, and creatures are deafened while entirely inside it. Casting a spell that includes a verbal component is impossible there.","sources":["SRD","PHB"]},"barkskin":{"description":"*2nd-level transmutation*  \n**Casting Time:** 1 action  \n**Range:** Touch  \n**Components:** V, S, M (a handful of oak bark)  \n**Duration:** Concentration, up to 1 hour\n\n---\n\nYou touch a willing creature. Until the spell ends, the target's skin has a rough, bark-like appearance, and the target's AC can't be less than 16, regardless of what kind of armor it is wearing.","sources":["SRD","PHB"]},"darkness":{"description":"*2nd-level evocation*  \n**Casting Time:** 1 action  \n**Range:** 60 feet  \n**Components:** V, M (bat fur and a drop of pitch or piece of coal)  \n**Duration:** Concentration, up to 10 minutes\n\n---\n\nMagical darkness spreads from a point you choose within range to fill a 15-foot-radius sphere for the duration. The darkness spreads around corners. A creature with darkvision can't see through this darkness, and nonmagical light can't illuminate it.\n\nIf the point you choose is on an object you are holding or one that isn't being worn or carried, the darkness emanates from the object and moves with it. Completely covering the source of the darkness with an opaque object, such as a bowl or a helm, blocks the darkness.\n\nIf any of this spell's area overlaps with an area of light created by a spell of 2nd level or lower, the spell that created the light is dispelled.","sources":["SRD","PHB"]},"melf's acid arrow":{"description":"*2nd-level evocation*  \n**Casting Time:** 1 action  \n**Range:** 90 feet  \n**Components:** V, S, M (powdered rhubarb leaf and an adder's stomach)  \n**Duration:** Instantaneous\n\n---\n\nA shimmering green arrow streaks toward a target within range and bursts in a spray of acid. Make a ranged spell attack against the target. On a hit, the target takes [4d4 acid damage](roll \"4d4\") immediately and [2d4 acid damage](roll \"2d4\") at the end of its next turn. On a miss, the arrow splashes the target with acid for half as much of the initial damage and no damage at the end of its next turn.\n\n***At Higher Levels.*** When you cast this spell using a spell slot of 3rd level or higher, the damage (both [initial](roll \"4d4+1d4slot2\") and [later](roll \"2d4+1d4slot2\")) increases by [1d4](roll \"1d4slot2\") for each slot level above 2nd.","sources":["SRD","PHB"]},"spider climb":{"description":"*2nd-level transmutation*  \n**Casting Time:** 1 action  \n**Range:** Touch  \n**Components:** V, S, M (a drop of bitumen and a spider)  \n**Duration:** Concentration, up to 1 hour\n\n---\n\nUntil the spell ends, one willing creature you touch gains the ability to move up, down, and across vertical surfaces and upside down along ceilings, while leaving its hands free. The target also gains a climbing speed equal to its walking speed.","sources":["SRD","PHB"]},"web":{"description":"*2nd-level conjuration*  \n**Casting Time:** 1 action  \n**Range:** 60 feet  \n**Components:** V, S, M (a bit of spiderweb)  \n**Duration:** Concentration, up to 1 hour\n\n---\n\nYou conjure a mass of thick, sticky webbing at a point of your choice within range. The webs fill a 20-foot cube from that point for the duration. The webs are difficult terrain and lightly obscure their area.\n\nIf the webs aren't anchored between two solid masses (such as walls or trees) or layered across a floor, wall, or ceiling, the conjured web collapses on itself, and the spell ends at the start of your next turn. Webs layered over a flat surface have a depth of 5 feet.\n\nEach creature that starts its turn in the webs or that enters them during its turn must make a Dexterity saving throw. On a failed save, the creature is restrained as long as it remains in the webs or until it breaks free.\n\nA creature restrained by the webs can use its action to make a Strength check against your spell save DC. If it succeeds, it is no longer restrained.\n\nThe webs are flammable. Any 5-foot cube of webs exposed to fire burns away in 1 round, dealing 2d4 fire damage to any creature that starts its turn in the fire.","sources":["SRD","PHB"]},"fireball":{"description":"*3rd-level evocation*  \n**Casting Time:** 1 action  \n**Range:** 150 feet  \n**Components:** V, S, M (a tiny ball of bat guano and sulfur)  \n**Duration:** Instantaneous  \n\n---\n\nA bright streak flashes from your pointing finger to a point you choose within range and then blossoms with a low roar into an explosion of flame. Each creature in a 20-foot-radius sphere centered on that point must make a Dexterity saving throw. A target takes [8d6 fire damage](roll \"8d6\") on a failed save, or half as much damage on a successful one.\n\nThe fire spreads around corners. It ignites flammable objects in the area that aren't being worn or carried.\n\n***At Higher Levels.*** When you cast this spell using a spell slot of 4th level or higher, the damage increases by [1d6](roll \"8d6+1d6*slot3\") for each slot level above 3rd.","sources":["SRD","PHB"]},"counterspell":{"description":"*3rd-level abjuration*  \n**Casting Time:** 1 reaction, which you take when you see a creature within 60 feet of you casting a spell  \n**Range:** 60 feet  \n**Components:** S  \n**Duration:** Instantaneous\n\n---\n\nYou attempt to interrupt a creature in the process of casting a spell. If the creature is casting a spell of 3rd level or lower, its spell fails and has no effect. If it is casting a spell of 4th level or higher, make an ability check using your spellcasting ability. The DC equals 10 + the spell's level. On a success, the creature's spell fails and has no effect.\n\n***At Higher Levels***. When you cast this spell using a spell slot of 4th level or higher, the interrupted spell has no effect if its level is less than or equal to the level of the spell slot you used.","sources":["SRD","PHB"]},"mass healing word":{"description":"*3rd-level evocation*  \n**Casting Time:** 1 bonus action  \n**Range:** 60 feet  \n**Components:** V  \n**Duration:** Instantaneous\n\n---\n\nAs you call out words of restoration, up to six creatures of your choice that you can see within range regain hit points equal to [1d4 + your spellcasting ability modifier](roll \"1d4+spell\"). This spell has no effect on undead or constructs.\n\n***At Higher Levels.*** When you cast this spell using a spell slot of 4th level or higher, the healing increases by [1d4](roll \"1d4+1d4*slot3+spell\") for each slot level above 3rd.","sources":["SRD","PHB"]},"sleet storm":{"description":"*3rd-level conjuration*  \n**Casting Time:** 1 action  \n**Range:** 150 feet  \n**Components:** V, S, M (a pinch of dust and a few drops of water)  \n**Duration:** Concentration, up to 1 minute\n\n---\n\nUntil the spell ends, freezing rain and sleet fall in a 20-foot-tall cylinder with a 40-foot radius centered on a point you choose within range. The area is heavily obscured, and exposed flames in the area are doused.\n\nThe ground in the area is covered with slick ice, making it difficult terrain. When a creature enters the spell's area for the first time on a turn or starts its turn there, it must make a Dexterity saving throw. On a failed save, it falls prone.\n\nIf a creature starts its turn in the spell's area and is concentrating on a spell, the creature must make a successful Constitution saving throw against your spell save DC or lose concentration.","sources":["SRD","PHB"]},"slow":{"description":"*3rd-level transmutation*  \n**Casting Time:** 1 action  \n**Range:** 120 feet  \n**Components:** V, S, M (a drop of molasses)  \n**Duration:** Concentration, up to 1 minute\n\n---\n\nYou alter time around up to six creatures of your choice in a 40-foot cube within range. Each target must succeed on a Wisdom saving throw or be affected by this spell for the duration.\n\nAn affected target's speed is halved, it takes a −2 penalty to AC and Dexterity saving throws, and it can't use reactions. On its turn, it can use either an action or a bonus action, not both. Regardless of the creature's abilities or magic items, it can't make more than one melee or ranged attack during its turn.\n\nIf the creature attempts to cast a spell with a casting time of 1 action, roll a [d20](roll \"1d20\"). On an 11 or higher, the spell doesn't take effect until the creature's next turn, and the creature must use its action on that turn to complete the spell. If it can't, the spell is wasted.\n\nA creature affected by this spell makes another Wisdom saving throw at the end of each of its turns. On a successful save, the effect ends for it.","sources":["SRD","PHB"]},"water breathing":{"description":"*3rd-level transmutation (ritual)*  \n**Casting Time:** 1 action  \n**Range:** 30 feet  \n**Components:** V, S, M (a short reed or piece of straw)  \n**Duration:** 24 hours\n\n---\n\nThis spell grants up to ten willing creatures you can see within range the ability to breathe underwater until the spell ends. Affected creatures also retain their normal mode of respiration.","sources":["SRD","PHB"]},"create food and water":{"description":"*3rd-level conjuration*  \n**Casting Time:** 1 action  \n**Range:** 30 feet  \n**Components:** V, S  \n**Duration:** Instantaneous\n\n---\n\nYou create 45 pounds of food and 30 gallons of water on the ground or in containers within range, enough to sustain up to fifteen humanoids or five steeds for 24 hours. The food is bland but nourishing, and spoils if uneaten after 24 hours. The water is clean and doesn't go bad.","sources":["SRD","PHB"]},"protection from energy":{"description":"*3rd-level abjuration*  \n**Casting Time:** 1 action  \n**Range:** Touch  \n**Components:** V, S  \n**Duration:** Concentration, up to 1 hour\n\n---\n\nFor the duration, the willing creature you touch has resistance to one damage type of your choice: acid, cold, fire, lightning, or thunder.","sources":["SRD","PHB"]},"call lightning":{"description":"*3rd-level conjuration*  \n**Casting Time:** 1 action  \n**Range:** 120 feet  \n**Components:** V, S  \n**Duration:** Concentration, up to 10 minutes\n\n---\n\nA storm cloud appears in the shape of a cylinder that is 10 feet tall with a 60-foot radius, centered on a point you can see within range directly above you. The spell fails if you can't see a point in the air where the storm cloud could appear (for example, if you are in a room that can't accommodate the cloud).\n\nWhen you cast the spell, choose a point you can see under the cloud. A bolt of lightning flashes down from the cloud to that point. Each creature within 5 feet of that point must make a Dexterity saving throw. A creature takes [3d10 lightning damage](roll \"3d10\") on a failed save, or half as much damage on a successful one. On each of your turns until the spell ends, you can use your action to call down lightning in this way again, targeting the same point or a different one.\n\nIf you are outdoors in stormy conditions when you cast this spell, the spell gives you control over the existing storm instead of creating a new one. Under such conditions, the spell's damage increases by [1d10](roll \"1d10\").\n\n***At Higher Levels.*** When you cast this spell using a spell slot of 4th or higher level, the damage increases by [1d10](roll \"3d10+1d10*slot3\") for each slot level above 3rd.","sources":["SRD","PHB"]},"plant growth":{"description":"*3rd-level transmutation*  \nCasting Time: 1 action or 8 hours  \nRange: 150 feet  \nComponents: V, S  \nDuration: Instantaneous\n\n---\n\nThis spell channels vitality into plants within a specific area. There are two possible uses for the spell, granting either immediate or long-term benefits.\n\nIf you cast this spell using 1 action, choose a point within range. All normal plants in a 100-foot radius centered on that point become thick and overgrown. A creature moving through the area must spend 4 feet of movement for every 1 foot it moves.\n\nYou can exclude one or more areas of any size within the spell's area from being affected.\n\nIf you cast this spell over 8 hours, you enrich the land. All plants in a half-mile radius centered on a point within range become enriched for 1 year. The plants yield twice the normal amount of food when harvested.","sources":["SRD","PHB"]},"daylight":{"description":"*3rd-level evocation*  \n**Casting Time:** 1 action  \n**Range:** 60 feet  \n**Components:** V, S  \n**Duration:** 1 hour\n\n---\n\nA 60-foot-radius sphere of light spreads out from a point you choose within range. The sphere is bright light and sheds dim light for an additional 60 feet.\n\nIf you chose a point on an object you are holding or one that isn't being worn or carried, the light shines from the object and moves with it. Completely covering the affected object with an opaque object, such as a bowl or a helm, blocks the light.\n\nIf any of this spell's area overlaps with an area of darkness created by a spell of 3rd level or lower, the spell that created the darkness is dispelled.","sources":["SRD","PHB"]},"haste":{"description":"*3rd-level transmutation*  \n**Casting Time:** 1 action  \n**Range:** 30 feet  \n**Components:** V, S, M (a shaving of licorice root)  \n**Duration:** Concentration, up to 1 minute\n\n---\n\nChoose a willing creature that you can see within range. Until the spell ends, the target's speed is doubled, it gains a +2 bonus to AC, it has advantage on Dexterity saving throws, and it gains an additional action on each of its turns. That action can be used only to take the Attack (one weapon attack only), Dash, Disengage, Hide, or Use an Object action.\n\nWhen the spell ends, the target can't move or take actions until after its next turn, as a wave of lethargy sweeps over it.","sources":["SRD","PHB"]},"lightning bolt":{"description":"*3rd-level evocation*  \nCasting Time: 1 action  \nRange: Self (100-foot line)  \nComponents: V, S, M (a bit of fur and a rod of amber, crystal, or glass)  \nDuration: Instantaneous\n\n---\n\nA stroke of lightning forming a line 100 feet long and 5 feet wide blasts out from you in a direction you choose. Each creature in the line must make a Dexterity saving throw. A creature takes [8d6](roll \"8d6\") lightning damage on a failed save, or half as much damage on a successful one.\n\nThe lightning ignites flammable objects in the area that aren't being worn or carried.\n\n***At Higher Levels.*** When you cast this spell using a spell slot of 4th level or higher, the damage increases by [1d6](roll \"8d6+1d6*slot3\") for each slot level above 3rd.","sources":["SRD","PHB"]},"meld into stone":{"description":"*3rd-level transmutation (ritual)*  \nCasting Time: 1 action  \nRange: Touch  \nComponents: V, S  \nDuration: 8 hours\n\n---\n\nYou step into a stone object or surface large enough to fully contain your body, melding yourself and all the equipment you carry with the stone for the duration. Using your movement, you step into the stone at a point you can touch. Nothing of your presence remains visible or otherwise detectable by nonmagical senses.\n\nWhile merged with the stone, you can't see what occurs outside it, and any Wisdom (Perception) checks you make to hear sounds outside it are made with disadvantage. You remain aware of the passage of time and can cast spells on yourself while merged in the stone. You can use your movement to leave the stone where you entered it, which ends the spell. You otherwise can't move.\n\nMinor physical damage to the stone doesn't harm you, but its partial destruction or a change in its shape (to the extent that you no longer fit within it) expels you and deals [6d6 bludgeoning damage](roll \"6d6\") to you. The stone's complete destruction (or transmutation into a different substance) expels you and deals 50 bludgeoning damage to you. If expelled, you fall prone in an unoccupied space closest to where you first entered.","sources":["SRD","PHB"]},"water walk":{"description":"*3rd-level transmutation (ritual)*  \n**Casting Time:** 1 action  \n**Range:** 30 feet  \n**Components:** V, S, M (a piece of cork)  \n**Duration:** 1 hour\n\n---\n\nThis spell grants the ability to move across any liquid surface—such as water, acid, mud, snow, quicksand, or lava—as if it were harmless solid ground (creatures crossing molten lava can still take damage from the heat). Up to ten willing creatures you can see within range gain this ability for the duration.\n\nIf you target a creature submerged in a liquid, the spell carries the target to the surface of the liquid at a rate of 60 feet per round.","sources":["SRD","PHB"]},"gaseous form":{"description":"*3rd-level transmutation*  \nCasting Time: 1 action  \nRange: Touch  \nComponents: V, S, M (a bit of gauze and a wisp of smoke)  \nDuration: Concentration, up to 1 hour\n\n---\n\nYou transform a willing creature you touch, along with everything it's wearing and carrying, into a misty cloud for the duration. The spell ends if the creature drops to 0 hit points. An incorporeal creature isn't affected.\n\nWhile in this form, the target's only method of movement is a flying speed of 10 feet. The target can enter and occupy the space of another creature. The target has resistance to nonmagical damage, and it has advantage on Strength, Dexterity, and Constitution saving throws. The target can pass through small holes, narrow openings, and even mere cracks, though it treats liquids as though they were solid surfaces. The target can't fall and remains hovering in the air even when stunned or otherwise incapacitated.\n\nWhile in the form of a misty cloud, the target can't talk or manipulate objects, and any objects it was carrying or holding can't be dropped, used, or otherwise interacted with. The target can't attack or cast spells.","sources":["SRD","PHB"]},"stinking cloud":{"description":"*3rd-level conjuration*  \nCasting Time: 1 action  \nRange: 90 feet  \nComponents: V, S, M (a rotten egg or several skunk cabbage leaves)  \nDuration: Concentration, up to 1 minute\n\n---\n\nYou create a 20-foot-radius sphere of yellow, nauseating gas centered on a point within range. The cloud spreads around corners, and its area is heavily obscured. The cloud lingers in the air for the duration.\n\nEach creature that is completely within the cloud at the start of its turn must make a Constitution saving throw against poison. On a failed save, the creature spends its action that turn retching and reeling. Creatures that don't need to breathe or are immune to poison automatically succeed on this saving throw.\n\nA moderate wind (at least 10 miles per hour) disperses the cloud after 4 rounds. A strong wind (at least 20 miles per hour) disperses it after 1 round.","sources":["SRD","PHB"]},"ice storm":{"description":"*4th-level evocation*  \n**Casting Time:** 1 action  \n**Range:** 300 feet  \n**Components:** V, S, M (a pinch of dust and a few drops of water)  \n**Duration:** Instantaneous\n\n---\n\nA hail of rock-hard ice pounds to the ground in a 20-foot-radius, 40-foot-high cylinder centered on a point within range. Each creature in the cylinder must make a Dexterity saving throw. A creature takes [2d8 bludgeoning damage](roll \"2d8\") and [4d6 cold damage](roll \"4d6\") on a failed save, or half as much damage on a successful one.\n\nHailstones turn the storm's area of effect into difficult terrain until the end of your next turn.\n\n***At Higher Levels.*** When you cast this spell using a spell slot of 5th level or higher, the bludgeoning damage increases by [1d8](roll \"2d8+1d8*slot4\") for each slot level above 4th.","sources":["SRD","PHB"]},"control water":{"description":"*4th-level transmutation*  \n**Casting Time:** 1 action  \n**Range:** 300 feet  \n**Components:** V, S, M (a drop of water and a pinch of dust)  \n**Duration:** Concentration, up to 10 minutes\n\n---\n\nUntil the spell ends, you control any freestanding water inside an area you choose that is a cube up to 100 feet on a side. You can choose from any of the following effects when you cast this spell. As an action on your turn, you can repeat the same effect or choose a different one.\n\n***Flood.*** You cause the water level of all standing water in the area to rise by as much as 20 feet. If the area includes a shore, the flooding water spills over onto dry land.\n\nIf you choose an area in a large body of water, you instead create a 20-foot tall wave that travels from one side of the area to the other and then crashes down. Any Huge or smaller vehicles in the wave's path are carried with it to the other side. Any Huge or smaller vehicles struck by the wave have a 25 percent chance of capsizing.\n\nThe water level remains elevated until the spell ends or you choose a different effect. If this effect produced a wave, the wave repeats on the start of your next turn while the flood effect lasts.\n\n***Part Water.*** You cause water in the area to move apart and create a trench. The trench extends across the spell's area, and the separated water forms a wall to either side. The trench remains until the spell ends or you choose a different effect. The water then slowly fills in the trench over the course of the next round until the normal water level is restored.\n\n***Redirect Flow.*** You cause flowing water in the area to move in a direction you choose, even if the water has to flow over obstacles, up walls, or in other unlikely directions. The water in the area moves as you direct it, but once it moves beyond the spell's area, it resumes its flow based on the terrain conditions. The water continues to move in the direction you chose until the spell ends or you choose a different effect.\n\n***Whirlpool.*** This effect requires a body of water at least 50 feet square and 25 feet deep. You cause a whirlpool to form in the center of the area. The whirlpool forms a vortex that is 5 feet wide at the base, up to 50 feet wide at the top, and 25 feet tall. Any creature or object in the water and within 25 feet of the vortex is pulled 10 feet toward it. A creature can swim away from the vortex by making a Strength (Athletics) check against your spell save DC.\n\nWhen a creature enters the vortex for the first time on a turn or starts its turn there, it must make a Strength saving throw. On a failed save, the creature takes [2d8 bludgeoning damage](roll \"2d8\") and is caught in the vortex until the spell ends. On a successful save, the creature takes half damage, and isn't caught in the vortex. A creature caught in the vortex can use its action to try to swim away from the vortex as described above, but has disadvantage on the Strength (Athletics) check to do so.\n\nThe first time each turn that an object enters the vortex, the object takes [2d8 bludgeoning damage](roll \"2d8\"); this damage occurs each round it remains in the vortex.","sources":["SRD","PHB"]},"blight":{"description":"*4th-level necromancy*  \n**Casting Time:** 1 action  \n**Range:** 30 feet  \n**Components:** V, S  \n**Duration:** Instantaneous\n\n---\n\nNecromantic energy washes over a creature of your choice that you can see within range, draining moisture and vitality from it. The target must make a Constitution saving throw. The target takes [8d8 necrotic damage](roll \"8d8\") on a failed save, or half as much damage on a successful one. This spell has no effect on undead or constructs.\n\nIf you target a plant creature or a magical plant, it makes the saving throw with disadvantage, and the spell deals maximum damage to it.\n\nIf you target a nonmagical plant that isn't a creature, such as a tree or shrub, it doesn't make a saving throw, it simply withers and dies.\n\n***At Higher Levels.*** When you cast this spell using a spell slot of 5th level or higher, the damage increases by [1d8](roll \"1d8\") for each slot level above 4th.","sources":["SRD","PHB"]},"hallucinatory terrain":{"description":"*4th-level illusion*  \n**Casting Time:** 10 minutes  \n**Range:** 300 feet  \n**Components:** V, S, M (a stone, a twig, and a bit of green plant)  \n**Duration:** 24 hours\n\n---\n\nYou make natural terrain in a 150-foot cube in range look, sound, and smell like some other sort of natural terrain. Thus, open fields or a road can be made to resemble a swamp, hill, crevasse, or some other difficult or impassable terrain. A pond can be made to seem like a grassy meadow, a precipice like a gentle slope, or a rock-strewn gully like a wide and smooth road. Manufactured structures, equipment, and creatures within the area aren't changed in appearance.\n\nThe tactile characteristics of the terrain are unchanged, so creatures entering the area are likely to see through the illusion. If the difference isn't obvious by touch, a creature carefully examining the illusion can attempt an Intelligence (Investigation) check against your spell save DC to disbelieve it. A creature who discerns the illusion for what it is, sees it as a vague image superimposed on the terrain.","sources":["SRD","PHB"]},"divination":{"description":"*4th-level divination (ritual)*  \n**Casting Time:** 1 action  \n**Range:** Self  \n**Components:** V, S, M (incense and a sacrificial offering appropriate to your religion, together worth at least 25 gp, which the spell consumes)  \n**Duration:** Instantaneous\n\n---\n\nYour magic and an offering put you in contact with a god or a god's servants. You ask a single question concerning a specific goal, event, or activity to occur within 7 days. The DM offers a truthful reply. The reply might be a short phrase, a cryptic rhyme, or an omen.\n\nThe spell doesn't take into account any possible circumstances that might change the outcome, such as the casting of additional spells or the loss or gain of a companion.\n\nIf you cast the spell two or more times before finishing your next long rest, there is a cumulative 25 percent chance for each casting after the first that you get a random reading. The DM makes this roll in secret.","sources":["SRD","PHB"]},"stoneskin":{"description":"*4th-level abjuration*  \n**Casting Time:** 1 action  \n**Range:** Touch  \n**Components:** V, S, M (diamond dust worth 100 gp, which the spell consumes)  \n**Duration:** Concentration, up to 1 hour\n\n---\n\nThis spell turns the flesh of a willing creature you touch as hard as stone. Until the spell ends, the target has resistance to nonmagical bludgeoning, piercing, and slashing damage.","sources":["SRD","PHB"]},"freedom of movement":{"description":"*4th-level abjuration*  \n**Casting Time:** 1 action  \n**Range:** Touch  \n**Components:** V, S, M (a leather strap, bound around the arm or a similar appendage)  \n**Duration:** 1 hour\n\n---\n\nYou touch a willing creature. For the duration, the target's movement is unaffected by difficult terrain, and spells and other magical effects can neither reduce the target's speed nor cause the target to be paralyzed or restrained.\n\nThe target can also spend 5 feet of movement to automatically escape from nonmagical restraints, such as manacles or a creature that has it grappled. Finally, being underwater imposes no penalties on the target's movement or attacks.","sources":["SRD","PHB"]},"locate creature":{"description":"*4th-level divination*  \n**Casting Time:** 1 action  \n**Range:** Self  \n**Components:** V, S, M (a bit of fur from a bloodhound)  \n**Duration:** Concentration, up to 1 hour\n\n---\n\nDescribe or name a creature that is familiar to you. You sense the direction to the creature's location, as long as that creature is within 1,000 feet of you. If the creature is moving, you know the direction of its movement.\n\nThe spell can locate a specific creature known to you, or the nearest creature of a specific kind (such as a human or a unicorn), so long as you have seen such a creature up close—within 30 feet—at least once. If the creature you described or named is in a different form, such as being under the effects of a polymorph spell, this spell doesn't locate the creature.\n\nThis spell can't locate a creature if running water at least 10 feet wide blocks a direct path between you and the creature.","sources":["SRD","PHB"]},"greater invisibility":{"description":"*4th-level illusion*  \n**Casting Time:** 1 action  \n**Range:** Touch  \n**Components:** V, S  \n**Duration:** Concentration, up to 1 minute\n\n---\n\nYou or a creature you touch becomes invisible until the spell ends. Anything the target is wearing or carrying is invisible as long as it is on the target's person.","sources":["SRD","PHB"]},"stone shape":{"description":"*4th-level transmutation*  \n**Casting Time:** 1 action  \n**Range:** Touch  \n**Components:** V, S, M (soft clay, which must be worked into roughly the desired shape of the stone object)  \n**Duration:** Instantaneous\n\n---\n\nYou touch a stone object of Medium size or smaller or a section of stone no more than 5 feet in any dimension and form it into any shape that suits your purpose. So, for example, you could shape a large rock into a weapon, idol, or coffer, or make a small passage through a wall, as long as the wall is less than 5 feet thick. You could also shape a stone door or its frame to seal the door shut. The object you create can have up to two hinges and a latch, but finer mechanical detail isn't possible.","sources":["SRD","PHB"]},"cone of cold":{"description":"*5th-level evocation*  \n**Casting Time:** 1 action  \n**Range:** Self (60-foot cone)  \n**Components:** V, S, M (a small crystal or glass cone)  \n**Duration:** Instantaneous\n\n---\n\nA blast of cold air erupts from your hands. Each creature in a 60-foot cone must make a Constitution saving throw. A creature takes [8d8 cold damage](roll \"8d8\") on a failed save, or half as much damage on a successful one.\n\nA creature killed by this spell becomes a frozen statue until it thaws.\n\n***At Higher Levels.*** When you cast this spell using a spell slot of 6th level or higher, the damage increases by [1d8](roll \"8d8+1d8*slot5\") for each slot level above 5th.","sources":["SRD","PHB"]},"conjure elemental":{"description":"*5th-level conjuration*  \n**Casting Time:** 1 minute  \n**Range:** 90 feet   \n**Components:** V, S, M (burning incense for air, soft clay for earth, sulfur and phosphorus for fire, or water and sand for water)  \n**Duration:** Concentration, up to 1 hour\n\n---\n\nYou call forth an elemental servant. Choose an area of air, earth, fire, or water that fills a 10-foot cube within range. An elemental of challenge rating 5 or lower appropriate to the area you chose appears in an unoccupied space within 10 feet of it. For example, a fire elemental emerges from a bonfire, and an earth elemental rises up from the ground. The elemental disappears when it drops to 0 hit points or when the spell ends.\n\nThe elemental is friendly to you and your companions for the duration. Roll initiative for the elemental, which has its own turns. It obeys any verbal commands that you issue to it (no action required by you). If you don't issue any commands to the elemental, it defends itself from hostile creatures but otherwise takes no actions.\n\nIf your concentration is broken, the elemental doesn't disappear. Instead, you lose control of the elemental, it becomes hostile toward you and your companions, and it might attack. An uncontrolled elemental can't be dismissed by you, and it disappears 1 hour after you summoned it.\n\nThe DM has the elemental's statistics.\n\n***At Higher Levels.*** When you cast this spell using a spell slot of 6th level or higher, the challenge rating increases by 1 for each slot level above 5th.","sources":["SRD","PHB"]},"commune with nature":{"description":"*5th-level divination (ritual)*  \n**Casting Time:** 1 minute  \n**Range:** Self  \n**Components:** V, S  \n**Duration:** Instantaneous\n\n---\n\nYou briefly become one with nature and gain knowledge of the surrounding territory. In the outdoors, the spell gives you knowledge of the land within 3 miles of you. In caves and other natural underground settings, the radius is limited to 300 feet. The spell doesn't function where nature has been replaced by construction, such as in dungeons and towns.\n\nYou instantly gain knowledge of up to three facts of your choice about any of the following subjects as they relate to the area:\n\n- terrain and bodies of water\n- prevalent plants, minerals, animals, or peoples\n- powerful celestials, fey, fiends, elementals, or undead\n- influence from other planes of existence\n- buildings\n\nFor example, you could determine the location of powerful undead in the area, the location of major sources of safe drinking water, and the location of any nearby towns.","sources":["SRD","PHB"]},"tree stride":{"description":"*5th-level conjuration*  \n**Casting Time:** 1 action  \n**Range:** Self  \n**Components:** V, S  \n**Duration:** Concentration, up to 1 minute\n\n---\n\nYou gain the ability to enter a tree and move from inside it to inside another tree of the same kind within 500 feet. Both trees must be living and at least the same size as you. You must use 5 feet of movement to enter a tree. You instantly know the location of all other trees of the same kind within 500 feet and, as part of the move used to enter the tree, can either pass into one of those trees or step out of the tree you're in. You appear in a spot of your choice within 5 feet of the destination tree, using another 5 feet of movement. If you have no movement left, you appear within 5 feet of the tree you entered.\n\nYou can use this transportation ability once per round for the duration. You must end each turn outside a tree.","sources":["SRD","PHB"]},"dream":{"description":"*5th-level illusion*  \n**Casting Time:** 1 minute  \n**Range:** Special  \n**Components:** V, S, M (a handful of sand, a dab of ink, and a writing quill plucked from a sleeping bird)  \n**Duration:** 8 hours\n\n---\n\nThis spell shapes a creature's dreams. Choose a creature known to you as the target of this spell. The target must be on the same plane of existence as you. Creatures that don't sleep, such as elves, can't be contacted by this spell. You, or a willing creature you touch, enters a trance state, acting as a messenger. While in the trance, the messenger is aware of his or her surroundings, but can't take actions or move.\n\nIf the target is asleep, the messenger appears in the target's dreams and can converse with the target as long as it remains asleep, through the duration of the spell. The messenger can also shape the environment of the dream, creating landscapes, objects, and other images. The messenger can emerge from the trance at any time, ending the effect of the spell early. The target recalls the dream perfectly upon waking. If the target is awake when you cast the spell, the messenger knows it, and can either end the trance (and the spell) or wait for the target to fall asleep, at which point the messenger appears in the target's dreams.\n\nYou can make the messenger appear monstrous and terrifying to the target. If you do, the messenger can deliver a message of no more than ten words and then the target must make a Wisdom saving throw. On a failed save, echoes of the phantasmal monstrosity spawn a nightmare that lasts the duration of the target's sleep and prevents the target from gaining any benefit from that rest. In addition, when the target wakes up, it takes [3d6 psychic damage](roll \"3d6\").\n\nIf you have a body part, lock of hair, clipping from a nail, or similar portion of the target's body, the target makes its saving throw with disadvantage.","sources":["SRD","PHB"]},"passwall":{"description":"*5th-level transmutation*  \n**Casting Time:** 1 action  \n**Range:** 30 feet  \n**Components:** V, S, M (a pinch of sesame seeds)  \n**Duration:** 1 hour\n\n---\n\nA passage appears at a point of your choice that you can see on a wooden, plaster, or stone surface (such as a wall, a ceiling, or a floor) within range, and lasts for the duration. You choose the opening's dimensions: up to 5 feet wide, 8 feet tall, and 20 feet deep. The passage creates no instability in a structure surrounding it.\n\nWhen the opening disappears, any creatures or objects still in the passage created by the spell are safely ejected to an unoccupied space nearest to the surface on which you cast the spell.","sources":["SRD","PHB"]},"wall of stone":{"description":"*5th-level evocation*  \n**Casting Time:** 1 action  \n**Range:** 120 feet  \n**Components:** V, S, M (a small block of granite)  \n**Duration:** Concentration, up to 10 minutes\n\n---\n\nA nonmagical wall of solid stone springs into existence at a point you choose within range. The wall is 6 inches thick and is composed of ten 10-foot-by-10-foot panels. Each panel must be contiguous with at least one other panel. Alternatively, you can create 10-foot-by-20-foot panels that are only 3 inches thick.\n\nIf the wall cuts through a creature's space when it appears, the creature is pushed to one side of the wall (your choice). If a creature would be surrounded on all sides by the wall (or the wall and another solid surface), that creature can make a Dexterity saving throw. On a success, it can use its reaction to move up to its speed so that it is no longer enclosed by the wall.\n\nThe wall can have any shape you desire, though it can't occupy the same space as a creature or object. The wall doesn't need to be vertical or rest on any firm foundation. It must, however, merge with and be solidly supported by existing stone. Thus, you can use this spell to bridge a chasm or create a ramp.\n\nIf you create a span greater than 20 feet in length, you must halve the size of each panel to create supports. You can crudely shape the wall to create crenellations, battlements, and so on.\n\nThe wall is an object made of stone that can be damaged and thus breached. Each panel has AC 15 and 30 hit points per inch of thickness. Reducing a panel to 0 hit points destroys it and might cause connected panels to collapse at the DM's discretion.\n\nIf you maintain your concentration on this spell for its whole duration, the wall becomes permanent and can't be dispelled. Otherwise, the wall disappears when the spell ends.","sources":["SRD","PHB"]},"scrying":{"description":"*5th-level divination*  \n**Casting Time:** 10 minutes  \n**Range:** Self  \n**Components:** V, S, M (a focus worth at least 1,000 gp, such as a crystal ball, a silver mirror, or a font filled with holy water)  \n**Duration:** Concentration, up to 10 minutes\n\n---\n\nYou can see and hear a particular creature you choose that is on the same plane of existence as you. The target must make a Wisdom saving throw, which is modified by how well you know the target and the sort of physical connection you have to it. If a target knows you're casting this spell, it can fail the saving throw voluntarily if it wants to be observed.\n\n##### Knowledge of Target\n\n|Knowledge|Save Modifier|\n|---|---:|\n|Secondhand (you have heard of the target)|+5|\n|Firsthand (you have met the target)|+0|\n|Familiar (you know the target well)|-5|\n\n##### Connection to Target\n\n|Connection|Save Modifier|\n|---|---:|\n|Likeness or picture|-2|\n|Possession or garment|-4|\n|Body part, lock of hair, bit of nail, or the like|-10|\n\nOn a successful save, the target isn't affected, and you can't use this spell against it again for 24 hours.\n\nOn a failed save, the spell creates an invisible sensor within 10 feet of the target. You can see and hear through the sensor as if you were there. The sensor moves with the target, remaining within 10 feet of it for the duration. A creature that can see invisible objects sees the sensor as a luminous orb about the size of your fist.\n\nInstead of targeting a creature, you can choose a location you have seen before as the target of this spell. When you do, the sensor appears at that location and doesn't move.","sources":["SRD","PHB"]},"cloudkill":{"description":"*5th-level conjuration*  \n**Casting Time:** 1 action  \n**Range:** 120 feet  \n**Components:** V, S  \n**Duration:** Concentration, up to 10 minutes\n\n---\n\nYou create a 20-foot-radius sphere of poisonous, yellow-green fog centered on a point you choose within range. The fog spreads around corners. It lasts for the duration or until strong wind disperses the fog, ending the spell. Its area is heavily obscured.\n\nWhen a creature enters the spell's area for the first time on a turn or starts its turn there, that creature must make a Constitution saving throw. The creature takes [5d8 poison damage](roll \"5d8\") on a failed save, or half as much damage on a successful one. Creatures are affected even if they hold their breath or don't need to breathe.\n\nThe fog moves 10 feet away from you at the start of each of your turns, rolling along the surface of the ground. The vapors, being heavier than air, sink to the lowest level of the land, even pouring down openings.\n\n***At Higher Levels.*** When you cast this spell using a spell slot of 6th level or higher, the damage increases by [1d8](roll \"5d8+1d8*slot5\") for each slot level above 5th.","sources":["SRD","PHB"]},"insect plague":{"description":"*5th-level conjuration*  \n**Casting Time:** 1 action  \n**Range:** 300 feet  \n**Components:** V, S, M (a few grains of sugar, some kernels of grain, and a smear of fat)  \n**Duration:** Concentration, up to 10 minutes\n\n---\n\nSwarming, biting locusts fill a 20-foot-radius sphere centered on a point you choose within range. The sphere spreads around corners. The sphere remains for the duration, and its area is lightly obscured. The sphere's area is difficult terrain.\n\nWhen the area appears, each creature in it must make a Constitution saving throw. A creature takes [4d10 piercing damage](roll \"4d10\") on a failed save, or half as much damage on a successful one. A creature must also make this saving throw when it enters the spell's area for the first time on a turn or ends its turn there.\n\n***At Higher Levels.*** When you cast this spell using a spell slot of 6th level or higher, the damage increases by [1d10](roll \"4d10+1d10*slot5\") for each slot level above 5th.","sources":["SRD","PHB"]},"find familiar":{"description":"*1st-level conjuration (ritual)*  \n**Casting Time:** 1 hour  \n**Range:** 10 feet  \n**Components:** V, S, M (10 gp worth of charcoal, incense, and herbs that must be consumed by fire in a brass brazier)  \n**Duration:** Instantaneous\n\n---\n\nYou gain the service of a familiar, a spirit that takes an animal form you choose: bat, cat, crab, frog (toad), hawk, lizard, octopus, owl, poisonous snake, fish (quipper), rat, raven, sea horse, spider, or weasel. Appearing in an unoccupied space within range, the familiar has the statistics of the chosen form, though it is a celestial, fey, or fiend (your choice) instead of a beast.\n\nAdditional animal form choices may be available at the DM's discretion.\n\nYour familiar acts independently of you, but it always obeys your commands. In combat, it rolls its own initiative and acts on its own turn. A familiar can't attack, but it can take other actions as normal.\n\nWhen the familiar drops to 0 hit points, it disappears, leaving behind no physical form. It reappears after you cast this spell again.\n\nWhile your familiar is within 100 feet of you, you can communicate with it telepathically. Additionally, as an action, you can see through your familiar's eyes and hear what it hears until the start of your next turn, gaining the benefits of any special senses that the familiar has. During this time, you are deaf and blind with regard to your own senses.\n\nAs an action, you can temporarily dismiss your familiar. It disappears into a pocket dimension where it awaits your summons. Alternatively, you can dismiss it forever. As an action while it is temporarily dismissed, you can cause it to reappear in any unoccupied space within 30 feet of you.\n\nYou can't have more than one familiar at a time. If you cast this spell while you already have a familiar, you instead cause it to adopt a new form. Choose one of the forms from the above list. Your familiar transforms into the chosen creature.\n\nFinally, when you cast a spell with a range of touch, your familiar can deliver the spell as if it had cast the spell. Your familiar must be within 100 feet of you, and it must use its reaction to deliver the spell when you cast it. If the spell requires an attack roll, you use your attack modifier for the roll.","sources":["SRD","PHB"]},"heat metal":{"description":"*2nd-level transmutation*  \n**Casting Time:** 1 action  \n**Range:** 60 feet  \n**Components:** V, S, M (a piece of iron and a flame)  \n**Duration:** Concentration, up to 1 minute\n\n---\n\nChoose a manufactured metal object, such as a metal weapon or a suit of heavy or medium metal armor, that you can see within range. You cause the object to glow red-hot. Any creature in physical contact with the object takes [2d8](roll \"2d8\") fire damage when you cast the spell. Until the spell ends, you can use a bonus action on each of your subsequent turns to cause this damage again.\n\nIf a creature is holding or wearing the object and takes the damage from it, the creature must succeed on a Constitution saving throw or drop the object if it can. If it doesn't drop the object, it has disadvantage on attack rolls and ability checks until the start of your next turn.\n\n***At Higher Levels.*** When you cast this spell using a spell slot of 3rd level or higher, the damage increases by [1d8](roll \"2d8+1d8*slot2\") for each slot level above 2nd.","sources":["SRD","PHB"]},"knock":{"description":"*2nd-level transmutation*  \n**Casting Time:** 1 action  \n**Range:** 60 feet  \n**Components:** V  \n**Duration:** Instantaneous\n\n---\n\nChoose an object that you can see within range. The object can be a door, a box, a chest, a set of manacles, a padlock, or another object that contains a mundane or magical means that prevents access.\n\nA target that is held shut by a mundane lock or that is stuck or barred becomes unlocked, unstuck, or unbarred. If the object has multiple locks, only one of them is unlocked.\n\nIf you choose a target that is held shut with arcane lock, that spell is suppressed for 10 minutes, during which time the target can be opened and shut normally.\n\nWhen you cast the spell, a loud knock, audible from as far away as 300 feet, emanates from the target object.","sources":["SRD","PHB"]},"bestow curse":{"description":"*3rd-level necromancy*  \n**Casting Time:** 1 action  \n**Range:** Touch  \n**Components:** V, S  \n**Duration:** Concentration, up to 1 minute\n\n---\n\nYou touch a creature, and that creature must succeed on a Wisdom saving throw or become cursed for the duration of the spell. When you cast this spell, choose the nature of the curse from the following options:\n\n- Choose one ability score. While cursed, the target has disadvantage on ability checks and saving throws made with that ability score.\n- While cursed, the target has disadvantage on attack rolls against you.\n- While cursed, the target must make a Wisdom saving throw at the start of each of its turns. If it fails, it wastes its action that turn doing nothing.\n- While the target is cursed, your attacks and spells deal an extra [1d8](roll \"1d8\") necrotic damage to the target.\n\nA [remove curse](spells \"Remove Curse\") spell ends this effect. At the DM's option, you may choose an alternative curse effect, but it should be no more powerful than those described above. The DM has final say on such a curse's effect.\n\n***At Higher Levels.*** If you cast this spell using a spell slot of 4th level or higher, the duration is concentration, up to 10 minutes. If you use a spell slot of 5th level or higher, the duration is 8 hours. If you use a spell slot of 7th level or higher, the duration is 24 hours. If you use a 9th level spell slot, the spell lasts until it is dispelled. Using a spell slot of 5th level or higher grants a duration that doesn't require concentration.","sources":["SRD","PHB"]},"tongues":{"description":"*3rd-level divination*  \n**Casting Time:** 1 action  \n**Range:** Touch  \n**Components:** V, M (a small clay model of a ziggurat)  \n**Duration:** 1 hour\n\n---\n\nThis spell grants the creature you touch the ability to understand any spoken language it hears. Moreover, when the target speaks, any creature that knows at least one language and can hear the target understands what it says.","sources":["SRD","PHB"]}}
