{
    "Fighting Style: Archery": {
        "description": "You gain a +2 bonus to attack rolls you make with ranged weapons.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Fighting Style: Defense": {
        "description": "While you are wearing armor, you gain a +1 bonus to AC.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Fighting Style: Dueling": {
        "description": "When you are wielding a melee weapon in one hand and no other weapons, you gain a +2 bonus to damage rolls with that weapon.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Fighting Style: Great Weapon Fighting": {
        "description": "When you roll a 1 or 2 on a damage die for an attack you make with a melee weapon that you are wielding with two hands, you can reroll the die and must use the new roll, even if the new roll is a 1 or a 2. The weapon must have the two-handed or versatile property for you to gain this benefit.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Fighting Style: Protection": {
        "description": "When a creature you can see attacks a target other than you that is within 5 feet of you, you can use your reaction to impose disadvantage on the attack roll. You must be wielding a shield.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Fighting Style: Two-Weapon Fighting": {
        "description": "When you engage in two-weapon fighting, you can add your ability modifier to the damage of the second attack.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Channel Divinity: Turn Undead": {
        "description": "As an action, you present your holy symbol and speak a prayer censuring the undead. Each undead that can see or hear you within 30 feet of you must make a Wisdom saving throw. If the creature fails its saving throw, it is turned for 1 minute or until it takes any damage.\n\nA turned creature must spend its turns trying to move as far away from you as it can, and it can't willingly move to a space within 30 feet of you. It also can't take reactions. For its action, it can use only the Dash action or try to escape from an effect that prevents it from moving. If there's nowhere to move, the creature can use the Dodge action.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Channel Divinity: Preserve Life": {
        "description": "Starting at 2nd level, you can use your Channel Divinity to heal the badly injured.\n\nAs an action, you present your holy symbol and evoke healing energy that can restore a number of hit points equal to five times your cleric level. Choose any creatures within 30 feet of you, and divide those hit points among them. This feature can restore a creature to no more than half of its hit point maximum. You can't use this feature on an undead or a construct.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Channel Divinity: Sacred Weapon": {
        "description": "As an action, you can imbue one weapon that you are holding with positive energy, using your Channel Divinity. For 1 minute, you add your Charisma modifier to attack rolls made with that weapon (with a minimum bonus of +1). The weapon also emits bright light in a 20-foot radius and dim light 20 feet beyond that. If the weapon is not already magical, it becomes magical for the duration.\n\nYou can end this effect on your turn as part of any other action. If you are no longer holding or carrying this weapon, or if you fall unconscious, this effect ends.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Channel Divinity: Turn the Unholy": {
        "description": "As an action, you present your holy symbol and speak a prayer censuring fiends and undead, using your Channel Divinity. Each fiend or undead that can see or hear you within 30 feet of you must make a Wisdom saving throw. If the creature fails its saving throw, it is turned for 1 minute or until it takes damage.\n\nA turned creature must spend its turns trying to move as far away from you as it can, and it can't willingly move to a space within 30 feet of you. It also can't take reactions. For its action, it can use only the Dash action or try to escape from an effect that prevents it from moving. If there's nowhere to move, the creature can use the Dodge action.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Metamagic: Careful Spell": {
        "description": "When you cast a spell that forces other creatures to make a saving throw, you can protect some of those creatures from the spell's full force. To do so, you spend 1 sorcery point and choose a number of those creatures up to your Charisma modifier (minimum of one creature). A chosen creature automatically succeeds on its saving throw against the spell.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Metamagic: Distant Spell": {
        "description": "When you cast a spell that has a range of 5 feet or greater, you can spend 1 sorcery point to double the range of the spell.\n\nWhen you cast a spell that has a range of touch, you can spend 1 sorcery point to make the range of the spell 30 feet.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Metamagic: Empowered Spell": {
        "description": "When you roll damage for a spell, you can spend 1 sorcery point to reroll a number of the damage dice up to your Charisma modifier (minimum of one). You must use the new rolls.\n\nYou can use Empowered Spell even if you have already used a different Metamagic option during the casting of the spell.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Metamagic: Extended Spell": {
        "description": "When you cast a spell that has a duration of 1 minute or longer, you can spend 1 sorcery point to double its duration, to a maximum duration of 24 hours.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Metamagic: Heightened Spell": {
        "description": "When you cast a spell that forces a creature to make a saving throw to resist its effects, you can spend 3 sorcery points to give one target of the spell disadvantage on its first saving throw made against the spell.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Metamagic: Quickened Spell": {
        "description": "When you cast a spell that has a casting time of 1 action, you can spend 2 sorcery points to change the casting time to 1 bonus action for this casting.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Metamagic: Subtle Spell": {
        "description": "When you cast a spell, you can spend 1 sorcery point to cast it without any somatic or verbal components.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Metamagic: Twinned Spell": {
        "description": "When you cast a spell that targets only one creature and doesn't have a range of self, you can spend a number of sorcery points equal to the spell's level to target a second creature in range with the same spell (1 sorcery point if the spell is a cantrip).\n\nTo be eligible, a spell must be incapable of targeting more than one creature at the spell's current level. For example, magic missile and scorching ray aren't eligible, but ray of frost and chromatic orb are.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Eldritch Invocation: Ascendant Step": {
        "description": "*Prerequisites: 9th level*\n\nYou can cast [levitate](level 2 \"Levitate\") on yourself at will, without expending a spell slot or material components.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Eldritch Invocation: Agonizing Blast": {
        "description": "*Prerequisites: eldritch blast cantrip*\n\nWhen you cast [eldritch blast](level 0 \"Eldritch Blast\"), add your Charisma modifier to the damage it deals on a hit.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Eldritch Invocation: Armor of Shadows": {
        "description": "You can cast [mage armor](level 1 \"Mage Armor\") on yourself at will, without expending a spell slot or material components.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Eldritch Invocation: Beast Speech": {
        "description": "You can cast [speak with animals](level 1 \"Speak with Animals\") at will, without expending a spell slot",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Eldritch Invocation: Beguiling Influence": {
        "description": "You gain proficiency in the Deception and Persuasion skills.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Eldritch Invocation: Bewitching Whispers": {
        "description": "*Prerequisites: 7th level*\n\nYou can cast [compulsion](level 4 \"Compulsion\") once using a warlock spell slot. You can't do so again until you finish a long rest.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Eldritch Invocation: Book of Ancient Secrets": {
        "description": "*Prerequisites: Pact of the Tome*\n\nYou can now inscribe magical rituals in your Book of Shadows. Choose two 1st-level spells that have the ritual tag from any class's spell list. The spells needn't be from the same spell list. The spells appear in the book and don't count against the number of spells you know. With your Book of Shadows in hand, you can cast the chosen spells as rituals. You can't cast the spells except as rituals, unless you've learned them by some other means. You can also cast a warlock spell you know as a ritual if it has the ritual tag.\n\nOn your adventures, you can add other ritual spells to your Book of Shadows. When you find such a spell, you can add it to the book if the spell's level is equal to or less than half your warlock level (rounded up) and if you can spare the time to transcribe the spell. For each level of the spell, the transcription process takes 2 hours and costs 50 gp for the rare inks needed to inscribe it.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Eldritch Invocation: Chains of Carceri": {
        "description": "*Prerequisites: 15th level, Pact of the Chain*\n\nYou can cast [hold monster](level 5 \"Hold Monster\") at will—targeting a celestial, fiend, or elemental—without expending a spell slot or material components. You must finish a long rest before you can use this invocation on the same creature again.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Eldritch Invocation: Devil's Sight": {
        "description": "You can see normally in darkness, both magical and nonmagical, to a distance of 120 feet.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Eldritch Invocation: Dreadful Word": {
        "description": "*Prerequisites: 7th level*\n\nYou can cast [confusion](level 4 \"Confusion\") once using a warlock spell slot. You can't do so again until you finish a long rest.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Eldritch Invocation: Eldritch Sight": {
        "description": "You can cast [detect magic](level 1 \"Detect Magic\") at will, without expending a spell slot.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Eldritch Invocation: Eldritch Spear": {
        "description": "*Prerequisites: eldritch blast cantrip*\n\nWhen you cast [eldritch blast](level 0 \"Eldritch Bast\"), its range is 300 feet.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Eldritch Invocation: Eyes of the Rune Keeper": {
        "description": "You can read all writing.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Eldritch Invocation: Fiendish Vigor": {
        "description": "You can cast [false life](level 1 \"False Life\") on yourself at will as a 1st-level spell, without expending a spell slot or material components.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Eldritch Invocation: Gaze of Two Minds": {
        "description": "You can use your action to touch a willing humanoid and perceive through its senses until the end of your next turn. As long as the creature is on the same plane of existence as you, you can use your action on subsequent turns to maintain this connection, extending the duration until the end of your next turn. While perceiving through the other creature's senses, you benefit from any special senses possessed by that creature, and you are blinded and deafened to your own surroundings.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Eldritch Invocation: Lifedrinker": {
        "description": "*Prerequisites: 12th level, Pact of the Blade*\n\nWhen you hit a creature with your pact weapon, the creature takes extra necrotic damage equal to your Charisma modifier (minimum of 1).",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Eldritch Invocation: Mask of Many Faces": {
        "description": "You can cast [disguise self](level 1 \"Disguise Self\") at will, without expending a spell slot.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Eldritch Invocation: Master of Myriad Forms": {
        "description": "*Prerequisites: 15th level*\n\nYou can cast [alter self](level 2 \"Alter Self\") at will, without expending a spell slot.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Eldritch Invocation: Minions of Chaos": {
        "description": "*Prerequisites: 9th level*\n\nYou can cast [conjure elemental](level 5 \"Conjure Elemental\") once using a warlock spell slot. You can't do so again until you finish a long rest.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Eldritch Invocation: Mire the Mind": {
        "description": "*Prerequisites: 5th level*\n\nYou can cast [slow](level 3 \"Slow\") once using a warlock spell slot. You can't do so again until you finish a long rest.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Eldritch Invocation: Misty Visions": {
        "description": "You can cast [silent image](spell 1 \"Silent Image\") at will, without expending a spell slot or material components.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Eldritch Invocation: One with Shadows": {
        "description": "*Prerequisites: 5th level*\n\nWhen you are in an area of dim light or darkness, you can use your action to become invisible until you move or take an action or a reaction.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Eldritch Invocation: Repelling Blast": {
        "description": "*Prerequisites: eldritch blast cantrip*\n\nWhen you hit a creature with [eldritch blast](level 0 \"Eldritch Blast\"), you can push the creature up to 10 feet away from you in a straight line.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Eldritch Invocation: Sculptor of Flesh": {
        "description": "*Prerequisites: 7th level*\n\nYou can cast [polymorph](level 4 \"Polymorph\") once using a warlock spell slot. You can't do so again until you finish a long rest.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Eldritch Invocation: Sign of Ill Omen": {
        "description": "*Prerequisites: 5th level*\n\nYou can cast [bestow curse](level 3 \"Bestow Curse\") once using a warlock spell slot. You can't do so again until you finish a long rest.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Eldritch Invocation: Thief of Five Fates": {
        "description": "You can cast [bane](level 1 \"Bane\") once using a warlock spell slot. You can't do so again until you finish a long rest.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Eldritch Invocation: Thirsting Blade": {
        "description": "*Prerequisites: 5th level, Pact of the Blade*\n\nYou can attack with your pact weapon twice, instead of once, whenever you take the Attack action on your turn.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Eldritch Invocation: Visions of Distant Realms": {
        "description": "*Prerequisites: 15th level*\n\nYou can cast [arcane eye](level 4 \"Arcane Eye\") at will, without expending a spell slot.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Eldritch Invocation: Voice of the Chain Master": {
        "description": "*Prerequisites: Pact of the Chain*\n\nYou can communicate telepathically with your familiar and perceive through your familiar's senses as long as you are on the same plane of existence. Additionally, while perceiving through your familiar's senses, you can also speak through your familiar in your own voice, even if your familiar is normally incapable of speech.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Eldritch Invocation: Whispers of the Grave": {
        "description": "*Prerequisites: 9th level*\n\nYou can cast [speak with dead](level 3 \"Speak with Dead\") at will, without expending a spell slot.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Eldritch Invocation: Witch Sight": {
        "description": "*Prerequisites: 15th level*\n\nYou can see the true form of any shapechanger or creature concealed by illusion or transmutation magic while the creature is within 30 feet of you and within line of sight.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Eldritch Invocation: Otherworldly Leap": {
        "description": "*Prerequisites: 9th level*\n\nYou can cast [jump](level 1 \"Jump\") on yourself at will, without expending a spell slot or material components.",
        "sources": [
            "SRD",
            "PHB"
        ]
    }
}
