{
    "Action Surge": {
        "description": "Starting at 2nd level, you can push yourself beyond your normal limits for a moment. On your turn, you can take one additional action.\n\nOnce you use this feature, you must finish a short or long rest before you can use it again. Starting at 17th level, you can use it twice before a rest, but only once on the same turn.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Second Wind": {
        "description": "You have a limited well of stamina that you can draw on to protect yourself from harm. On your turn, you can use a bonus action to regain hit points equal to [1d10 + your fighter level](roll \"1d10+fighter\").\n\nOnce you use this feature, you must finish a short or long rest before you can use it again.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Divine Smite": {
        "description": "Starting at 2nd level, when you hit a creature with a melee weapon attack, you can expend one spell slot to deal radiant damage to the target, in addition to the weapon's damage. The extra damage is [2d8](roll \"2d8\") for a 1st-level spell slot, plus [1d8](roll \"1d8\") for each spell level higher than 1st, to a maximum of 5d8. The damage increases by [1d8](roll \"1d8\") if the target is an undead or a fiend, to a maximum of [6d8](roll \"6d8\").",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Grappler": {
        "description": "*Prerequisites: Strength 13 or higher*\n\nYou've developed the skills necessary to hold your own in close-quarters grappling. You gain the following benefits:\n- You have advantage on attack rolls against a creature you are grappling.\n- You can use your action to try to pin a creature grappled by you. To do so, make another grapple check. If you succeed, you and the creature are both restrained until the grapple ends.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Shelter of the Faithful": {
        "description": "As an acolyte, you command the respect of those who share your faith, and you can perform the religious ceremonies of your deity. You and your adventuring companions can expect to receive free healing and care at a temple, shrine, or other established presence of your faith, though you must provide any material components needed for spells. Those who share your religion will support you (but only you) at a modest lifestyle.\n\nYou might also have ties to a specific temple dedicated to your chosen deity or pantheon, and you have a residence there. This could be the temple where you used to serve, if you remain on good terms with it, or a temple where you have found a new home. While near your temple, you can call upon the priests for assistance, provided the assistance you ask for is not hazardous and you remain in good standing with your temple.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Spellcasting (Cleric)": {
        "description": "As a conduit for divine power, you can cast cleric spells. See chapter 10 for the general rules of spellcasting and chapter 11 for a selection of cleric spells.\n\n#### Cantrips\n\nAt 1st level, you know three cantrips of your choice from the cleric spell list. You learn additional cleric cantrips of your choice at higher levels, as shown in the Cantrips Known column of the Cleric table.\n\n#### Preparing and Casting Spells\n\nThe Cleric table shows how many spell slots you have to cast your cleric spells of 1st level and higher. To cast one of these spells, you must expend a slot of the spell's level or higher. You regain all expended spell slots when you finish a long rest.\n\nYou prepare the list of cleric spells that are available for you to cast, choosing from the cleric spell list. When you do so, choose a number of cleric spells equal to your Wisdom modifier + your cleric level (minimum of one spell). The spells must be of a level for which you have spell slots.\n\nFor example, if you are a 3rd-level cleric, you have four 1st-level and two 2nd-level spell slots. With a Wisdom of 16, your list of prepared spells can include six spells of 1st or 2nd level, in any combination. If you prepare the 1st-level spell cure wounds, you can cast it using a 1st-level or 2nd-level slot. Casting the spell doesn't remove it from your list of prepared spells.\n\nYou can change your list of prepared spells when you finish a long rest. Preparing a new list of cleric spells requires time spent in prayer and meditation: at least 1 minute per spell level for each spell on your list.\n\n#### Spellcasting Ability\n\nWisdom is your spellcasting ability for your cleric spells. The power of your spells comes from your devotion to your deity. You use your Wisdom whenever a cleric spell refers to your spellcasting ability. In addition, you use your Wisdom modifier when setting the saving throw DC for a cleric spell you cast and when making an attack roll with one.\n\n**Spell save DC** = 8 + your proficiency bonus + your Wisdom modifier  \n**Spell attack modifier** = your proficiency bonus + your Wisdom modifier\n\n#### Ritual Casting\n\nYou can cast a cleric spell as a ritual if that spell has the ritual tag and you have the spell prepared.\n\n#### Spellcasting Focus\n\nYou can use a holy symbol (found in chapter 5) as a spellcasting focus for your cleric spells.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Divine Domain": {
        "description": "Choose one domain related to your deity from the list of available domains. Each domain is detailed in their own feature, and each one provides examples of gods associated with it. Your choice grants you domain spells and other features when you choose it at 1st level. It also grants you additional ways to use Channel Divinity when you gain that feature at 2nd level, and additional benefits at 6th, 8th, and 17th levels.\n\n### Domain Spells\n\nEach domain has a list of spells—its domain spells—that you gain at the cleric levels noted in the domain description. Once you gain a domain spell, you always have it prepared, and it doesn't count against the number of spells you can prepare each day.\n\nIf you have a domain spell that doesn't appear on the cleric spell list, the spell is nonetheless a cleric spell for you.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Life Domain": {
        "description": "The Life domain focuses on the vibrant positive energy—one of the fundamental forces of the universe—that sustains all life. The gods of life promote vitality and health through healing the sick and wounded, caring for those in need, and driving away the forces of death and undeath. Almost any non-evil deity can claim influence over this domain, particularly agricultural deities (such as Chauntea, Arawai, and Demeter), sun gods (such as Lathander, Pelor, and Re-Horakhty), gods of healing or endurance (such as Ilmater, Mishakal, Apollo, and Diancecht), and gods of home and community (such as Hestia, Hathor, and Boldrei).\n\nAt each indicated cleric level, you add the listed spells to your spells prepared.\n\n##### Life Domain Spells\n\n|Cleric Level         |Spells                                              |\n|:----------------------:|-----------------------------------------------------|\n|1st|[bless](level 1 \"Bless\"), [cure wounds](level 1 \"Cure Wounds\")|\n|3rd|[lesser restoration](level 2 \"Lesser Restoration\"), [spiritual weapon](level 2 \"Spiritual Weapon\")|\n|5th|[beacon of hope](level 3 \"Beacon of Hope\"), [revivify](level 3 \"Revivify\")|\n|7th|[death ward](level 4 \"Death Ward\"), [guardian of faith](level 4 \"Guardian of Faith\")|\n|9th|[mass cure wounds](level 5 \"Mass Cure Wounds\"), [raise dead](level 5 \"Raise Dead\")|\n\n### Bonus Proficiency\n\nWhen you choose this domain at 1st level, you gain proficiency with heavy armor.\n\n### Disciple of Life\n\nAlso starting at 1st level, your healing spells are more effective. Whenever you use a spell of 1st level or higher to restore hit points to a creature, the creature regains additional hit points equal to 2 + the spell's level.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Elf": {
        "description": "Your elf character has a variety of natural abilities, the result of thousands of years of elven refinement.\n\n***Ability Score Increase.*** Your Dexterity score increases by 2.\n\n***Age.*** Although elves reach physical maturity at about the same age as humans, the elven understanding of adulthood goes beyond physical growth to encompass worldly experience. An elf typically claims adulthood and an adult name around the age of 100 and can live to be 750 years old.\n\n***Alignment.*** Elves love freedom, variety, and self-expression, so they lean strongly toward the gentler aspects of chaos. They value and protect others' freedom as well as their own, and they are more often good than not.\n\n***Size.*** Elves range from under 5 to over 6 feet tall and have slender builds. Your size is Medium.\n\n***Speed.*** Your base walking speed is 30 feet.\n\n***Darkvision.*** Accustomed to twilit forests and the night sky, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray.\n\n***Keen Senses.*** You have proficiency in the Perception skill.\nFey Ancestry. You have advantage on saving throws against being charmed, and magic can't put you to sleep.\n\n***Trance.*** Elves don't need to sleep. Instead, they meditate deeply, remaining semiconscious, for 4 hours a day. (The Common word for such meditation is \"trance.\") While meditating, you can dream after a fashion; such dreams are actually mental exercises that have become reflexive through years of practice. After resting in this way, you gain the same benefit that a human does from 8 hours of sleep.\n\n***Languages.*** You can speak, read, and write Common and Elvish. Elvish is fluid, with subtle intonations and intricate grammar. Elven literature is rich and varied, and their songs and poems are famous among other races. Many bards learn their language so they can add Elvish ballads to their repertoires.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Human": {
        "description": "It’s hard to make generalizations about humans, but your human character has these traits.\n\n***Ability Score Increase.*** Your ability scores each increase by 1.\n\n***Age.*** Humans reach adulthood in their late teens and live less than a century.\n\n***Alignment.*** Humans tend toward no particular alignment. The best and the worst are found among them.\n\n***Size.*** Humans vary widely in height and build, from barely 5 feet to well over 6 feet tall. Regardless of your position in that range, your size is Medium.\n\n***Speed.*** Your base walking speed is 30 feet.\n\n***Languages.*** You can speak, read, and write Common and one extra language of your choice. Humans typically learn the languages of other peoples they deal with, including obscure dialects. They are fond of sprinkling their speech with words borrowed from other tongues: Orc curses, Elvish musical expressions, Dwarvish military phrases, and so on.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "High Elf": {
        "description": "As a high elf, you have a keen mind and a mastery of at least the basics of magic. In many of the worlds of\nD&D, there are two kinds of high elves. One type is haughty and reclusive, believing themselves to be superior to non-elves and even other elves. The other type are more common and more friendly, and often encountered among humans and other races.\n\n***Ability Score Increase.*** Your Intelligence score increases by 1.\n\n***Elf Weapon Training.*** You have proficiency with the longsword, shortsword, shortbow, and longbow.\n\n***Cantrip.*** You know one cantrip of your choice from the wizard spell list. Intelligence is your spellcasting ability for it.\n\n***Extra Language.*** You can speak, read, and write one extra language of your choice.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Dwarf": {
        "description": "Your dwarf character has an assortment of inborn abilities, part and parcel of dwarven nature.\n\n***Ability Score Increase.*** Your Constitution score increases by 2.\n\n***Age.*** Dwarves mature at the same rate as humans, but they’re considered young until they reach the age of 50. On average, they live about 350 years.\n\n***Alignment.*** Most dwarves are lawful, believing firmly in the benefits of a well-ordered society. They tend toward good as well, with a strong sense of fair play and a belief that everyone deserves to share in the benefits of a just order.\n\n***Size.*** Dwarves stand between 4 and 5 feet tall and average about 150 pounds. Your size is Medium.\n\n***Speed.*** Your base walking speed is 25 feet. Your speed is not reduced by wearing heavy armor.\n\n***Darkvision.*** Accustomed to life underground, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can’t discern color in darkness, only shades of gray.\n\n***Dwarven Resilience.*** You have advantage on saving throws against poison, and you have resistance against poison damage (explained in chapter 9).\n\n***Dwarven Combat Training.*** You have proficiency with the battleaxe, handaxe, light hammer, and warhammer.\n\n***Tool Proficiency.*** You gain proficiency with the artisan’s tools of your choice: smith’s tools, brewer’s supplies, or mason’s tools.\n\n***Stonecunning.*** Whenever you make an Intelligence (History) check related to the origin of stonework, you are considered proficient in the History skill and add double your proficiency bonus to the check, instead of your normal proficiency bonus.\n\n***Languages.*** You can speak, read, and write Common and Dwarvish. Dwarvish is full of hard consonants and guttural sounds, and those characteristics spill over into whatever other language a dwarf might speak.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Hill Dwarf": {
        "description": "As a hill dwarf, you have keen senses, deep intuition, and remarkable resilience.\n\n***Ability Score Increase.*** Your Wisdom score increases by 1.\n\n***Dwarven Toughness.*** Your hit point maximum increases by 1, and it increases by 1 every time you\ngain a level.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Halfling": {
        "description": "Your halfling character has a number of traits in common with all other halflings.\n\n***Ability Score Increase.*** Your Dexterity score increases by 2.\n\n***Age.*** A halfling reaches adulthood at the age of 20 and generally lives into the middle of his or her second century.\n\n***Alignment.*** Most halflings are lawful good. As a rule, they are good-hearted and kind, hate to see others in pain, and have no tolerance for oppression. They are also very orderly and traditional, leaning heavily on the support of their community and the comfort of their old ways.\n\n***Size.*** Halflings average about 3 feet tall and weigh about 40 pounds. Your size is Small.\n\n***Speed.*** Your base walking speed is 25 feet.\n\n***Lucky.*** When you roll a 1 on the d20 for an attack roll, ability check, or saving throw, you can reroll the die and must use the new roll.\n\n***Brave.*** You have advantage on saving throws against being frightened.\n\n***Halfling Nimbleness.*** You can move through the space of any creature that is of a size larger than yours.\n\n***Languages.*** You can speak, read, and write Common and Halfling. The Halfling language isn’t secret, but halflings are loath to share it with others. They write very little, so they don’t have a rich body of literature. Their oral tradition, however, is very strong. Almost all halflings speak Common to converse with the people in whose lands they dwell or through which they are traveling.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Lightfoot Halfling": {
        "description": "As a lightfoot halfling, you can easily hide from notice, even using other people as cover. You’re inclined to be affable and get along well with others. Lightfoots are more prone to wanderlust than other halflings, and often dwell alongside other races or take up a nomadic life.\n\n***Ability Score Increase.*** Your Charisma score increases by 1.\n\n***Naturally Stealthy.*** You can attempt to hide even when you are obscured only by a creature that is at least one size larger than you.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Gnome": {
        "description": "Your gnome character has certain characteristics in common with all other gnomes.\n\n***Ability Score Increase.*** Your Intelligence score increases by 2.\n\n***Age.*** Gnomes mature at the same rate humans do, and most are expected to settle down into an adult life by around age 40. They can live 350 to almost 500 years.\n\n***Alignment.*** Gnomes are most often good. Those who tend toward law are sages, engineers, researchers, scholars, investigators, or inventors. Those who tend toward chaos are minstrels, tricksters, wanderers, or fanciful jewelers. Gnomes are good-hearted, and even the tricksters among them are more playful than vicious.\n\n***Size.*** Gnomes are between 3 and 4 feet tall and average about 40 pounds. Your size is Small.\n\n***Speed.*** Your base walking speed is 25 feet.\n\n***Darkvision.*** Accustomed to life underground, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray.\n\n***Gnome Cunning.*** You have advantage on all Intelligence, Wisdom, and Charisma saving throws against magic.\n\n***Languages.*** You can speak, read, and write Common and Gnomish. The Gnomish language, which uses the Dwarvish script, is renowned for its technical treatises and its catalogs of knowledge about the natural world.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Rock Gnome": {
        "description": "As a rock gnome, you have a natural inventiveness and hardiness beyond that of other gnomes.\n\n***Ability Score Increase.*** Your Constitution score increases by 1.\n\n***Artificer's Lore.*** Whenever you make an Intelligence (History) check related to magic items, alchemical objects, or technological devices, you can add twice your proficiency bonus, instead of any proficiency bonus you normally apply.\n\n***Tinker.*** You have proficiency with artisan's tools (tinker's tools). Using those tools, you can spend 1 hour and 10 gp worth of materials to construct a Tiny clockwork device (AC 5, 1 hp). The device ceases to function after 24 hours (unless you spend 1 hour repairing it to keep the device functioning), or when you use your action to dismantle it; at that time, you can reclaim the materials used to create it. You can have up to three such devices active at a time.\n\nWhen you create a device, choose one of the following options:\n\n*Clockwork Toy.* This toy is a clockwork animal, monster, or person, such as a frog, mouse, bird, dragon, or soldier. When placed on the ground, the toy moves 5 feet across the ground on each of your turns in a random direction. It makes noises as appropriate to the creature it represents.\n\n*Fire Starter.* The device produces a miniature flame, which you can use to light a candle, torch, or campfire. Using the device requires your action.\n\n*Music Box.* When opened, this music box plays a single song at a moderate volume. The box stops playing when it reaches the song's end or when it is closed.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Half-Elf": {
        "description": "Your half‑elf character has some qualities in common with elves and some that are unique to half‐elves.\n\n***Ability Score Increase.*** Your Charisma score increases by 2, and two other ability scores of your choice increase by 1.\n\n***Age.*** Half-elves mature at the same rate humans do and reach adulthood around the age of 20. They live much longer than humans, however, often exceeding 180 years.\n\n***Alignment.*** Half-elves share the chaotic bent of their elven heritage. They value both personal freedom and creative expression, demonstrating neither love of leaders nor desire for followers. They chafe at rules, resent others' demands, and sometimes prove unreliable, or at least unpredictable.\n\n***Size.*** Half-elves are about the same size as humans, ranging from 5 to 6 feet tall. Your size is Medium.\n\n***Speed.*** Your base walking speed is 30 feet.\n\n***Darkvision.*** Thanks to your elf blood, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray.\n\n***Fey Ancestry.*** You have advantage on saving throws against being charmed, and magic can't put you to sleep.\n\n***Skill Versatility.*** You gain proficiency in two skills of your choice.\n\n***Languages.*** You can speak, read, and write Common, Elvish, and one extra language of your choice.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Half-Orc": {
        "description": "Your half-orc character has certain traits deriving from your orc ancestry.\n\n***Ability Score Increase.*** Your Strength score increases by 2, and your Constitution score increases by 1.\n\n***Age.*** Half-orcs mature a little faster than humans, reaching adulthood around age 14. They age noticeably faster and rarely live longer than 75 years.\n\n***Alignment.*** Half-orcs inherit a tendency toward chaos from their orc parents and are not strongly inclined toward good. Half-orcs raised among orcs and willing to live out their lives among them are usually evil.\n\n***Size.*** Half-orcs are somewhat larger and bulkier than humans, and they range from 5 to well over 6 feet tall. Your size is Medium.\n\n***Speed.*** Your base walking speed is 30 feet.\n\n***Darkvision.*** Thanks to your orc blood, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray.\n\n***Menacing.*** You gain proficiency in the Intimidation skill.\n\n***Relentless Endurance.*** When you are reduced to 0 hit points but not killed outright, you can drop to 1 hit point instead. You can't use this feature again until you finish a long rest.\n\n***Savage Attacks.*** When you score a critical hit with a melee weapon attack, you can roll one of the weapon's damage dice one additional time and add it to the extra damage of the critical hit.\n\n***Languages.*** You can speak, read, and write Common and Orc. Orc is a harsh, grating language with hard consonants. It has no script of its own but is written in the Dwarvish script.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Tiefling": {
        "description": "Tieflings share certain racial traits as a result of their infernal descent.\n\n***Ability Score Increase.*** Your Intelligence score increases by 1, and your Charisma score increases by 2.\n\n***Age.*** Tieflings mature at the same rate as humans but live a few years longer.\n\n***Alignment.*** Tieflings might not have an innate tendency toward evil, but many of them end up there. Evil or not, an independent nature inclines many tieflings toward a chaotic alignment.\n\n***Size.*** Tieflings are about the same size and build as humans. Your size is Medium.\n\n***Speed.*** Your base walking speed is 30 feet.\n\n***Darkvision.*** Thanks to your infernal heritage, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray.\n\n***Hellish Resistance.*** You have resistance to fire damage.\n\n***Infernal Legacy.*** You know the thaumaturgy cantrip. Once you reach 3rd level, you can cast the hellish rebuke spell as a 2nd-level spell; you must finish a long rest in order to cast the spell again using this trait. Once you reach 5th level, you can also cast the darkness spell; you must finish a long rest in order to cast the spell again using this trait. Charisma is your spellcasting ability for these spells.\n\n***Languages.*** You can speak, read, and write Common and Infernal.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Dragonborn": {
        "description": "Your draconic heritage manifests in a variety of traits you share with other dragonborn.\n\n***Age.*** Young dragonborn grow quickly. They walk hours after hatching, attain the size and development of a 10-year-old human child by the age of 3, and reach adulthood by 15. They live to be around 80.\n\n***Alignment.*** Dragonborn tend to extremes, making a conscious choice for one side or the other in the cosmic war between good and evil (represented by Bahamut and Tiamat, respectively). Most dragonborn are good, but those who side with Tiamat can be terrible villains.\n\n***Size.*** Dragonborn are taller and heavier than humans, standing well over 6 feet tall and averaging almost 250 pounds. Your size is Medium.\n\n***Speed.*** Your base walking speed is 30 feet.\n\n***Draconic Ancestry.*** You have draconic ancestry. Choose one type of dragon from the Draconic Ancestry table. Your breath weapon and damage resistance are determined by the dragon type, as shown in the table.\n\n##### Draconic Ancestry\n\n|Dragon|Damage Type|Breath Weapon|\n|:---:|:---:|---|\n|Black|Acid|5 by 30 ft. line (Dex. save)|\n|Blue|Lightning|5 by 30 ft. line (Dex. save)|\n|Brass|Fire|5 by 30 ft. line (Dex. save)|\n|Bronze|Lightning|5 by 30 ft. line (Dex. save)|\n|Copper|Acid|5 by 30 ft. line (Dex. save)|\n|Gold|Fire|15 ft. cone (Dex. save)|\n|Green|Poison|15 ft. cone (Con. save)|\n|Red|Fire|15 ft. cone (Dex. save)|\n|Silver|Cold|15 ft. cone (Con. save)|\n|White|Cold|15 ft. cone (Con. save)|\n\n***Breath Weapon.*** You can use your action to exhale destructive energy. Your draconic ancestry determines the size, shape, and damage type of the exhalation.\n\nWhen you use your breath weapon, each creature in the area of the exhalation must make a saving throw, the type of which is determined by your draconic ancestry. The DC for this saving throw equals 8 + your Constitution modifier + your proficiency bonus. A creature takes [2d6 damage](roll \"2d6\") on a failed save, and half as much damage on a successful one. The damage increases to [3d6](roll \"3d6\") at 6th level, [4d6](roll \"4d6\") at 11th level, and [5d6](roll \"5d6\") at 16th level.\n\nAfter you use your breath weapon, you can't use it again until you complete a short or long rest.\n\n***Damage Resistance.*** You have resistance to the damage type associated with your draconic ancestry.\n\n***Languages.*** You can speak, read, and write Common and Draconic. Draconic is thought to be one of the oldest languages and is often used in the study of magic. The language sounds harsh to most other creatures and includes numerous hard consonants and sibilants.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Bardic Inspiration": {
        "description": "You can inspire others through stirring words or music. To do so, you use a bonus action on your turn to choose one creature other than yourself within 60 feet of you who can hear you. That creature gains one Bardic Inspiration die, a [d6](roll \"1d6\").\n\nOnce within the next 10 minutes, the creature can roll the die and add the number rolled to one ability check, attack roll, or saving throw it makes. The creature can wait until after it rolls the d20 before deciding to use the Bardic Inspiration die, but must decide before the DM says whether the roll succeeds or fails. Once the Bardic Inspiration die is rolled, it is lost. A creature can have only one Bardic Inspiration die at a time.\n\nYou can use this feature a number of times equal to your Charisma modifier (a minimum of once). You regain any expended uses when you finish a long rest.\n\nYour Bardic Inspiration die changes when you reach certain levels in this class. The die becomes a [d8](roll \"1d8\") at 5th level, a [d10](roll \"1d10\") at 10th level, and a [d12](roll \"1d12\") at 15th level.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Spellcasting (Bard)": {
        "description": "You have learned to untangle and reshape the fabric of reality in harmony with your wishes and music. Your spells are part of your vast repertoire, magic that you can tune to different situations. See chapter 10 for the general rules of spellcasting and chapter 11 for the bard spell list.\n\n#### Cantrips\n\nYou know two cantrips of your choice from the bard spell list. You learn additional bard cantrips of your choice at higher levels, learning a 3rd cantrip at 4th level and a 4th at 10th level.\n\n#### Spell Slots\n\nThe Bard table shows how many spell slots you have to cast your bard spells of 1st level and higher. To cast one of these spells, you must expend a slot of the spell's level or higher. You regain all expended spell slots when you finish a long rest.\n\nFor example, if you know the 1st-level spell cure wounds and have a 1st-level and a 2nd-level spell slot available, you can cast cure wounds using either slot.\n\n#### Spells Known of 1st Level and Higher\n\nYou know four 1st-level spells of your choice from the bard spell list.\n\nYou learn an additional bard spell of your choice at each level except 12th, 16th, 19th, and 20th. Each of these spells must be of a level for which you have spell slots. For instance, when you reach 3rd level in this class, you can learn one new spell of 1st or 2nd level.\n\nAdditionally, when you gain a level in this class, you can choose one of the bard spells you know and replace it with another spell from the bard spell list, which also must be of a level for which you have spell slots.\n\n#### Spellcasting Ability\n\nCharisma is your spellcasting ability for your bard spells. Your magic comes from the heart and soul you pour into the performance of your music or oration. You use your Charisma whenever a spell refers to your spellcasting ability. In addition, you use your Charisma modifier when setting the saving throw DC for a bard spell you cast and when making an attack roll with one.\n\n**Spell save DC** = 8 + your proficiency bonus + your Charisma modifier  \n**Spell attack modifier** = your proficiency bonus + your Charisma modifier\n\n#### Ritual Casting\n\nYou can cast any bard spell you know as a ritual if that spell has the ritual tag.\n\n#### Spellcasting Focus\n\nYou can use a musical instrument (found in chapter 5) as a spellcasting focus for your bard spells.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Spellcasting (Druid)": {
        "description": "Drawing on the divine essence of nature itself, you can cast spells to shape that essence to your will. See chapter 10 for the general rules of spellcasting and chapter 11 for the druid spell list.\n\n#### Cantrips\n\nAt 1st level, you know two cantrips of your choice from the druid spell list. You learn additional druid cantrips of your choice at higher levels, as shown in the Cantrips Known column of the Druid table.\n\n#### Preparing and Casting Spells\n\nThe Druid table shows how many spell slots you have to cast your druid spells of 1st level and higher. To cast one of these druid spells, you must expend a slot of the spell's level or higher. You regain all expended spell slots when you finish a long rest.\n\nYou prepare the list of druid spells that are available for you to cast, choosing from the druid spell list. When you do so, choose a number of druid spells equal to your Wisdom modifier + your druid level (minimum of one spell). The spells must be of a level for which you have spell slots.\n\nFor example, if you are a 3rd-level druid, you have four 1st-level and two 2nd-level spell slots. With a Wisdom of 16, your list of prepared spells can include six spells of 1st or 2nd level, in any combination. If you prepare the 1st-level spell cure wounds, you can cast it using a 1st-level or 2nd-level slot. Casting the spell doesn't remove it from your list of prepared spells.\n\nYou can also change your list of prepared spells when you finish a long rest. Preparing a new list of druid spells requires time spent in prayer and meditation: at least 1 minute per spell level for each spell on your list.\n\n#### Spellcasting Ability\n\nWisdom is your spellcasting ability for your druid spells, since your magic draws upon your devotion and attunement to nature. You use your Wisdom whenever a spell refers to your spellcasting ability. In addition, you use your Wisdom modifier when setting the saving throw DC for a druid spell you cast and when making an attack roll with one.\n\n**Spell save DC** = 8 + your proficiency bonus + your Wisdom modifier  \n**Spell attack modifier** = your proficiency bonus + your Wisdom modifier\n\n#### Ritual Casting\n\nYou can cast a druid spell as a ritual if that spell has the ritual tag and you have the spell prepared.\n\n#### Spellcasting Focus\n\nYou can use a druidic focus (found in chapter 5) as a spellcasting focus for your druid spells",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Druidic": {
        "description": "You know Druidic, the secret language of druids. You can speak the language and use it to leave hidden messages. You and others who know this language automatically spot such a message. Others spot the message's presence with a successful DC 15 Wisdom (Perception) check but can't decipher it without magic.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Unarmored Defense (Barbarian)": {
        "description": "While you are not wearing any armor, your Armor Class equals 10 + your Dexterity modifier + your Constitution modifier. You can use a shield and still gain this benefit.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Unarmored Defense (Monk)": {
        "description": "Beginning at 1st level, while you are wearing no armor and not wielding a shield, your AC equals 10 + your Dexterity modifier + your Wisdom modifier.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Martial Arts": {
        "description": "Your practice of martial arts gives you mastery of combat styles that use unarmed strikes and monk weapons, which are shortswords and any simple melee weapons that don't have the two-handed or heavy property.\n\nYou gain the following benefits while you are unarmed or wielding only monk weapons and you aren't wearing armor or wielding a shield.\n\n- You can use Dexterity instead of Strength for the attack and damage rolls of your unarmed strikes and monk weapons.\n- You can roll a [d4](roll \"1d4+str|dex\") in place of the normal damage of your unarmed strike or monk weapon. This die changes as you gain monk levels, as shown in the Martial Arts column of the Monk table.\n- When you use the Attack action with an unarmed strike or a monk weapon on your turn, you can make one unarmed strike as a bonus action. For example, if you take the Attack action and attack with a quarterstaff, you can also make an unarmed strike as a bonus action, assuming you haven't already taken a bonus action this turn.\n\nCertain monasteries use specialized forms of the monk weapons. For example, you might use a club that is two lengths of wood connected by a short chain (called a nunchaku) or a sickle with a shorter, straighter blade (called a kama).",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Favored Enemy": {
        "description": "Beginning at 1st level, you have significant experience studying, tracking, hunting, and even talking to a certain type of enemy.\n\nChoose a type of favored enemy: aberrations, beasts, celestials, constructs, dragons, elementals, fey, fiends, giants, monstrosities, oozes, plants, or undead. Alternatively, you can select two races of humanoid (such as gnolls and orcs) as favored enemies.\n\nYou have advantage on Wisdom (Survival) checks to track your favored enemies, as well as on Intelligence checks to recall information about them.\n\nWhen you gain this feature, you also learn one language of your choice that is spoken by your favored enemies, if they speak one at all.\n\nYou choose one additional favored enemy, as well as an associated language, at 6th and 14th level. As you gain levels, your choices should reflect the types of monsters you have encountered on your adventures.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Natural Explorer": {
        "description": "You are particularly familiar with one type of natural environment and are adept at traveling and surviving in such regions. Choose one type of favored terrain: arctic, coast, desert, forest, grassland, mountain, swamp, or the Underdark. When you make an Intelligence or Wisdom check related to your favored terrain, your proficiency bonus is doubled if you are using a skill that you're proficient in.\n\nWhile traveling for an hour or more in your favored terrain, you gain the following benefits:\n\n- Difficult terrain doesn't slow your group's travel.\nYour group can't become lost except by magical means.\n- Even when you are engaged in another activity while traveling (such as foraging, navigating, or tracking), you remain alert to danger.\n- If you are traveling alone, you can move stealthily at a normal pace.\n- When you forage, you find twice as much food as you normally would.\n- While tracking other creatures, you also learn their exact number, their sizes, and how long ago they passed through the area.\n\nYou choose additional favored terrain types at 6th and 10th level.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Expertise (Rogue)": {
        "description": "At 1st level, choose two of your skill proficiencies, or one of your skill proficiencies and your proficiency with thieves' tools. Your proficiency bonus is doubled for any ability check you make that uses either of the chosen proficiencies.\n\nAt 6th level, you can choose two more of your proficiencies (in skills or with thieves' tools) to gain this benefit.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Sneak Attack": {
        "description": "Beginning at 1st level, you know how to strike subtly and exploit a foe's distraction. Once per turn, you can deal an extra [1d6 damage](roll \"1d6\") to one creature you hit with an attack if you have advantage on the attack roll. The attack must use a finesse or a ranged weapon.\n\nYou don't need advantage on the attack roll if another enemy of the target is within 5 feet of it, that enemy isn't incapacitated, and you don't have disadvantage on the attack roll.\n\nThe amount of the extra damage increases as you gain levels in this class, as shown in the Sneak Attack column of the Rogue table.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Thieves' Cant": {
        "description": "During your rogue training you learned thieves' cant, a secret mix of dialect, jargon, and code that allows you to hide messages in seemingly normal conversation. Only another creature that knows thieves' cant understands such messages. It takes four times longer to convey such a message than it does to speak the same idea plainly.\n\nIn addition, you understand a set of secret signs and symbols used to convey short, simple messages, such as whether an area is dangerous or the territory of a thieves' guild, whether loot is nearby, or whether the people in an area are easy marks or will provide a safe house for thieves on the run.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Spellcasting (Sorcerer)": {
        "description": "An event in your past, or in the life of a parent or ancestor, left an indelible mark on you, infusing you with arcane magic. This font of magic, whatever its origin, fuels your spells. See chapter 10 for the general rules of spellcasting and chapter 11 for the sorcerer spell list.\n\n#### Cantrips\n\nAt 1st level, you know four cantrips of your choice from the sorcerer spell list. You learn an additional sorcerer cantrip of your choice at 4th level and another at 10th level.\n\n#### Spell Slots\n\nThe Sorcerer table shows how many spell slots you have to cast your sorcerer spells of 1st level and higher. To cast one of these sorcerer spells, you must expend a slot of the spell's level or higher. You regain all expended spell slots when you finish a long rest.\n\nFor example, if you know the 1st-level spell burning hands and have a 1st-level and a 2nd-level spell slot available, you can cast burning hands using either slot.\n\n#### Spells Known of 1st Level and Higher\n\nYou know two 1st-level spells of your choice from the sorcerer spell list.\n\nYou learn an additional sorcerer spell of your choice at each level except 12th, 14th, 16th, 18th, 19th, and 20th. Each of these spells must be of a level for which you have spell slots. For instance, when you reach 3rd level in this class, you can learn one new spell of 1st or 2nd level.\n\nAdditionally, when you gain a level in this class, you can choose one of the sorcerer spells you know and replace it with another spell from the sorcerer spell list, which also must be of a level for which you have spell slots.\n\n#### Spellcasting Ability\n\nCharisma is your spellcasting ability for your sorcerer spells, since the power of your magic relies on your ability to project your will into the world. You use your Charisma whenever a spell refers to your spellcasting ability. In addition, you use your Charisma modifier when setting the saving throw DC for a sorcerer spell you cast and when making an attack roll with one.\n\n**Spell save DC** = 8 + your proficiency bonus + your Charisma modifier  \n**Spell attack modifier** = your proficiency bonus + your Charisma modifier\n\n#### Spellcasting Focus\n\nYou can use an arcane focus (found in chapter 5) as a spellcasting focus for your sorcerer spells.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Sorcerous Origin": {
        "description": "Choose a sorcerous origin, which describes the source of your innate magical power, from the list of available origins\n\nYour choice grants you features when you choose it at 1st level and again at 6th, 14th, and 18th level.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Draconic Bloodline": {
        "description": "Your innate magic comes from draconic magic that was mingled with your blood or that of your ancestors. Most often, sorcerers with this origin trace their descent back to a mighty sorcerer of ancient times who made a bargain with a dragon or who might even have claimed a dragon parent. Some of these bloodlines are well established in the world, but most are obscure. Any given sorcerer could be the first of a new bloodline, as a result of a pact or some other exceptional circumstance.\n\n### Dragon Ancestor\n\nAt 1st level, you choose one type of dragon as your ancestor. The damage type associated with each dragon is used by features you gain later.\n\n##### Draconic Ancestry\n\n|Dragon|Damage Type|\n|---|---|\n|Black|Acid|\n|Blue|Lightning|\n|Brass|Fire|\n|Bronze|Lightning|\n|Copper|Acid|\n|Gold|Fire|\n|Green|Poison|\n|Red|Fire|\n|Silver|Cold|\n|White|Cold|\n\nYou can speak, read, and write Draconic. Additionally, whenever you make a Charisma check when interacting with dragons, your Proficiency bonus is doubled if it applies to the check.\n\n### Draconic Resilience\n\nAs magic flows through your body, it causes physical traits of your dragon ancestors to emerge. At 1st level, your hit point maximum increases by 1 and increases by 1 again whenever you gain a level in this class.\n\nAdditionally, parts of your skin are covered by a thin sheen of dragon-like scales. When you aren't wearing armor, your AC equals 13 + your Dexterity modifier.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Pact Magic": {
        "description": "Your arcane research and the magic bestowed on you by your patron have given you facility with spells. See chapter 10 for the general rules of spellcasting and chapter 11 for the warlock spell list.\n\n### Cantrips\n\nYou know two cantrips of your choice from the warlock spell list. You learn additional warlock cantrips of your choice at higher levels, as shown in the Cantrips Known column of the Warlock table.\n\n### Spell Slots\n\nThe Warlock table shows how many spell slots you have to cast your warlock spells of 1st through 5th level. The table also shows what the level of those slots is; all of your spell slots are the same level. To cast one of your warlock spells of 1st level or higher, you must expend a spell slot. You regain all expended spell slots when you finish a short or long rest.\n\nFor example, when you are 5th level, you have two 3rd-level spell slots. To cast the 1st-level spell witch bolt, you must spend one of those slots, and you cast it as a 3rd-level spell.\n\n### Spells Known of 1st Level and Higher\n\nAt 1st level, you know two 1st-level spells of your choice from the warlock spell list.\n\nThe Spells Known column of the Warlock table shows when you learn more warlock spells of your choice of 1st level and higher. A spell you choose must be of a level no higher than what's shown in the table's Slot Level column for your level. When you reach 6th level, for example, you learn a new warlock spell, which can be 1st, 2nd, or 3rd level.\n\nAdditionally, when you gain a level in this class, you can choose one of the warlock spells you know and replace it with another spell from the warlock spell list, which also must be of a level for which you have spell slots.\n\n### Spellcasting Ability\n\nCharisma is your spellcasting ability for your warlock spells, so you use your Charisma whenever a spell refers to your spellcasting ability. In addition, you use your Charisma modifier when setting the saving throw DC for a warlock spell you cast and when making an attack roll with one.\n\n**Spell save DC** = 8 + your proficiency bonus + your Charisma modifier  \n**Spell attack modifier** = your proficiency bonus + your Charisma modifier\n\n### Spellcasting Focus\n\nYou can use an arcane focus (found in chapter 5) as a spellcasting focus for your warlock spells.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Otherworldly Patron": {
        "description": "At 1st level, you have struck a bargain with an otherworldly being chosen from the list of available patrons. Your choice grants you features at 1st level and again at 6th, 10th, and 14th level.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "The Fiend": {
        "description": "You have made a pact with a fiend from the lower planes of existence, a being whose aims are evil, even if you strive against those aims. Such beings desire the corruption or destruction of all things, ultimately including you. Fiends powerful enough to forge a pact include demon lords such as Demogorgon, Orcus, Fraz'Urb-luu, and Baphomet; archdevils such as Asmodeus, Dispater, Mephistopheles, and Belial; pit fiends and balors that are especially mighty; and ultroloths and other lords of the yugoloths.\n\n### Expanded Spell List\n\nThe Fiend lets you choose from an expanded list of spells when you learn a warlock spell. The following spells are added to the warlock spell list for you.\n\n##### Fiend Expanded Spells\n\n|Spell Level|Spells|\n|---|---|\n|1st|[burning hands](level 1 \"Burning Hands\"), [command](level 1 \"Command\")|\n|2nd|[blindness/deafness](level 2 \"Blindness/Deafness\"), [scorching ray](level 2 \"Scorching Ray\")|\n|3rd|[fireball](level 3 \"Fireball\"), [stinking cloud](level 3 \"Stinking Cloud\")|\n|4th|[fire shield](level 4 \"Fire Shield\"), [wall of fire](level 4 \"Wall of Fire\")|\n|5th|[flame strike](level 5 \"Flame Strike\"), [hallow](level 5 \"Hallow\")|\n\n### Dark One's Blessing\n\nStarting at 1st level, when you reduce a hostile creature to 0 hit points, you gain temporary hit points equal to your [Charisma modifier + your warlock level](roll \"cha+warlock\") (minimum of 1).",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Arcane Recovery": {
        "description": "You have learned to regain some of your magical energy by studying your spellbook. Once per day when you finish a short rest, you can choose expended spell slots to recover. The spell slots can have a combined level that is equal to or less than half your wizard level (rounded up), and none of the slots can be 6th level or higher.\n\nFor example, if you're a 4th-level wizard, you can recover up to two levels worth of spell slots.\n\nYou can recover either a 2nd-level spell slot or two 1st-level spell slots.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Spellcasting (Wizard)": {
        "description": "As a student of arcane magic, you have a spellbook containing spells that show the first glimmerings of your true power. See chapter 10 for the general rules of spellcasting and chapter 11 for the wizard spell list.\n\n#### Cantrips\n\nAt 1st level, you know three cantrips of your choice from the wizard spell list. You learn additional wizard cantrips of your choice at higher levels, as shown in the Cantrips Known column of the Wizard table.\n\n#### Spellbook\n\nAt 1st level, you have a spellbook containing six 1st-level wizard spells of your choice. Your spellbook is the repository of the wizard spells you know, except your cantrips, which are fixed in your mind.\n\n#### Preparing and Casting Spells\n\nThe Wizard table shows how many spell slots you have to cast your spells of 1st level and higher. To cast one of these spells, you must expend a slot of the spell's level or higher. You regain all expended spell slots when you finish a long rest.\n\nYou prepare the list of wizard spells that are available for you to cast. To do so, choose a number of wizard spells from your spellbook equal to your Intelligence modifier + your wizard level (minimum of one spell). The spells must be of a level for which you have spell slots.\n\nFor example, if you're a 3rd-level wizard, you have four 1st-level and two 2nd-level spell slots. With an Intelligence of 16, your list of prepared spells can include six spells of 1st or 2nd level, in any combination, chosen from your spellbook. If you prepare the 1st-level spell magic missile, you can cast it using a 1st-level or a 2nd-level slot. Casting the spell doesn't remove it from your list of prepared spells.\n\nYou can change your list of prepared spells when you finish a long rest. Preparing a new list of wizard spells requires time spent studying your spellbook and memorizing the incantations and gestures you must make to cast the spell: at least 1 minute per spell level for each spell on your list.\n\n#### Spellcasting Ability\n\nIntelligence is your spellcasting ability for your wizard spells, since you learn your wizard spells through dedicated study and memorization. You use your Intelligence whenever a spell refers to your spellcasting ability. In addition, you use your Intelligence modifier when setting the saving throw DC for a wizard spell you cast and when making an attack roll with one.\n\n**Spell save DC** = 8 + your proficiency bonus + your Intelligence modifier  \n**Spell attack modifier** = your proficiency bonus + your Intelligence modifier\n\n#### Ritual Casting\n\nYou can cast a wizard spell as a ritual if that spell has the ritual tag and you have the spell in your spellbook. You don't need to have the spell prepared.\n\n#### Spellcasting Focus\n\nYou can use an arcane focus (found in chapter 5) as a spellcasting focus for your wizard spells.\n\n#### Learning Spells of 1st Level and Higher\n\nEach time you gain a wizard level, you can add two wizard spells of your choice to your spellbook. Each of these spells must be of a level for which you have spell slots, as shown on the Wizard table. On your adventures, you might find other spells that you can add to your spellbook (see \"Your Spellbook\").\n\n```\n##### Your Spellbook\n\nThe spells that you add to your spellbook as you gain levels reflect the arcane research you conduct on your own, as well as intellectual breakthroughs you have had about the nature of the multiverse. You might find other spells during your adventures. You could discover a spell recorded on a scroll in an evil wizard's chest, for example, or in a dusty tome in an ancient library.\n\nA spellbook doesn't contain cantrips.\n\n***Copying a Spell into the Book.*** When you find a wizard spell of 1st level or higher, you can add it to your spellbook if it is of a spell level you can prepare and if you can spare the time to decipher and copy it.\nCopying a spell into your spellbook involves reproducing the basic form of the spell, then deciphering the unique system of notation used by the wizard who wrote it. You must practice the spell until you understand the sounds or gestures required, then transcribe it into your spellbook using your own notation.\n\nFor each level of the spell, the process takes 2 hours and costs 50 gp. The cost represents material components you expend as you experiment with the spell to master it, as well as the fine inks you need to record it. Once you have spent this time and money, you can prepare the spell just like your other spells.\n\nA wizard spell on a spell scroll can be copied just as spells in spellbooks can be copied. When you copy a spell from a spell scroll, you must succeed on an Intelligence (Arcana) check with a DC equal to 10 + the spell's level. If the check succeeds, the spell is successfully copied. Whether the check succeeds or fails, the spell scroll is destroyed.\n\n***Replacing the Book.*** You can copy a spell from your own spellbook into another book—for example, if you want to make a backup copy of your spellbook. This is just like copying a new spell into your spellbook, but faster and easier, since you understand your own notation and already know how to cast the spell. You need spend only 1 hour and 10 gp for each level of the copied spell.\nIf you lose your spellbook, you can use the same procedure to transcribe the spells that you have prepared into a new spellbook. Filling out the remainder of your spellbook requires you to find new spells to do so, as normal. For this reason, many wizards keep backup spellbooks in a safe place.\n\n***The Book's Appearance.*** Your spellbook is a unique compilation of spells, with its own decorative flourishes and margin notes. It might be a plain, functional leather volume that you received as a gift from your master, a finely bound gilt-edged tome you found in an ancient library, or even a loose collection of notes scrounged together after you lost your previous spellbook in a mishap.\n```",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Danger Sense": {
        "description": "At 2nd level, you gain an uncanny sense of when things nearby aren't as they should be, giving you an edge when you dodge away from danger. You have advantage on Dexterity saving throws against effects that you can see, such as traps and spells. To gain this benefit, you can't be blinded, deafened, or incapacitated.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Reckless Attack": {
        "description": "Starting at 2nd level, you can throw aside all concern for defense to attack with fierce desperation. When you make your first attack on your turn, you can decide to attack recklessly. Doing so gives you advantage on melee weapon attack rolls using Strength during this turn, but attack rolls against you have advantage until your next turn.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Primal Path": {
        "description": "At 3rd level, you choose a path that shapes the nature of your rage from the list of available paths. Your choice grants you features at 3rd level and again at 6th, 10th, and 14th levels.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Path of the Berserker": {
        "description": "For some barbarians, rage is a means to an end—that end being violence. The Path of the Berserker is a path of untrammeled fury, slick with blood. As you enter the berserker's rage, you thrill in the chaos of battle, heedless of your own health or well-being.\n\n### Frenzy\n\nStarting when you choose this path at 3rd level, you can go into a frenzy when you rage. If you do so, for the duration of your rage you can make a single melee weapon attack as a bonus action on each of your turns after this one. When your rage ends, you suffer one level of exhaustion.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Extra Attack": {
        "description": "Beginning at 5th level, you can attack twice, instead of once, whenever you take the Attack action on your turn.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Fast Movement": {
        "description": "Starting at 5th level, your speed increases by 10 feet while you aren't wearing heavy armor.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Feral Instinct": {
        "description": "By 7th level, your instincts are so honed that you have advantage on initiative rolls.\n\nAdditionally, if you are surprised at the beginning of combat and aren't incapacitated, you can act normally on your first turn, but only if you enter your rage before doing anything else on that turn.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Brutal Critical": {
        "description": "Beginning at 9th level, you can roll one additional weapon damage die when determining the extra damage for a critical hit with a melee attack.\n\nThis increases to two additional dice at 13th level and three additional dice at 17th level.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Relentless Rage": {
        "description": "Starting at 11th level, your rage can keep you fighting despite grievous wounds. If you drop to 0 hit points while you're raging and don't die outright, you can make a DC 10 Constitution saving throw. If you succeed, you drop to 1 hit point instead.\n\nEach time you use this feature after the first, the DC increases by 5. When you finish a short or long rest, the DC resets to 10.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Persistent Rage": {
        "description": "Beginning at 15th level, your rage is so fierce that it ends early only if you fall unconscious or if you choose to end it.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Indomitable Might": {
        "description": "Beginning at 18th level, if your total for a Strength check is less than your Strength score, you can use that score in place of the total.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Mindless Rage": {
        "description": "Beginning at 6th level, you can't be charmed or frightened while raging. If you are charmed or frightened when you enter your rage, the effect is suspended for the duration of the rage.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Intimidating Presence": {
        "description": "Beginning at 10th level, you can use your action to frighten someone with your menacing presence. When you do so, choose one creature that you can see within 30 feet of you. If the creature can see or hear you, it must succeed on a Wisdom saving throw (DC equal to 8 + your proficiency bonus + your Charisma modifier) or be frightened of you until the end of your next turn. On subsequent turns, you can use your action to extend the duration of this effect on the frightened creature until the end of your next turn. This effect ends if the creature ends its turn out of line of sight or more than 60 feet away from you.\n\nIf the creature succeeds on its saving throw, you can't use this feature on that creature again for 24 hours.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Retaliation": {
        "description": "Starting at 14th level, when you take damage from a creature that is within 5 feet of you. you can use your reaction to make a melee weapon attack against that creature.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Jack of All Trades": {
        "description": "Starting at 2nd level, you can add half your proficiency bonus, rounded down, to any ability check you make that doesn't already include your proficiency bonus.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Song of Rest": {
        "description": "Beginning at 2nd level, you can use soothing music or oration to help revitalize your wounded allies during a short rest. If you or any friendly creatures who can hear your performance regain hit points at the end of the short rest by spending one or more Hit Dice, each of those creatures regains an extra [1d6](roll \"1d6\") hit points.\n\nThe extra hit points increase when you reach certain levels in this class: to [1d8](roll \"1d8\") at 9th level, to [1d10](roll \"1d10\") at 13th level, and to [1d12](roll \"1d12\") at 17th level.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Bard College": {
        "description": "At 3rd level, you delve into the advanced techniques of a bard college of your choice from the list of available colleges. Your choice grants you features at 3rd level and again at 6th and 14th level.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Expertise (Bard)": {
        "description": "At 3rd level, choose two of your skill proficiencies. Your proficiency bonus is doubled for any ability check you make that uses either of the chosen proficiencies.\n\nAt 10th level, you can choose another two skill proficiencies to gain this benefit.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Font of Inspiration": {
        "description": "Beginning when you reach 5th level, you regain all of your expended uses of Bardic Inspiration when you finish a short or long rest.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Countercharm": {
        "description": "At 6th level, you gain the ability to use musical notes or words of power to disrupt mind-influencing effects. As an action, you can start a performance that lasts until the end of your next turn. During that time, you and any friendly creatures within 30 feet of you have advantage on saving throws against being frightened or charmed. A creature must be able to hear you to gain this benefit. The performance ends early if you are incapacitated or silenced or if you voluntarily end it (no action required).",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Magical Secrets": {
        "description": "By 10th level, you have plundered magical knowledge from a wide spectrum of disciplines. Choose two spells from any classes, including this one. A spell you choose must be of a level you can cast, as shown on the Bard table, or a cantrip.\n\nThe chosen spells count as bard spells for you and are included in the number in the Spells Known column of the Bard table.\n\nYou learn two additional spells from any classes at 14th level and again at 18th level.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Superior Inspiration": {
        "description": "At 20th level, when you roll initiative and have no uses of Bardic Inspiration left, you regain one use.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "College of Lore": {
        "description": "Bards of the College of Lore know something about most things, collecting bits of knowledge from sources as diverse as scholarly tomes and peasant tales. Whether singing folk ballads in taverns or elaborate compositions in royal courts, these bards use their gifts to hold audiences spellbound. When the applause dies down, the audience members might find themselves questioning everything they held to be true, from their faith in the priesthood of the local temple to their loyalty to the king.\n\nThe loyalty of these bards lies in the pursuit of beauty and truth, not in fealty to a monarch or following the tenets of a deity. A noble who keeps such a bard as a herald or advisor knows that the bard would rather be honest than politic.\n\nThe college's members gather in libraries and sometimes in actual colleges, complete with classrooms and dormitories, to share their lore with one another. They also meet at festivals or affairs of state, where they can expose corruption, unravel lies, and poke fun at self-important figures of authority.\n\n### Bonus Proficiencies\n\nWhen you join the College of Lore at 3rd level, you gain proficiency with three skills of your choice.\n\n### Cutting Words\n\nAlso at 3rd level, you learn how to use your wit to distract, confuse, and otherwise sap the confidence and competence of others. When a creature that you can see within 60 feet of you makes an attack roll, an ability check, or a damage roll, you can use your reaction to expend one of your uses of Bardic Inspiration, rolling a Bardic Inspiration die and subtracting the number rolled from the creature's roll. You can choose to use this feature after the creature makes its roll, but before the DM determines whether the attack roll or ability check succeeds or fails, or before the creature deals its damage. The creature is immune if it can't hear you or if it's immune to being charmed.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Additional Magical Secrets": {
        "description": "At 6th level, you learn two spells of your choice from any class. A spell you choose must be of a level you can cast, as shown on the Bard table, or a cantrip. The chosen spells count as bard spells for you but don't count against the number of bard spells you know.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Peerless Skill": {
        "description": "Starting at 14th level, when you make an ability check, you can expend one use of Bardic Inspiration. Roll a Bardic Inspiration die and add the number rolled to your ability check. You can choose to do so after you roll the die for the ability check, but before the DM tells you whether you succeed or fail.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Fighting Style": {
        "description": "You adopt a particular style of fighting as your specialty. Choose one of the following options. You can't take the same Fighting Style option more than once, even if you get to choose again.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Channel Divinity": {
        "description": "At 2nd level, you gain the ability to channel divine energy directly from your deity, using that energy to fuel magical effects. You start with two such effects: Turn Undead and an effect determined by your domain. Some domains grant you additional effects as you advance in levels, as noted in the domain description.\n\nWhen you use your Channel Divinity, you choose which effect to create. You must then finish a short or long rest to use your Channel Divinity again.\n\nSome Channel Divinity effects require saving throws. When you use such an effect from this class, the DC equals your cleric spell save DC.\n\nBeginning at 6th level, you can use your Channel Divinity twice between rests, and beginning at 18th level, you can use it three times between rests. When you finish a short or long rest, you regain your expended uses.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Divine Sense": {
        "description": "The presence of strong evil registers on your senses like a noxious odor, and powerful good rings like heavenly music in your ears. As an action, you can open your awareness to detect such forces. Until the end of your next turn, you know the location of any celestial, fiend, or undead within 60 feet of you that is not behind total cover. You know the type (celestial, fiend, or undead) of any being whose presence you sense, but not its identity (the vampire Count Strahd von Zarovich, for instance). Within the same radius, you also detect the presence of any place or object that has been consecrated or desecrated, as with the hallow spell.\n\nYou can use this feature a number of times equal to 1 + your Charisma modifier. When you finish a long rest, you regain all expended uses.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Lay on Hands": {
        "description": "Your blessed touch can heal wounds. You have a pool of healing power that replenishes when you take a long rest. With that pool, you can restore a total number of hit points equal to your paladin level × 5.\n\nAs an action, you can touch a creature and draw power from the pool to restore a number of hit points to that creature, up to the maximum amount remaining in your pool.\n\nAlternatively, you can expend 5 hit points from your pool of healing to cure the target of one disease or neutralize one poison affecting it. You can cure multiple diseases and neutralize multiple poisons with a single use of Lay on Hands, expending hit points separately for each one.\n\nThis feature has no effect on undead and constructs.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Destroy Undead": {
        "description": "Starting at 5th level, when an undead fails its saving throw against your Turn Undead feature, the creature is instantly destroyed if its challenge rating is at or below a certain threshold, as shown in the Destroy Undead table.\n\n##### Destroy Undead\n\n|Cleric Level|Destroys Undead of CR...|\n|---|---|\n| 5th|1/2 or lower|\n|8th|1 or lower|\n|11th|2 or lower|\n|14th|3 or lower|\n|17th|4 or lower|",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Divine Intervention": {
        "description": "Beginning at 10th level, you can call on your deity to intervene on your behalf when your need is great.\n\nImploring your deity's aid requires you to use your action. Describe the assistance you seek, and roll percentile dice. If you roll a number equal to or lower than your cleric level, your deity intervenes. The DM chooses the nature of the intervention; the effect of any cleric spell or cleric domain spell would be appropriate.\n\nIf your deity intervenes, you can't use this feature again for 7 days. Otherwise, you can use it again after you finish a long rest.\n\nAt 20th level, your call for intervention succeeds automatically, no roll required.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Blessed Healer": {
        "description": "Beginning at 6th level, the healing spells you cast on others heal you as well. When you cast a spell of 1st level or higher that restores hit points to a creature other than you, you regain hit points equal to 2 + the spell's level.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Divine Strike": {
        "description": "At 8th level, you gain the ability to infuse your weapon strikes with divine energy. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra [1d8 radiant damage](roll \"1d8\") to the target. When you reach 14th level, the extra damage increases to [2d8](roll \"2d8\").",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Supreme Healing": {
        "description": "Starting at 17th level, when you would normally roll one or more dice to restore hit points with a spell, you instead use the highest number possible for each die. For example, instead of restoring 2d6 hit points to a creature, you restore 12.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Wild Shape": {
        "description": "Starting at 2nd level, you can use your action to magically assume the shape of a beast that you have seen before. You can use this feature twice. You regain expended uses when you finish a short or long rest.\n\nYour druid level determines the beasts you can transform into, as shown in the Beast Shapes table. At 2nd level, for example, you can transform into any beast that has a challenge rating of 1/4 or lower that doesn't have a flying or swimming speed.\n\n##### Beast Shapes\n\n|Level|Max. CR|Limitations|Example|\n|---|---|---|---|\n|2nd|1/4|No flying or swimming speed|Wolf|\n|4th|1/2|No flying speed|Crocodile|\n|8th|1|—|Giant eagle|\n\nYou can stay in a beast shape for a number of hours equal to half your druid level (rounded down). You then revert to your normal form unless you expend another use of this feature. You can revert to your normal form earlier by using a bonus action on your turn. You automatically revert if you fall unconscious, drop to 0 hit points, or die.\n\nWhile you are transformed, the following rules apply:\n\n- Your game statistics are replaced by the statistics of the beast, but you retain your alignment, personality, and Intelligence, Wisdom, and Charisma scores. You also retain all of your skill and saving throw proficiencies, in addition to gaining those of the creature. If the creature has the same proficiency as you and the bonus in its stat block is higher than yours, use the creature's bonus instead of yours. If the creature has any legendary or lair actions, you can't use them.\n- When you transform, you assume the beast's hit points and Hit Dice. When you revert to your normal form, you return to the number of hit points you had before you transformed. However, if you revert as a result of dropping to 0 hit points, any excess damage carries over to your normal form. For example, if you take 10 damage in animal form and have only 1 hit point left, you revert and take 9 damage. As long as the excess damage doesn't reduce your normal form to 0 hit points, you aren't knocked unconscious.\n- You can't cast spells, and your ability to speak or take any action that requires hands is limited to the capabilities of your beast form. Transforming doesn't break your concentration on a spell you've already cast, however, or prevent you from taking actions that are part of a spell, such as call lightning, that you've already cast.\n- You retain the benefit of any features from your class, race, or other source and can use them if the new form is physically capable of doing so. However, you can't use any of your special senses, such as darkvision, unless your new form also has that sense.\nYou choose whether your equipment falls to the ground in your space, merges into your new form, or is worn by it. Worn equipment functions as normal, but the DM decides whether it is practical for the new form to wear a piece of equipment, based on the creature's shape and size. Your equipment doesn't change size or shape to match the new form, and any equipment that the new form can't wear must either fall to the ground or merge with it. Equipment that merges with the form has no effect until you leave the form.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Druid Circle": {
        "description": "At 2nd level, you choose to identify with a circle of druids from the list of available circles. Your choice grants you features at 2nd level and again at 6th, 10th, and 14th level.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Timeless Body": {
        "description": "At 15th level, your ki sustains you so that you suffer none of the frailty of old age, and you can't be aged magically. You can still die of old age, however. In addition, you no longer need food or water.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Beast Spells": {
        "description": "Beginning at 18th level, you can cast many of your druid spells in any shape you assume using Wild Shape. You can perform the somatic and verbal components of a druid spell while in a beast shape, but you aren't able to provide material components.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Archdruid": {
        "description": "At 20th level, you can use your Wild Shape an unlimited number of times.\n\nAdditionally, you can ignore the verbal and somatic components of your druid spells, as well as any material components that lack a cost and aren't consumed by a spell. You gain this benefit in both your normal shape and your beast shape from Wild Shape.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Circle of the Land": {
        "description": "The Circle of the Land is made up of mystics and sages who safeguard ancient knowledge and rites through a vast oral tradition. These druids meet within sacred circles of trees or standing stones to whisper primal secrets in Druidic. The circle's wisest members preside as the chief priests of communities that hold to the Old Faith and serve as advisors to the rulers of those folk. As a member of this circle, your magic is influenced by the land where you were initiated into the circle's mysterious rites.\n\n### Bonus Cantrip\n\nYou learn one additional druid cantrip of your choice.\n\n### Natural Recovery\n\nStarting at 2nd level, you can regain some of your magical energy by sitting in meditation and communing with nature. During a short rest, you choose expended spell slots to recover. The spell slots can have a combined level that is equal to or less than half your druid level (rounded up), and none of the slots can be 6th level or higher. You can't use this feature again until you finish a long rest\n\nFor example, when you are a 4th-level druid, you can recover up to two levels worth of spell slots. You can recover either a 2nd-level slot or two 1st-level slots.\n\n### Circle Spells\n\nYour mystical connection to the land infuses you with the ability to cast certain spells. At 3rd, 5th, 7th, and 9th level you gain access to circle spells connected to the land where you became a druid. Choose that land - arctic, coast, desert, forest, grassland, mountain, swamp, or Underdark - and consult the associated list of spells.\n\nOnce you gain access to a circle spell, you always have it prepared, and it doesn't count against the number of spells you can prepare each day. If you gain access to a spell that doesn't appear on the druid spell list, the spell is nonetheless a druid spell for you.\n\n##### Arctic\n\n|Druid Level|Circle Spells|\n|---|---:|\n|3rd|hold person, spike growth|\n|5th|sleet storm, slow|\n|7th|freedom of movement, ice storm|\n|9th|commune with nature, cone of cold|\n\n##### Coast\n\n|Druid Level|Circle Spells|\n|---|---:|\n|3rd|mirror image, misty step|\n|5th|water breathing, water walk|\n|7th|control water, freedom of movement|\n|9th|conjure elemental, scrying|\n\n##### Desert\n\n|Druid Level|Circle Spells|\n|---|---:|\n|3rd|blur, silence|\n|5th|create food and water, protection from energy|\n|7th|blight, hallucinatory terrain|\n|9th|insect plague, wall of stone|\n\n##### Forest\n\n|Druid Level|Circle Spells|\n|---|---:|\n|3rd|barkskin, spider climb|\n|5th|call lightning, plant growth|\n|7th|divination, freedom of movement|\n|9th|commune with nature, tree stride|\n\n##### Grassland\n\n|Druid Level|Circle Spells|\n|---|---:|\n|3rd|invisibility, pass without trace|\n|5th|daylight, haste|\n|7th|divination, freedom of movement|\n|9th|dream, insect plague|\n\n##### Mountain\n\n|Druid Level|Circle Spells|\n|---|---:|\n|3rd|spider climb, spike growth|\n|5th|lightning bolt, meld into stone|\n|7th|stone shape, stoneskin|\n|9th|passwall, wall of stone|\n\n##### Swamp\n\n|Druid Level|Circle Spells|\n|---|---:|\n|3rd|darkness, Melf's acid arrow|\n|5th|water walk, stinking cloud|\n|7th|freedom of movement, locate creature|\n|9th|insect plague, scrying|\n\n##### Underdark\n\n|Druid Level|Circle Spells|\n|---|---:|\n|3rd|spider climb, web|\n|5th|gaseous form, stinking cloud|\n|7th|greater invisibility, stone shape|\n|9th|cloudkill, insect plague|",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Land's Stride": {
        "description": "Starting at 8th level, moving through nonmagical difficult terrain costs you no extra movement. You can also pass through nonmagical plants without being slowed by them and without taking damage from them if they have thorns, spines, or a similar hazard.\n\nIn addition, you have advantage on saving throws against plants that are magically created or manipulated to impede movement, such those created by the entangle spell.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Nature's Ward": {
        "description": "When you reach 10th level, you can't be charmed or frightened by elementals or fey, and you are immune to poison and disease.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Nature's Sanctuary": {
        "description": "When you reach 14th level, creatures of the natural world sense your connection to nature and become hesitant to attack you. When a beast or plant creature attacks you, that creature must make a Wisdom saving throw against your druid spell save DC. On a failed save, the creature must choose a different target, or the attack automatically misses. On a successful save, the creature is immune to this effect for 24 hours.\n\nThe creature is aware of this effect before it makes its attack against you.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Martial Archetype": {
        "description": "At 3rd level, you choose an archetype that you strive to emulate in your combat styles and techniques, such as Champion. The archetype you choose grants you features at 3rd level and again at 7th, 10th, 15th, and 18th level.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Extra Attack (Fighter)": {
        "description": "Beginning at 5th level, you can attack twice, instead of once, whenever you take the Attack action on your turn.\n\nThe number of attacks increases to three when you reach 11th level in this class and to four when you reach 20th level in this class.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Indomitable": {
        "description": "Beginning at 9th level, you can reroll a saving throw that you fail. If you do so, you must use the new roll, and you can't use this feature again until you finish a long rest.\n\nYou can use this feature twice between long rests starting at 13th level and three times between long rests starting at 17th level.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Champion": {
        "description": "The archetypal Champion focuses on the development of raw physical power honed to deadly perfection. Those who model themselves on this archetype combine rigorous training with physical excellence to deal devastating blows.\n\n### Improved Critical\n\nBeginning when you choose this archetype at 3rd level, your weapon attacks score a critical hit on a roll of 19 or 20.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Additional Fighting Style": {
        "description": "At 10th level, you can choose a second option from the Fighting Style class feature.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Superior Critical": {
        "description": "Starting at 15th level, your weapon attacks score a critical hit on a roll of 18-20.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Survivor": {
        "description": "At 18th level, you attain the pinnacle of resilience in battle. At the start of each of your turns, you regain hit points equal to [5 + your Constitution modifier](roll \"5+con\") if you have no more than half of your hit points left. You don't gain this benefit if you have 0 hit points.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Rage": {
        "description": "In battle, you fight with primal ferocity. On your turn, you can enter a rage as a bonus action.\n\nWhile raging, you gain the following benefits if you aren't wearing heavy armor:\n\n- You have advantage on Strength checks and Strength saving throws.\n- When you make a melee weapon attack using Strength, you gain a +2 bonus to the damage roll. This bonus increases as you level.\n- You have resistance to bludgeoning, piercing, and slashing damage.\n- If you are able to cast spells, you can't cast them or concentrate on them while raging.\n\nYour rage lasts for 1 minute. It ends early if you are knocked unconscious or if your turn ends and you haven't attacked a hostile creature since your last turn or taken damage since then. You can also end your rage on your turn as a bonus action.\n\nOnce you have raged the maximum number of times for your barbarian level, you must finish a long rest before you can rage again. You may rage 2 times at 1st level, 3 at 3rd, 4 at 6th, 5 at 12th, and 6 at 17th.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Barbarian": {
        "description": "#### Hit Points\n\n**Hit Dice:** [1d12](roll \"1d12\")  \n**Hit Points at 1st Level:** [12 + your Constitution modifier](roll \"12+con\")  \n**Hit Points at Higher Levels:** [1d12 (or 7) + your Constitution   modifier](roll \"1d12+con\") per Barbarian level after 1st\n\n#### Proficiencies\n\n**Armor:** light armor, medium armor, shields  \n**Weapons:** simple weapons, martial weapons  \n**Tools:** none  \n**Saving Throws:** Strength, Constitution  \n**Skills:** Choose 2 from Animal Handling, Athletics, Intimidation, Nature, Perception, and Survival.\n\n#### Starting Equipment\n\nYou start with the following items, plus anything provided by your background.\n\n- (a) a greataxe or (b) any martial melee weapon\n- (a) two handaxes or (b) any simple weapon\n- An explorer's pack, and four javelins\n\nAlternatively, you may start with [2d4](roll \"2d4\") × 10 gp to buy your own equipment.\n\n### Multiclassing\n\nTo qualify for a new class, you must meet the ability score prerequisites for both your current class and your new one.\n\n**Ability Score Minimum:** Strength 13\n\nWhen you gain a level in a class other than your first, you gain only some of that class's starting proficiencies.\n\n**Armor:** shields  \n**Weapons:** simple weapons, martial weapons\n\n##### The Barbarian\n\n|Level|Proficiency Bonus|Features|Rages|Rage Damage|\n|---|---|---|---|---|\n|1st|+2|Rage,Unarmored Defense|2|+2|\n|2nd|+2|Danger Sense,Reckless Attack|2|+2|\n|3rd|+2|Primal Path|3|+2|\n|4th|+2|Ability Score Improvement|3|+2|\n|5th|+3|Extra Attack,Fast Movement|3|+2|\n|6th|+3|Path Feature|4|+2|\n|7th|+3|Feral Instinct|4|+2|\n|8th|+3|Ability Score Improvement|4|+2|\n|9th|+4|Brutal Critical (1 die)|4|+3|\n|10th|+4|Path feature|4|+3|\n|11th|+4|Relentless Rage|4|+3|\n|12th|+4|Ability Score Improvement|5|+3|\n|13th|+5|Brutal Critical (2 dice)|5|+3|\n|14th|+5|Path feature|5|+3|\n|15th|+5|Persistent Rage|5|+3|\n|16th|+5|Ability Score Improvement|5|+4|\n|17th|+6|Brutal Critical (3 dice)|6|+4|\n|18th|+6|Indomitable Might|6|+4|\n|19th|+6|Ability Score Improvement|6|+4|\n|20th|+6|Primal Champion|Unlimited|+4|",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Bard": {
        "description": "#### Hit Points\n\n**Hit Dice:** [1d8](roll \"1d8\")  \n**Hit Points at 1st Level:** [8 + your Constitution modifier](roll \"8+con\")  \n**Hit Points at Higher Levels:** [1d8 (or 5) + your Constitution modifier](roll \"1d8+con\") per Bard level after 1st\n\n#### Proficiencies\n\n**Armor:** light armor  \n**Weapons:** simple weapons, hand crossbows, longswords, rapiers, shortswords  \n**Tools:** three musical instruments of your choice  \n**Saving Throws:** Dexterity, Charisma  \n**Skills:** Choose any 3.\n\n#### Starting Equipment\n\nYou start with the following items, plus anything provided by your background.\n\n- (a) a rapier, (b) a longsword, or (c) any simple weapon\n- (a) a diplomat's pack or (b) an entertainer's pack\n- (a) a lute or (b) any other musical instrument\n- Leather armor, and a dagger\n\nAlternatively, you may start with [5d4](roll \"5d4\") × 10 gp to buy your own equipment.\n\n#### Multiclassing\n\nTo qualify for a new class, you must meet the ability score prerequisites for both your current class and your new one.\n\n**Ability Score Minimum:** Charisma 13\n\nWhen you gain a level in a class other than your first, you gain only some of that class's starting proficiencies.\n\n**Armor:** light armor  \n**Tools:** one musical instrument of your choice  \n**Skills:** Choose any skill.\n\n##### The Bard\n\n| Level | Proficiency Bonus | Features                                           |\n|-------|-------------------|----------------------------------------------------|\n| 1st   | +2                | Bardic Inspiration,Spellcasting                    |\n| 2nd   | +2                | Jack of All Trades,Song of Rest (d6)               |\n| 3rd   | +2                | Bard College,Expertise                             |\n| 4th   | +2                | Ability Score Improvement                          |\n| 5th   | +3                | Bardic Inspiration (d8),Font of Inspiration        |\n| 6th   | +3                | Countercharm,Bard College feature                  |\n| 7th   | +3                | —                                                  |\n| 8th   | +3                | Ability Score Improvement                          |\n| 9th   | +4                | Song of Rest (d8)                                  |\n| 10th  | +4                | Bardic Inspiration (d10),Expertise,Magical Secrets |\n| 11th  | +4                | —                                                  |\n| 12th  | +4                | Ability Score Improvement                          |\n| 13th  | +5                | Song of Rest (d10)                                 |\n| 14th  | +5                | Magical Secrets,Bard College feature               |\n| 15th  | +5                | Bardic Inspiration (d12)                           |\n| 16th  | +5                | Ability Score Improvement                          |\n| 17th  | +6                | Song of Rest (d12)                                 |\n| 18th  | +6                | Magical Secrets                                    |\n| 19th  | +6                | Ability Score Improvement                          |\n| 20th  | +6                | Superior Inspiration                               |\n\n##### Spell Slots per Spell Level\n\n|Level|Cantrips Known|Spells Known|1st|2nd|3rd|4th|5th|6th|7th|8th|9th|\n|------|---|----|---|---|---|---|---|---|---|---|---|\n| 1st  | 2 | 4  | 2 | — | — | — | — | — | — | — | — |\n| 2nd  | 2 | 5  | 3 | — | — | — | — | — | — | — | — |\n| 3rd  | 2 | 6  | 4 | 2 | — | — | — | — | — | — | — |\n| 4th  | 3 | 7  | 4 | 3 | — | — | — | — | — | — | — |\n| 5th  | 3 | 8  | 4 | 3 | 2 | — | — | — | — | — | — |\n| 6th  | 3 | 9  | 4 | 3 | 3 | — | — | — | — | — | — |\n| 7th  | 3 | 10 | 4 | 3 | 3 | 1 | — | — | — | — | — |\n| 8th  | 3 | 11 | 4 | 3 | 3 | 2 | — | — | — | — | — |\n| 9th  | 3 | 12 | 4 | 3 | 3 | 3 | 1 | — | — | — | — |\n| 10th | 4 | 14 | 4 | 3 | 3 | 3 | 2 | — | — | — | — |\n| 11th | 4 | 15 | 4 | 3 | 3 | 3 | 2 | 1 | — | — | — |\n| 12th | 4 | 15 | 4 | 3 | 3 | 3 | 2 | 1 | — | — | — |\n| 13th | 4 | 16 | 4 | 3 | 3 | 3 | 2 | 1 | 1 | — | — |\n| 14th | 4 | 18 | 4 | 3 | 3 | 3 | 2 | 1 | 1 | — | — |\n| 15th | 4 | 19 | 4 | 3 | 3 | 3 | 2 | 1 | 1 | 1 | — |\n| 16th | 4 | 19 | 4 | 3 | 3 | 3 | 2 | 1 | 1 | 1 | — |\n| 17th | 4 | 20 | 4 | 3 | 3 | 3 | 2 | 1 | 1 | 1 | 1 |\n| 18th | 4 | 22 | 4 | 3 | 3 | 3 | 3 | 1 | 1 | 1 | 1 |\n| 19th | 4 | 22 | 4 | 3 | 3 | 3 | 3 | 2 | 1 | 1 | 1 |\n| 20th | 4 | 22 | 4 | 3 | 3 | 3 | 3 | 2 | 2 | 1 | 1 |",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Cleric": {
        "description": "#### Hit Points\n\n**Hit Dice:** [1d8](roll \"1d8\")  \n**Hit Points at 1st Level:** [8 + your Constitution modifier](roll \"8+con\")  \n**Hit Points at Higher Levels:** [1d8 (or 5) + your Constitution modifier](roll \"1d8+con\") per Cleric level after 1st\n\n#### Proficiencies\n\n**Armor:** light armor, medium armor, shields  \n**Weapons:** simple weapons  \n**Tools:** none  \n**Saving Throws:** Wisdom, Charisma  \n**Skills:** Choose 2 from History, Insight, Medicine, Persuasion, and Religion.\n\n#### Starting Equipment\n\nYou start with the following items, plus anything provided by your background.\n\n- (a) a mace or (b) a warhammer (if proficient)\n- (a) scale mail, (b) leather armor, or (c) chain mail (if proficient)\n- (a) a light crossbow and 20 bolts or (b) any simple weapon\n- (a) a priest's pack or (b) an explorer's pack\n- A shield and a holy symbol\n\nAlternatively, you may start with [5d4](roll \"5d4\") × 10 gp to buy your own equipment.\n\n#### Multiclassing\n\nTo qualify for a new class, you must meet the ability score prerequisites for both your current class and your new one.  \n  \n**Ability Score Minimum:** Wisdom 13  \n  \nWhen you gain a level in a class other than your first, you gain only some of that class's starting proficiencies.  \n  \n**Armor:** light armor, medium armor, shields\n\n##### The Cleric\n\n| Level | Proficiency Bonus | Features                                                              |\n|-------|-------------------|-----------------------------------------------------------------------|\n| 1st   | +2                | Spellcasting,Divine Domain                                            |\n| 2nd   | +2                | Channel Divinity (1/rest),Divine Domain feature                       |\n| 3rd   | +2                | —                                                                     |\n| 4th   | +2                | Ability Score Improvement                                             |\n| 5th   | +3                | Destroy Undead (CR 1/2)                                               |\n| 6th   | +3                | Channel Divinity (2/rest),Divine Domain feature                       |\n| 7th   | +3                | —                                                                     |\n| 8th   | +3                | Ability Score Improvement,Destroy Undead (CR 1),Divine Domain feature |\n| 9th   | +4                | —                                                                     |\n| 10th  | +4                | Divine Intervention                                                   |\n| 11th  | +4                | Destroy Undead (CR 2)                                                 |\n| 12th  | +4                | Ability Score Improvement                                             |\n| 13th  | +5                | —                                                                     |\n| 14th  | +5                | Destroy Undead (CR 3)                                                 |\n| 15th  | +5                | —                                                                     |\n| 16th  | +5                | Ability Score Improvement                                             |\n| 17th  | +6                | Destroy Undead (CR 4),Divine Domain feature                           |\n| 18th  | +6                | Channel Divinity (3/rest)                                             |\n| 19th  | +6                | Ability Score Improvement                                             |\n| 20th  | +6                | Divine Intervention Improvement                                       |\n\n##### Spell Slots per Spell Level\n\n| Level | Cantrips Known | 1st | 2nd | 3rd | 4th | 5th | 6th | 7th | 8th | 9th |\n|-------|----------------|-----|-----|-----|-----|-----|-----|-----|-----|-----|\n| 1st   | 3              | 2   | —   | —   | —   | —   | —   | —   | —   | —   |\n| 2nd   | 3              | 3   | —   | —   | —   | —   | —   | —   | —   | —   |\n| 3rd   | 3              | 4   | 2   | —   | —   | —   | —   | —   | —   | —   |\n| 4th   | 4              | 4   | 3   | —   | —   | —   | —   | —   | —   | —   |\n| 5th   | 4              | 4   | 3   | 2   | —   | —   | —   | —   | —   | —   |\n| 6th   | 4              | 4   | 3   | 3   | —   | —   | —   | —   | —   | —   |\n| 7th   | 4              | 4   | 3   | 3   | 1   | —   | —   | —   | —   | —   |\n| 8th   | 4              | 4   | 3   | 3   | 2   | —   | —   | —   | —   | —   |\n| 9th   | 4              | 4   | 3   | 3   | 3   | 1   | —   | —   | —   | —   |\n| 10th  | 5              | 4   | 3   | 3   | 3   | 2   | —   | —   | —   | —   |\n| 11th  | 5              | 4   | 3   | 3   | 3   | 2   | 1   | —   | —   | —   |\n| 12th  | 5              | 4   | 3   | 3   | 3   | 2   | 1   | —   | —   | —   |\n| 13th  | 5              | 4   | 3   | 3   | 3   | 2   | 1   | 1   | —   | —   |\n| 14th  | 5              | 4   | 3   | 3   | 3   | 2   | 1   | 1   | —   | —   |\n| 15th  | 5              | 4   | 3   | 3   | 3   | 2   | 1   | 1   | 1   | —   |\n| 16th  | 5              | 4   | 3   | 3   | 3   | 2   | 1   | 1   | 1   | —   |\n| 17th  | 5              | 4   | 3   | 3   | 3   | 2   | 1   | 1   | 1   | 1   |\n| 18th  | 5              | 4   | 3   | 3   | 3   | 3   | 1   | 1   | 1   | 1   |\n| 19th  | 5              | 4   | 3   | 3   | 3   | 3   | 2   | 1   | 1   | 1   |\n| 20th  | 5              | 4   | 3   | 3   | 3   | 3   | 2   | 2   | 1   | 1   |",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Druid": {
        "description": "#### Hit Points\n\n**Hit Dice:** [1d8](roll \"1d8\")  \n**Hit Points at 1st Level:** [8 + your Constitution modifier](roll \"8+con\")  \n**Hit Points at Higher Levels:** [1d8 (or 5) + your Constitution modifier](roll \"1d8+con\") per Druid level after 1st\n\n#### Proficiencies\n\n**Armor:** light armor, medium armor, shields (druids will not wear armor or use shields made of metal)  \n**Weapons:** clubs, daggers, darts, javelins, maces, quarterstaffs, scimitars, sickles, slings, spears  \n**Tools:** Herbalism kit  \n**Saving Throws:** Intelligence, Wisdom  \n**Skills:** Choose 2 from Arcana, Animal Handling, Insight, Medicine, Nature, Perception, Religion, and Survival.\n\n#### Starting Equipment\n\nYou start with the following items, plus anything provided by your background.\n\n- (a) a wooden shield or (b) any simple weapon\n- (a) a scimitar or (b) any simple melee weapon\n- Leather armor, an explorer's pack, and a druidic focus\n\nAlternatively, you may start with [2d4](roll \"2d4\") × 10 gp to buy your own equipment.\n\n#### Multiclassing\n\nTo qualify for a new class, you must meet the ability score prerequisites for both your current class and your new one.  \n  \n**Ability Score Minimum:** Wisdom 13  \n  \nWhen you gain a level in a class other than your first, you gain only some of that class's starting proficiencies.  \n  \n**Armor:** light armor, medium armor, shields (druids will not wear armor or use shields made of metal)\n\n##### The Druid\n\n| Level | Proficiency Bonus | Features                                         |\n|-------|-------------------|--------------------------------------------------|\n| 1st   | 2                 | Druidic,Spellcasting                             |\n| 2nd   | 2                 | Wild Shape,Druid Circle                          |\n| 3rd   | 2                 | —                                                |\n| 4th   | 2                 | Wild Shape Improvement,Ability Score Improvement |\n| 5th   | 3                 | —                                                |\n| 6th   | 3                 | Druid Circle feature                             |\n| 7th   | 3                 | —                                                |\n| 8th   | 3                 | Wild Shape Improvement,Ability Score Improvement |\n| 9th   | 4                 | —                                                |\n| 10th  | 4                 | Druid Circle feature                             |\n| 11th  | 4                 | —                                                |\n| 12th  | 4                 | Ability Score Improvement                        |\n| 13th  | 5                 | —                                                |\n| 14th  | 5                 | Druid Circle feature                             |\n| 15th  | 5                 | —                                                |\n| 16th  | 5                 | Ability Score Improvement                        |\n| 17th  | 6                 | —                                                |\n| 18th  | 6                 | Timeless Body,Beast Spells                       |\n| 19th  | 6                 | Ability Score Improvement                        |\n| 20th  | 6                 | Archdruid                                        |\n\n##### Spell Slots per Spell Level\n\n| Level | Cantrips Known | 1st | 2nd | 3rd | 4th | 5th | 6th | 7th | 8th | 9th |\n|-------|----------------|-----|-----|-----|-----|-----|-----|-----|-----|-----|\n| 1st   | 2              | 2   | —   | —   | —   | —   | —   | —   | —   | —   |\n| 2nd   | 2              | 3   | —   | —   | —   | —   | —   | —   | —   | —   |\n| 3rd   | 2              | 4   | 2   | —   | —   | —   | —   | —   | —   | —   |\n| 4th   | 3              | 4   | 3   | —   | —   | —   | —   | —   | —   | —   |\n| 5th   | 3              | 4   | 3   | 2   | —   | —   | —   | —   | —   | —   |\n| 6th   | 3              | 4   | 3   | 3   | —   | —   | —   | —   | —   | —   |\n| 7th   | 3              | 4   | 3   | 3   | 1   | —   | —   | —   | —   | —   |\n| 8th   | 3              | 4   | 3   | 3   | 2   | —   | —   | —   | —   | —   |\n| 9th   | 3              | 4   | 3   | 3   | 3   | 1   | —   | —   | —   | —   |\n| 10th  | 4              | 4   | 3   | 3   | 3   | 2   | —   | —   | —   | —   |\n| 11th  | 4              | 4   | 3   | 3   | 3   | 2   | 1   | —   | —   | —   |\n| 12th  | 4              | 4   | 3   | 3   | 3   | 2   | 1   | —   | —   | —   |\n| 13th  | 4              | 4   | 3   | 3   | 3   | 2   | 1   | 1   | —   | —   |\n| 14th  | 4              | 4   | 3   | 3   | 3   | 2   | 1   | 1   | —   | —   |\n| 15th  | 4              | 4   | 3   | 3   | 3   | 2   | 1   | 1   | 1   | —   |\n| 16th  | 4              | 4   | 3   | 3   | 3   | 2   | 1   | 1   | 1   | —   |\n| 17th  | 4              | 4   | 3   | 3   | 3   | 2   | 1   | 1   | 1   | 1   |\n| 18th  | 4              | 4   | 3   | 3   | 3   | 3   | 1   | 1   | 1   | 1   |\n| 19th  | 4              | 4   | 3   | 3   | 3   | 3   | 2   | 1   | 1   | 1   |\n| 20th  | 4              | 4   | 3   | 3   | 3   | 3   | 2   | 2   | 1   | 1   |",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Fighter": {
        "description": "#### Hit Points\n\n**Hit Dice:** [1d10](roll \"1d10\")  \n**Hit Points at 1st Level:** [10 + your Constitution modifier](roll \"10+con\")  \n**Hit Points at Higher Levels:** [1d10 (or 6) + your Constitution modifier](roll \"1d10+con\") per Fighter level after 1st\n\n#### Proficiencies\n\n**Armor:** light armor, medium armor, heavy armor, shields  \n**Weapons:** simple weapons, martial weapons  \n**Tools:** none  \n**Saving Throws:** Strength, Constitution  \n**Skills:** Choose 2 from Acrobatics, Animal Handling, Athletics, History, Insight, Intimidation, Perception, and Survival.\n\n#### Starting Equipment\n\nYou start with the following items, plus anything provided by your background.\n\n- (a) chain mail or (b) leather, longbow, and 20 arrows  \n- (a) a martial weapon and a shield or (b) two martial weapons  \n- (a) a light crossbow and 20 bolts or (b) two handaxes  \n- (a) a dungeoneer's pack or (b) an explorer's pack\n\nAlternatively, you may start with [5d4](roll \"5d4\") × 10 gp to buy your own equipment.\n\n#### Multiclassing\n\nTo qualify for a new class, you must meet the ability score prerequisites for both your current class and your new one.\n\n**Ability Score Minimum:** Strength 13 or Dexterity 13\n\nWhen you gain a level in a class other than your first, you gain only some of that class's starting proficiencies.\n\n**Armor:** light armor, medium armor, shields  \n**Weapons:** simple weapons, martial weapons\n\n##### The Fighter\n\n| Level | Proficiency Bonus | Features                                         |\n|-------|-------------------|--------------------------------------------------|\n| 1st   | +2                | Fighting Style,Second Wind                       |\n| 2nd   | +2                | Action Surge                                     |\n| 3rd   | +2                | Martial Archetype                                |\n| 4th   | +2                | Ability Score Improvement                        |\n| 5th   | +3                | Extra Attack                                     |\n| 6th   | +3                | Ability Score Improvement                        |\n| 7th   | +3                | Martial Archetype feature                        |\n| 8th   | +3                | Ability Score Improvement                        |\n| 9th   | +4                | Indomitable                                      |\n| 10th  | +4                | Martial Archetype feature                        |\n| 11th  | +4                | Extra Attack (2)                                 |\n| 12th  | +4                | Ability Score Improvement                        |\n| 13th  | +5                | Indomitable (two uses)                           |\n| 14th  | +5                | Ability Score Improvement                        |\n| 15th  | +5                | Martial Archetype feature                        |\n| 16th  | +5                | Ability Score Improvement                        |\n| 17th  | +6                | Action Surge (two uses),Indomitable (three uses) |\n| 18th  | +6                | Martial Archetype feature                        |\n| 19th  | +6                | Ability Score Improvement                        |\n| 20th  | +6                | Extra Attack (3)                                 |",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Ki": {
        "description": "Starting at 2nd level, your training allows you to harness the mystic energy of ki. Your access to this energy is represented by a number of ki points. Your monk level determines the number of points you have, as shown in the Ki Points column of the Monk table.\n\nYou can spend these points to fuel various ki features. You start knowing three such features: Flurry of Blows, Patient Defense, and Step of the Wind. You learn more ki features as you gain levels in this class.\n\nWhen you spend a ki point, it is unavailable until you finish a short or long rest, at the end of which you draw all of your expended ki back into yourself. You must spend at least 30 minutes of the rest meditating to regain your ki points.\n\nSome of your ki features require your target to make a saving throw to resist the feature's effects. The saving throw DC is calculated as follows:\n\n**Ki save DC** = 8 + your proficiency bonus + your Wisdom modifier\n\n### Flurry of Blows\n\nImmediately after you take the Attack action on your turn, you can spend 1 ki point to make two unarmed strikes as a bonus action.\n\n### Patient Defense\n\nYou can spend 1 ki point to take the Dodge action as a bonus action on your turn.\n\n### Step of the Wind\n\nYou can spend 1 ki point to take the Disengage or Dash action as a bonus action on your turn, and your jump distance is doubled for the turn.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Unarmored Movement": {
        "description": "Starting at 2nd level, your speed increases by 10 feet while you are not wearing armor or wielding a shield. This bonus increases when you reach certain monk levels, as shown in the Monk table.\n\nAt 9th level, you gain the ability to move along vertical surfaces and across liquids on your turn without falling during the move.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Deflect Missiles": {
        "description": "Starting at 3rd level, you can use your reaction to deflect or catch the missile when you are hit by a ranged weapon attack. When you do so, the damage you take from the attack is reduced by [1d10 + your Dexterity modifier + your monk level](roll \"1d10+dex+monk\").\n\nIf you reduce the damage to 0, you can catch the missile if it is small enough for you to hold in one hand and you have at least one hand free. If you catch a missile in this way, you can spend 1 ki point to make a ranged attack (range 20/60 feet) with the weapon or piece of ammunition you just caught, as part of the same reaction. You make this attack with proficiency, regardless of your weapon proficiencies, and the missile counts as a monk weapon for the attack.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Monastic Tradition": {
        "description": "When you reach 3rd level, you commit yourself to a monastic tradition, chosen from the list of available traditions. Your tradition grants you features at 3rd level and again at 6th, 11th, and 17th level.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Slow Fall": {
        "description": "Beginning at 4th level, you can use your reaction when you fall to reduce any falling damage you take by an amount equal to five times your monk level.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Stunning Strike": {
        "description": "Starting at 5th level, you can interfere with the flow of ki in an opponent's body. When you hit another creature with a melee weapon attack, you can spend 1 ki point to attempt a stunning strike. The target must succeed on a Constitution saving throw or be stunned until the end of your next turn.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Ki-Empowered Strikes": {
        "description": "Starting at 6th level, your unarmed strikes count as magical for the purpose of overcoming resistance and immunity to nonmagical attacks and damage.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Evasion (Monk)": {
        "description": "At 7th level, your instinctive agility lets you dodge out of the way of certain area effects, such as a blue dragon's lightning breath or a fireball spell. When you are subjected to an effect that allows you to make a Dexterity saving throw to take only half damage, you instead take no damage if you succeed on the saving throw, and only half damage if you fail.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Stillness of Mind": {
        "description": "Starting at 7th level, you can use your action to end one effect on yourself that is causing you to be charmed or frightened.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Purity of Body": {
        "description": "At 10th level, your mastery of the ki flowing through you makes you immune to disease and poison.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Tongue of the Sun and Moon": {
        "description": "Starting at 13th level, you learn to touch the ki of other minds so that you understand all spoken languages. Moreover, any creature that can understand a language can understand what you say.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Diamond Soul": {
        "description": "Beginning at 14th level, your mastery of ki grants you proficiency in all saving throws.\n\nAdditionally, whenever you make a saving throw and fail, you can spend 1 ki point to reroll it and take the second result.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Empty Body": {
        "description": "Beginning at 18th level, you can use your action to spend 4 ki points to become invisible for 1 minute. During that time, you also have resistance to all damage but force damage.\n\nAdditionally, you can spend 8 ki points to cast the astral projection spell, without needing material components. When you do so, you can't take any other creatures with you.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Way of the Open Hand": {
        "description": "Monks of the Way of the Open Hand are the ultimate masters of martial arts combat, whether armed or unarmed. They learn techniques to push and trip their opponents, manipulate ki to heal damage to their bodies, and practice advanced meditation that can protect them from harm.\n\n### Open Hand Technique\n\nYou can manipulate your enemy's ki when you harness your own. Whenever you hit a creature with one of the attacks granted by your Flurry of Blows, you can impose one of the following effects on that target.\n\n- It must succeed on a Dexterity saving throw or be knocked prone.\n- It must make a Strength saving throw. If it fails, you can push it up to 15 feet away from you.\n- It can't take reactions until the end of your next turn.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Wholeness of Body": {
        "description": "You gain the ability to heal yourself. As an action, you can regain hit points equal to three times your monk level. You must finish a long rest before you can use this feature again.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Tranquility": {
        "description": "Beginning at 11th level, you can enter a special meditation that surrounds you with an aura of peace. At the end of a long rest, you gain the effect of a [sanctuary](level 1 \"Sanctuary\") spell that lasts until the start of your next long rest (the spell can end early as normal). The saving throw DC for the spell equals 8 + your Wisdom modifier + your proficiency bonus.\n\nSanctuary gives this effect: You ward a creature within range against attack. Until the spell ends, any creature who targets the warded creature with an attack or a harmful spell must first make a Wisdom saving throw. On a failed save, the creature must choose a new target or lose the attack or spell. This spell doesn't protect the warded creature from area effects, such as the explosion of a fireball.\n\nIf the warded creature makes an attack or casts a spell that affects an enemy creature, this spell ends.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Quivering Palm": {
        "description": "You gain the ability to set up lethal vibrations in someone's body. When you hit a creature with an unarmed strike, you can spend 3 ki points to start these imperceptible vibrations, which last for a number of days equal to your monk level. The vibrations are harmless unless you use your action to end them. To do so, you and the target must be on the same plane of existence. When you use this action, the creature must make a Constitution saving throw. If it fails, it is reduced to 0 hit points. If it succeeds, it takes [10d10 necrotic damage](roll \"10d10\").",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Monk": {
        "description": "#### Hit Points\n\n**Hit Dice:** [1d8](roll \"1d8\")  \n**Hit Points at 1st Level:** [8 + your Constitution modifier](roll \"8+con\")  \n**Hit Points at Higher Levels:** [1d8 (or 5) + your Constitution modifier](roll \"1d8+con\") per Monk level after 1st\n\n#### Proficiencies\n\n**Armor:** none  \n**Weapons:** simple weapons, shortswords  \n**Tools:** any one type of artisan's tools or any one musical instrument of your choice  \n**Saving Throws:** Strength, Dexterity  \n**Skills:** Choose 2 from Acrobatics, Athletics, History, Insight, Religion, and Stealth.\n\n#### Starting Equipment\n\nYou start with the following items, plus anything provided by your background.\n\n- (a) a shortsword or (b) any simple weapon\n- (a) a dungeoneer's pack or (b) an explorer's pack\n10 darts\n\nAlternatively, you may start with [5d4](roll \"5d4\") gp to buy your own equipment.\n\n#### Multiclassing\n\nTo qualify for a new class, you must meet the ability score prerequisites for both your current class and your new one.\n\n**Ability Score Minimum:** Dexterity 13, Wisdom 13\n\nWhen you gain a level in a class other than your first, you gain only some of that class's starting proficiencies.\n\n**Weapons:** simple weapons, shortswords\n\n##### The Monk\n\n| Level | Proficiency Bonus | Features                                        | Martial Arts | Ki Points | Unarmored Movement |\n|-------|-------------------|-------------------------------------------------|--------------|-----------|--------------------|\n| 1st   | +2                | Unarmored Defense,Martial Arts                  | [1d4](roll \"1d4\")           | —         | +0 ft.             |\n| 2nd   | +2                | Ki,Unarmored Movement                           | [1d4](roll \"1d4\")          | 2         | +10 ft.            |\n| 3rd   | +2                | Deflect Missiles,Monastic Tradition             | [1d4](roll \"1d4\")          | 3         | +10 ft.            |\n| 4th   | +2                | Ability Score Improvement,Slow Fall             | [1d4](roll \"1d4\")          | 4         | +10 ft.            |\n| 5th   | +3                | Extra Attack,Stunning Strike                    | [1d6](roll \"1d6\")          | 5         | +10 ft.            |\n| 6th   | +3                | Ki-Empowered Strikes,Monastic Tradition feature | [1d6](roll \"1d6\")          | 6         | +15 ft.            |\n| 7th   | +3                | Evasion,Stillness of Mind                       | [1d6](roll \"1d6\")          | 7         | +15 ft.            |\n| 8th   | +3                | Ability Score Improvement                       | [1d6](roll \"1d6\")          | 8         | +15 ft.            |\n| 9th   | +4                | Unarmored Movement improvement                  | [1d6](roll \"1d6\")          | 9         | +15 ft.            |\n| 10th  | +4                | Purity of Body                                  | [1d6](roll \"1d6\")          | 10        | +20 ft.            |\n| 11th  | +4                | Monastic Tradition feature                      | [1d8](roll \"1d8\")          | 11        | +20 ft.            |\n| 12th  | +4                | Ability Score Improvement                       | [1d8](roll \"1d8\")          | 12        | +20 ft.            |\n| 13th  | +5                | Tongue of the Sun and Moon                      | [1d8](roll \"1d8\")          | 13        | +20 ft.            |\n| 14th  | +5                | Diamond Soul                                    | [1d8](roll \"1d8\")          | 14        | +25 ft.            |\n| 15th  | +5                | Timeless Body                                   | [1d8](roll \"1d8\")          | 15        | +25 ft.            |\n| 16th  | +5                | Ability Score Improvement                       | [1d8](roll \"1d8\")          | 16        | +25 ft.            |\n| 17th  | +6                | Monastic Tradition feature                      | [1d10](roll \"1d10\")         | 17        | +25 ft.            |\n| 18th  | +6                | Empty Body                                      | [1d10](roll \"1d10\")         | 18        | +30 ft.            |\n| 19th  | +6                | Ability Score Improvement                       | [1d10](roll \"1d10\")         | 19        | +30 ft.            |\n| 20th  | +6                | Perfect Soul                                    | [1d10](roll \"1d10\")         | 20        | +30 ft.            |",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Paladin": {
        "description": "#### Hit Points\n\n**Hit Dice:** [1d10](roll \"1d10\")  \n**Hit Points at 1st Level:** [10 + your Constitution modifier](roll \"10+con\")  \n**Hit Points at Higher Levels:** [1d10 (or 6) + your Constitution modifier](roll \"1d10+con\") per Paladin level after 1st\n\n#### Proficiencies\n\n**Armor:** light armor, medium armor, heavy armor, shields  \n**Weapons:** simple weapons, martial weapons  \n**Tools:** none  \n**Saving Throws:** Wisdom, Charisma  \n**Skills:** Choose 2 from Athletics, Insight, Intimidation, Medicine, Persuasion, and Religion.\n\n#### Starting Equipment\n\nYou start with the following items, plus anything provided by your background.\n\n- (a) a martial weapon and a shield or (b) two martial weapons\n- (a) five javelins or (b) any simple melee weapon\n- (a) a priest's pack or (b) an explorer's pack\n- Chain mail and a holy symbol\n\nAlternatively, you may start with [5d4](roll \"5d4\") × 10 gp to buy your own equipment.\n\n#### Multiclassing\n\nTo qualify for a new class, you must meet the ability score prerequisites for both your current class and your new one.\n\n**Ability Score Minimum:** Strength 13, Charisma 13\n\nWhen you gain a level in a class other than your first, you gain only some of that class's starting proficiencies.\n\n**Armor:** light armor, medium armor, shields  \n**Weapons:** simple weapons, martial weapons\n\n##### The Paladin\n\n| Level | Proficiency Bonus | Features                                 |\n|-------|-------------------|------------------------------------------|\n| 1st   | 2                 | Divine Sense,Lay on Hands                |\n| 2nd   | 2                 | Divine Smite,Fighting Style,Spellcasting |\n| 3rd   | 2                 | Divine Health,Sacred Oath                |\n| 4th   | 2                 | Ability Score Improvement                |\n| 5th   | 3                 | Extra Attack                             |\n| 6th   | 3                 | Aura of Protection                       |\n| 7th   | 3                 | Sacred Oath feature                      |\n| 8th   | 3                 | Ability Score Improvement                |\n| 9th   | 4                 | —                                        |\n| 10th  | 4                 | Aura of Courage                          |\n| 11th  | 4                 | Improved Divine Smite                    |\n| 12th  | 4                 | Ability Score Improvement                |\n| 13th  | 5                 | —                                        |\n| 14th  | 5                 | Cleansing Touch                          |\n| 15th  | 5                 | Sacred Oath feature                      |\n| 16th  | 5                 | Ability Score Improvement                |\n| 17th  | 6                 | —                                        |\n| 18th  | 6                 | Aura improvements                        |\n| 19th  | 6                 | Ability Score Improvement                |\n| 20th  | 6                 | Sacred Oath feature                      |\n\n##### Spell Slots per Spell Level\n\n| Level | 1st | 2nd | 3rd | 4th | 5th |\n|-------|-----|-----|-----|-----|-----|\n| 1st   | —   | —   | —   | —   | —   |\n| 2nd   | 2   | —   | —   | —   | —   |\n| 3rd   | 3   | —   | —   | —   | —   |\n| 4th   | 3   | —   | —   | —   | —   |\n| 5th   | 4   | 2   | —   | —   | —   |\n| 6th   | 4   | 2   | —   | —   | —   |\n| 7th   | 4   | 3   | —   | —   | —   |\n| 8th   | 4   | 3   | —   | —   | —   |\n| 9th   | 4   | 3   | 2   | —   | —   |\n| 10th  | 4   | 3   | 2   | —   | —   |\n| 11th  | 4   | 3   | 3   | —   | —   |\n| 12th  | 4   | 3   | 3   | —   | —   |\n| 13th  | 4   | 3   | 3   | 1   | —   |\n| 14th  | 4   | 3   | 3   | 1   | —   |\n| 15th  | 4   | 3   | 3   | 2   | —   |\n| 16th  | 4   | 3   | 3   | 2   | —   |\n| 17th  | 4   | 3   | 3   | 3   | 1   |\n| 18th  | 4   | 3   | 3   | 3   | 1   |\n| 19th  | 4   | 3   | 3   | 3   | 2   |\n| 20th  | 4   | 3   | 3   | 3   | 2   |",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Ranger": {
        "description": "#### Hit Points\n\n**Hit Dice:** [1d10](roll \"1d10\")  \n**Hit Points at 1st Level:** [10 + your Constitution modifier](roll \"1d10\")  \n**Hit Points at Higher Levels:** [1d10 (or 6) + your Constitution modifier](roll \"1d10\") per Ranger level after 1st\n\n#### Proficiencies\n\n**Armor:** light armor, medium armor, shields  \n**Weapons:** simple weapons, martial weapons  \n**Tools:** none  \n**Saving Throws:** Strength, Dexterity  \n**Skills:** Choose 3 from Animal Handling, Athletics, Insight, Investigation, Nature, Perception, Stealth, and Survival.\n\n#### Starting Equipment\n\nYou start with the following items, plus anything provided by your background.\n\n- (a) scale mail or (b) leather armor\n- (a) two shortswords or (b) two simple melee weapons\n- (a) a dungeoneer's pack or (b) an explorer's pack\n- A longbow and a quiver of 20 arrows\n\nAlternatively, you may start with [5d4](roll \"5d4\") × 10 gp to buy your own equipment.\n\n#### Multiclassing\n\nTo qualify for a new class, you must meet the ability score prerequisites for both your current class and your new one.\n\n**Ability Score Minimum:** Dexterity 13, Wisdom 13\n\nWhen you gain a level in a class other than your first, you gain only some of that class's starting proficiencies.\n\n**Armor:** light armor, medium armor, shields  \n**Weapons:** simple weapons, martial weapons  \n**Skills:** Choose 1 from Animal Handling, Athletics, Insight, Investigation, Nature, Perception, Stealth, and Survival.\n\n##### The Ranger\n\n| Level | Proficiency Bonus | Features                                         |\n|-------|-------------------|--------------------------------------------------|\n| 1st   | 2                 | Favored Enemy,Natural Explorer                   |\n| 2nd   | 2                 | Fighting Style,Spellcasting                      |\n| 3rd   | 2                 | Ranger Archetype,Primeval Awareness              |\n| 4th   | 2                 | Ability Score Improvement                        |\n| 5th   | 3                 | Extra Attack                                     |\n| 6th   | 3                 | Favored Enemy and Natural Explorer improvements  |\n| 7th   | 3                 | Ranger Archetype feature                         |\n| 8th   | 3                 | Ability Score Improvement,Land's Stride          |\n| 9th   | 4                 | —                                                |\n| 10th  | 4                 | Hide in Plain Sight,Natural Explorer improvement |\n| 11th  | 4                 | Ranger Archetype feature                         |\n| 12th  | 4                 | Ability Score Improvement                        |\n| 13th  | 5                 | —                                                |\n| 14th  | 5                 | Vanish,Favored Enemy improvement                 |\n| 15th  | 5                 | Ranger Archetype feature                         |\n| 16th  | 5                 | Ability Score Improvement                        |\n| 17th  | 6                 | —                                                |\n| 18th  | 6                 | Feral Senses                                     |\n| 19th  | 6                 | Ability Score Improvement                        |\n| 20th  | 6                 | Foe Slayer                                       |\n\n##### Spell Slots per Spell Level\n\n| Level | Spells Known | 1st | 2nd | 3rd | 4th | 5th |\n|-------|--------------|-----|-----|-----|-----|-----|\n| 1st   | —            | —   | —   | —   | —   | —   |\n| 2nd   | 2            | 2   | —   | —   | —   | —   |\n| 3rd   | 3            | 3   | —   | —   | —   | —   |\n| 4th   | 3            | 3   | —   | —   | —   | —   |\n| 5th   | 4            | 4   | 2   | —   | —   | —   |\n| 6th   | 4            | 4   | 2   | —   | —   | —   |\n| 7th   | 5            | 4   | 3   | —   | —   | —   |\n| 8th   | 5            | 4   | 3   | —   | —   | —   |\n| 9th   | 6            | 4   | 3   | 2   | —   | —   |\n| 10th  | 6            | 4   | 3   | 2   | —   | —   |\n| 11th  | 7            | 4   | 3   | 3   | —   | —   |\n| 12th  | 7            | 4   | 3   | 3   | —   | —   |\n| 13th  | 8            | 4   | 3   | 3   | 1   | —   |\n| 14th  | 8            | 4   | 3   | 3   | 1   | —   |\n| 15th  | 9            | 4   | 3   | 3   | 2   | —   |\n| 16th  | 9            | 4   | 3   | 3   | 2   | —   |\n| 17th  | 10           | 4   | 3   | 3   | 3   | 1   |\n| 18th  | 10           | 4   | 3   | 3   | 3   | 1   |\n| 19th  | 11           | 4   | 3   | 3   | 3   | 2   |\n| 20th  | 11           | 4   | 3   | 3   | 3   | 2   |",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Rogue": {
        "description": "#### Hit Points\n\n**Hit Dice:** [1d8](roll \"1d8\")  \n**Hit Points at 1st Level:** [8 + your Constitution modifier](roll \"8+con\")  \n**Hit Points at Higher Levels:** [1d8 (or 5) + your Constitution modifier](roll \"1d8+con\") per Rogue level after 1st\n\n#### Proficiencies\n\n**Armor:** light armor  \n**Weapons:** simple weapons, hand crossbows, longswords, rapiers, shortswords  \n**Tools:** thieves' tools  \n**Saving Throws:** Dexterity, Intelligence  \n**Skills:** Choose 4 from Acrobatics, Athletics, Deception, Insight, Intimidation, Investigation, Perception, Performance, Persuasion, Sleight of Hand, and Stealth.\n\n#### Starting Equipment\n\nYou start with the following items, plus anything provided by your background.\n\n- (a) a rapier or (b) a shortsword\n- (a) a shortbow and quiver of 20 arrows or (b) a shortsword\n- (a) a burglar's pack, (b) a dungeoneer's pack, or (c) an explorer's pack\n- Leather armor, two daggers, and thieves' tools\n\nAlternatively, you may start with [4d4](roll \"4d4\") × 10 gp to buy your own equipment.\n\n#### Multiclassing\n\nTo qualify for a new class, you must meet the ability score prerequisites for both your current class and your new one.\n\n**Ability Score Minimum:** Dexterity 13\n\nWhen you gain a level in a class other than your first, you gain only some of that class's starting proficiencies.\n\n**Armor:** light armor  \n**Tools:** thieves' tools  \n**Skills:** Choose 1 from Acrobatics, Athletics, Deception, Insight, Intimidation, Investigation, Perception, Performance, Persuasion, Sleight of Hand, and Stealth.\n\n##### The Rogue\n\n| Level | Proficiency Bonus | Features                             | Sneak Attack |\n|-------|-------------------|--------------------------------------|--------------|\n| 1st   | +2                | Expertise,Sneak Attack,Thieves' Cant | [1d6](roll \"1d6\")           |\n| 2nd   | +2                | Cunning Action                       | [1d6](roll \"1d6\")          |\n| 3rd   | +2                | Roguish Archetype                    | [2d6](roll \"2d6\")          |\n| 4th   | +2                | Ability Score Improvement            | [2d6](roll \"2d6\")          |\n| 5th   | +3                | Uncanny Dodge                        | [3d6](roll \"3d6\")          |\n| 6th   | +3                | Expertise                            | [3d6](roll \"3d6\")          |\n| 7th   | +3                | Evasion                              | [4d6](roll \"4d6\")          |\n| 8th   | +3                | Ability Score Improvement            | [4d6](roll \"4d6\")          |\n| 9th   | +4                | Roguish Archetype feature            | [5d6](roll \"5d6\")          |\n| 10th  | +4                | Ability Score Improvement            | [5d6](roll \"5d6\")          |\n| 11th  | +4                | Reliable Talent                      | [6d6](roll \"6d6\")          |\n| 12th  | +4                | Ability Score Improvement            | [6d6](roll \"6d6\")          |\n| 13th  | +5                | Roguish Archetype feature            | [7d6](roll \"7d6\")          |\n| 14th  | +5                | Blindsense                           | [7d6](roll \"7d6\")          |\n| 15th  | +5                | Slippery Mind                        | [8d6](roll \"8d6\")          |\n| 16th  | +5                | Ability Score Improvement            | [8d6](roll \"8d6\")          |\n| 17th  | +6                | Roguish Archetype feature            | [9d6](roll \"9d6\")          |\n| 18th  | +6                | Elusive                              | [9d6](roll \"9d6\")          |\n| 19th  | +6                | Ability Score Improvement            | [10d6](roll \"10d6\")          |\n| 20th  | +6                | Stroke of Luck                       | [10d6](roll \"10d6\")         |",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Sorcerer": {
        "description": "#### Hit Points\n\n**Hit Dice:** [1d6](roll \"1d6\")  \n**Hit Points at 1st Level:** [6 + your Constitution modifier](roll \"6+con\")  \n**Hit Points at Higher Levels:** [1d6 (or 4) + your Constitution modifier](roll \"1d6+con\") per Sorcerer level after 1st\n\n#### Proficiencies\n\n**Armor:** none  \n**Weapons:** daggers, darts, slings, quarterstaffs, light crossbows  \n**Tools:** none  \n**Saving Throws:** Constitution, Charisma  \n**Skills:** Choose 2 from Arcana, Deception, Insight, Intimidation, Persuasion, and Religion.\n\n#### Starting Equipment\n\nYou start with the following items, plus anything provided by your background.\n\n- (a) a light crossbow and 20 bolts or (b) any simple weapon\n- (a) a component pouch or (b) an arcane focus\n- (a) a dungeoneer's pack or (b) an explorer's pack\n- Two daggers\n\nAlternatively, you may start with [3d4](roll \"3d4\") × 10 gp to buy your own equipment.\n\n#### Multiclassing\n\nTo qualify for a new class, you must meet the ability score prerequisites for both your current class and your new one.\n\n**Ability Score Minimum:** Charisma 13\n\n##### The Sorcerer\n\n| Level | Proficiency Bonus | Features                      | Sorcery Points |\n|-------|-------------------|-------------------------------|----------------|\n| 1st   | 2                 | Spellcasting,Sorcerous Origin | —              |\n| 2nd   | 2                 | Font of Magic                 | 2              |\n| 3rd   | 2                 | Metamagic                     | 3              |\n| 4th   | 2                 | Ability Score Improvement     | 4              |\n| 5th   | 3                 | —                             | 5              |\n| 6th   | 3                 | Sorcerous Origin feature      | 6              |\n| 7th   | 3                 | —                             | 7              |\n| 8th   | 3                 | Ability Score Improvement     | 8              |\n| 9th   | 4                 | —                             | 9              |\n| 10th  | 4                 | Metamagic                     | 10             |\n| 11th  | 4                 | —                             | 11             |\n| 12th  | 4                 | Ability Score Improvement     | 12             |\n| 13th  | 5                 | —                             | 13             |\n| 14th  | 5                 | Sorcerous Origin feature      | 14             |\n| 15th  | 5                 | —                             | 15             |\n| 16th  | 5                 | Ability Score Improvement     | 16             |\n| 17th  | 6                 | Metamagic                     | 17             |\n| 18th  | 6                 | Sorcerous Origin feature      | 18             |\n| 19th  | 6                 | Ability Score Improvement     | 19             |\n| 20th  | 6                 | Sorcerous Restoration         | 20             |\n\n##### Spell Slots per Spell Level\n\n| Level | Cantrips Known | Spells Known | 1st | 2nd | 3rd | 4th | 5th | 6th | 7th | 8th | 9th |\n|-------|----------------|--------------|-----|-----|-----|-----|-----|-----|-----|-----|-----|\n| 1st   | 4              | 2            | 2   | —   | —   | —   | —   | —   | —   | —   | —   |\n| 2nd   | 4              | 3            | 3   | —   | —   | —   | —   | —   | —   | —   | —   |\n| 3rd   | 4              | 4            | 4   | 2   | —   | —   | —   | —   | —   | —   | —   |\n| 4th   | 5              | 5            | 4   | 3   | —   | —   | —   | —   | —   | —   | —   |\n| 5th   | 5              | 6            | 4   | 3   | 2   | —   | —   | —   | —   | —   | —   |\n| 6th   | 5              | 7            | 4   | 3   | 3   | —   | —   | —   | —   | —   | —   |\n| 7th   | 5              | 8            | 4   | 3   | 3   | 1   | —   | —   | —   | —   | —   |\n| 8th   | 5              | 9            | 4   | 3   | 3   | 2   | —   | —   | —   | —   | —   |\n| 9th   | 5              | 10           | 4   | 3   | 3   | 3   | 1   | —   | —   | —   | —   |\n| 10th  | 6              | 11           | 4   | 3   | 3   | 3   | 2   | —   | —   | —   | —   |\n| 11th  | 6              | 12           | 4   | 3   | 3   | 3   | 2   | 1   | —   | —   | —   |\n| 12th  | 6              | 12           | 4   | 3   | 3   | 3   | 2   | 1   | —   | —   | —   |\n| 13th  | 6              | 13           | 4   | 3   | 3   | 3   | 2   | 1   | 1   | —   | —   |\n| 14th  | 6              | 13           | 4   | 3   | 3   | 3   | 2   | 1   | 1   | —   | —   |\n| 15th  | 6              | 14           | 4   | 3   | 3   | 3   | 2   | 1   | 1   | 1   | —   |\n| 16th  | 6              | 14           | 4   | 3   | 3   | 3   | 2   | 1   | 1   | 1   | —   |\n| 17th  | 6              | 15           | 4   | 3   | 3   | 3   | 2   | 1   | 1   | 1   | 1   |\n| 18th  | 6              | 15           | 4   | 3   | 3   | 3   | 3   | 1   | 1   | 1   | 1   |\n| 19th  | 6              | 15           | 4   | 3   | 3   | 3   | 3   | 2   | 1   | 1   | 1   |\n| 20th  | 6              | 15           | 4   | 3   | 3   | 3   | 3   | 2   | 2   | 1   | 1   |",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Warlock": {
        "description": "#### Hit Points\n\n**Hit Dice:** [1d8](roll \"1d8\")  \n**Hit Points at 1st Level:** [8 + your Constitution modifier](roll \"8+con\")  \n**Hit Points at Higher Levels:** [1d8 (or 5) + your Constitution modifier](roll \"1d8+con\") per Warlock level after 1st\n\n#### Proficiencies\n\n**Armor:** light armor  \n**Weapons:** simple weapons  \n**Tools:** none  \n**Saving Throws:** Wisdom, Charisma  \n**Skills:** Choose 2 from Arcana, Deception, History, Intimidation, Investigation, Nature, and Religion.\n\n#### Starting Equipment\n\nYou start with the following items, plus anything provided by your background.\n\n- (a) a light crossbow and 20 bolts or (b) any simple weapon\n- (a) a component pouch or (b) an arcane focus\n- (a) a scholar's pack or (b) a dungeoneer's pack\n- Leather armor, any simple weapon, and two daggers\n\nAlternatively, you may start with [4d4](roll \"4d4\") × 10 gp to buy your own equipment.\n\n#### Multiclassing\n\nTo qualify for a new class, you must meet the ability score prerequisites for both your current class and your new one.  \n  \n**Ability Score Minimum:** Charisma 13  \n  \nWhen you gain a level in a class other than your first, you gain only some of that class's starting proficiencies.  \n  \n**Armor:** light armor  \n**Weapons:** simple weapons\n\n##### The Warlock\n\n| Level | Proficiency Bonus | Features                       |\n|-------|-------------------|--------------------------------|\n| 1st   | 2                 | Pact Magic,Otherworldly Patron |\n| 2nd   | 2                 | Eldritch Invocations           |\n| 3rd   | 2                 | Pact Boon                      |\n| 4th   | 2                 | Ability Score Improvement      |\n| 5th   | 3                 | —                              |\n| 6th   | 3                 | Otherworldly Patron feature    |\n| 7th   | 3                 | —                              |\n| 8th   | 3                 | Ability Score Improvement      |\n| 9th   | 4                 | —                              |\n| 10th  | 4                 | Otherworldly Patron feature    |\n| 11th  | 4                 | Mystic Arcanum (6th level)     |\n| 12th  | 4                 | Ability Score Improvement      |\n| 13th  | 5                 | Mystic Arcanum (7th level)     |\n| 14th  | 5                 | Otherworldly Patron feature    |\n| 15th  | 5                 | Mystic Arcanum (8th level)     |\n| 16th  | 5                 | Ability Score Improvement      |\n| 17th  | 6                 | Mystic Arcanum (9th level)     |\n| 18th  | 6                 | —                              |\n| 19th  | 6                 | Ability Score Improvement      |\n| 20th  | 6                 | Eldritch Master                |\n\n##### Pact Magic\n\n| Level | Cantrips Known | Spells Known | Spell Slots | Slot Level | Invocations Known |\n|-------|----------------|--------------|-------------|------------|-------------------|\n| 1st   | 2              | 2            | 1           | 1st        | —                 |\n| 2nd   | 2              | 3            | 2           | 1st        | 2                 |\n| 3rd   | 2              | 4            | 2           | 2nd        | 2                 |\n| 4th   | 3              | 5            | 2           | 2nd        | 2                 |\n| 5th   | 3              | 6            | 2           | 3rd        | 3                 |\n| 6th   | 3              | 7            | 2           | 3rd        | 3                 |\n| 7th   | 3              | 8            | 2           | 4th        | 4                 |\n| 8th   | 3              | 9            | 2           | 4th        | 4                 |\n| 9th   | 3              | 10           | 2           | 5th        | 5                 |\n| 10th  | 4              | 10           | 2           | 5th        | 5                 |\n| 11th  | 4              | 11           | 3           | 5th        | 5                 |\n| 12th  | 4              | 11           | 3           | 5th        | 6                 |\n| 13th  | 4              | 12           | 3           | 5th        | 6                 |\n| 14th  | 4              | 12           | 3           | 5th        | 6                 |\n| 15th  | 4              | 13           | 3           | 5th        | 7                 |\n| 16th  | 4              | 13           | 3           | 5th        | 7                 |\n| 17th  | 4              | 14           | 4           | 5th        | 7                 |\n| 18th  | 4              | 14           | 4           | 5th        | 8                 |\n| 19th  | 4              | 15           | 4           | 5th        | 8                 |\n| 20th  | 4              | 15           | 4           | 5th        | 8                 |",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Wizard": {
        "description": "#### Hit Points\n\n**Hit Dice:** [1d6](roll \"1d6\")  \n**Hit Points at 1st Level:** [6 + your Constitution modifier](roll \"6+con\")  \n**Hit Points at Higher Levels:** [1d6 (or 4) + your Constitution modifier](roll \"1d6+con\") per Wizard level after 1st\n\n#### Proficiencies\n\n**Armor:** none  \n**Weapons:** daggers, darts, slings, quarterstaffs, light crossbows  \n**Tools:** none  \n**Saving Throws:** Intelligence, Wisdom  \n**Skills:** Choose 2 from Arcana, History, Insight, Investigation, Medicine, and Religion.\n\n#### Starting Equipment\n\nYou start with the following items, plus anything provided by your background.\n\n- (a) a quarterstaff or (b) a dagger\n- (a) a component pouch or (b) an arcane focus\n- (a) a scholar's pack or (b) an explorer's pack\n- A spellbook\n\nAlternatively, you may start with [4d4](roll \"4d4\") × 10 gp to buy your own equipment.\n\n#### Multiclassing\n\nTo qualify for a new class, you must meet the ability score prerequisites for both your current class and your new one.\n\n**Ability Score Minimum:** Intelligence 13\n\n##### The Wizard\n\n| Level | Proficiency Bonus | Features                     |\n|-------|-------------------|------------------------------|\n| 1st   | 2                 | Arcane Recovery,Spellcasting |\n| 2nd   | 2                 | Arcane Tradition             |\n| 3rd   | 2                 | —                            |\n| 4th   | 2                 | Ability Score Improvement    |\n| 5th   | 3                 | —                            |\n| 6th   | 3                 | Arcane Tradition feature     |\n| 7th   | 3                 | —                            |\n| 8th   | 3                 | Ability Score Improvement    |\n| 9th   | 4                 | —                            |\n| 10th  | 4                 | Arcane Tradition feature     |\n| 11th  | 4                 | —                            |\n| 12th  | 4                 | Ability Score Improvement    |\n| 13th  | 5                 | —                            |\n| 14th  | 5                 | Arcane Tradition feature     |\n| 15th  | 5                 | —                            |\n| 16th  | 5                 | Ability Score Improvement    |\n| 17th  | 6                 | —                            |\n| 18th  | 6                 | Spell Mastery                |\n| 19th  | 6                 | Ability Score Improvement    |\n| 20th  | 6                 | Signature Spells             |\n\n##### Spell Slots per Spell Level\n\n| Level | Cantrips Known | 1st | 2nd | 3rd | 4th | 5th | 6th | 7th | 8th | 9th |\n|-------|----------------|-----|-----|-----|-----|-----|-----|-----|-----|-----|\n| 1st   | 3              | 2   | —   | —   | —   | —   | —   | —   | —   | —   |\n| 2nd   | 3              | 3   | —   | —   | —   | —   | —   | —   | —   | —   |\n| 3rd   | 3              | 4   | 2   | —   | —   | —   | —   | —   | —   | —   |\n| 4th   | 4              | 4   | 3   | —   | —   | —   | —   | —   | —   | —   |\n| 5th   | 4              | 4   | 3   | 2   | —   | —   | —   | —   | —   | —   |\n| 6th   | 4              | 4   | 3   | 3   | —   | —   | —   | —   | —   | —   |\n| 7th   | 4              | 4   | 3   | 3   | 1   | —   | —   | —   | —   | —   |\n| 8th   | 4              | 4   | 3   | 3   | 2   | —   | —   | —   | —   | —   |\n| 9th   | 4              | 4   | 3   | 3   | 3   | 1   | —   | —   | —   | —   |\n| 10th  | 5              | 4   | 3   | 3   | 3   | 2   | —   | —   | —   | —   |\n| 11th  | 5              | 4   | 3   | 3   | 3   | 2   | 1   | —   | —   | —   |\n| 12th  | 5              | 4   | 3   | 3   | 3   | 2   | 1   | —   | —   | —   |\n| 13th  | 5              | 4   | 3   | 3   | 3   | 2   | 1   | 1   | —   | —   |\n| 14th  | 5              | 4   | 3   | 3   | 3   | 2   | 1   | 1   | —   | —   |\n| 15th  | 5              | 4   | 3   | 3   | 3   | 2   | 1   | 1   | 1   | —   |\n| 16th  | 5              | 4   | 3   | 3   | 3   | 2   | 1   | 1   | 1   | —   |\n| 17th  | 5              | 4   | 3   | 3   | 3   | 2   | 1   | 1   | 1   | 1   |\n| 18th  | 5              | 4   | 3   | 3   | 3   | 3   | 1   | 1   | 1   | 1   |\n| 19th  | 5              | 4   | 3   | 3   | 3   | 3   | 2   | 1   | 1   | 1   |\n| 20th  | 5              | 4   | 3   | 3   | 3   | 3   | 2   | 2   | 1   | 1   |",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Spellcasting (Paladin)": {
        "description": "By 2nd level, you have learned to draw on divine magic through meditation and prayer to cast spells as a cleric does. See chapter 10 for the general rules of spellcasting and chapter 11 for the paladin spell list.\n\n#### Preparing and Casting Spells\n\nThe Paladin table shows how many spell slots you have to cast your paladin spells. To cast one of your paladin spells of 1st level or higher, you must expend a slot of the spell's level or higher. You regain all expended spell slots when you finish a long rest.\n\nYou prepare the list of paladin spells that are available for you to cast, choosing from the paladin spell list. When you do so, choose a number of paladin spells equal to your Charisma modifier + half your paladin level, rounded down (minimum of one spell). The spells must be of a level for which you have spell slots.\n\nFor example, if you are a 5th-level paladin, you have four 1st-level and two 2nd-level spell slots. With a Charisma of 14, your list of prepared spells can include four spells of 1st or 2nd-level, in any combination. If you prepare the 1st-level spell cure wounds, you can cast it using a 1st-level or a 2nd-level slot. Casting the spell doesn't remove it from your list of prepared spells.\n\nYou can change your list of prepared spells when you finish a long rest. Preparing a new list of paladin spells requires time spent in prayer and meditation: at least 1 minute per spell level for each spell on your list.\n\n#### Spellcasting Ability\n\nCharisma is your spellcasting ability for your paladin spells, since their power derives from the strength of your convictions. You use your Charisma whenever a spell refers to your spellcasting ability. In addition, you use your Charisma modifier when setting the saving throw DC for a paladin spell you cast and when making an attack roll with one.\n\n**Spell save DC** = 8 + your proficiency bonus + your Charisma modifier  \n**Spell attack modifier** = your proficiency bonus + your Charisma modifier\n\n#### Spellcasting Focus\n\nYou can use a holy symbol (found in chapter 5) as a spellcasting focus for your paladin spells.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Divine Health": {
        "description": "By 3rd level, the divine magic flowing through you makes you immune to disease.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Sacred Oath": {
        "description": "When you reach 3rd level, you swear the oath that binds you as a paladin forever. Up to this time you have been in a preparatory stage, committed to the path but not yet sworn to it. Now you choose from the list of available oaths.\n\nYour choice grants you features at 3rd level and again at 7th, 15th, and 20th level. Those features include oath spells and the Channel Divinity feature.\n\n#### Oath Spells\n\nEach oath has a list of associated spells. You gain access to these spells at the levels specified in the oath description. Once you gain access to an oath spell, you always have it prepared. Oath spells don't count against the number of spells you can prepare each day.\n\nIf you gain an oath spell that doesn't appear on the paladin spell list, the spell is nonetheless a paladin spell for you.\n\n#### Channel Divinity\n\nYour oath allows you to channel divine energy to fuel magical effects. Each Channel Divinity option provided by your oath explains how to use it.\n\nWhen you use your Channel Divinity, you choose which option to use. You must then finish a short or long rest to use your Channel Divinity again.\n\nSome Channel Divinity effects require saving throws. When you use such an effect from this class, the DC equals your paladin spell save DC.\n\n```\n##### Breaking Your Oath\n\nA paladin tries to hold to the highest standards of conduct, but even the most virtuous paladin is fallible. Sometimes the right path proves too demanding, sometimes a situation calls for the lesser of two evils, and sometimes the heat of emotion causes a paladin to transgress his or her oath.\n\nA paladin who has broken a vow typically seeks absolution from a cleric who shares his or her faith or from another paladin of the same order. The paladin might spend an all-night vigil in prayer as a sign of penitence, or undertake a fast or similar act of self-denial. After a rite of confession and forgiveness, the paladin starts fresh.\n\nIf a paladin willfully violates his or her oath and shows no sign of repentance, the consequences can be more serious. At the DM's discretion, an impenitent paladin might be forced to abandon this class and adopt another, or perhaps to take the Oathbreaker paladin option that appears in the Dungeon Master's Guide.\n```",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Aura of Protection": {
        "description": "Starting at 6th level, whenever you or a friendly creature within 10 feet of you must make a saving throw, the creature gains a bonus to the saving throw equal to your Charisma modifier (with a minimum bonus of +1). You must be conscious to grant this bonus.\n\nAt 18th level, the range of this aura increases to 30 feet.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Aura of Courage": {
        "description": "Starting at 10th level, you and friendly creatures within 10 feet of you can't be frightened while you are conscious.\n\nAt 18th level, the range of this aura increases to 30 feet.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Improved Divine Smite": {
        "description": "By 11th level, you are so suffused with righteous might that all your melee weapon strikes carry divine power with them. Whenever you hit a creature with a melee weapon, the creature takes an extra [1d8 radiant damage](roll \"1d8\").",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Cleansing Touch": {
        "description": "Beginning at 14th level, you can use your action to end one spell on yourself or on one willing creature that you touch.\n\nYou can use this feature a number of times equal to your Charisma modifier (a minimum of once). You regain expended uses when you finish a long rest.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Oath of Devotion": {
        "description": "The Oath of Devotion binds a paladin to the loftiest ideals of justice, virtue, and order. Sometimes called cavaliers, white knights, or holy warriors, these paladins meet the ideal of the knight in shining armor, acting with honor in pursuit of justice and the greater good. They hold themselves to the highest standards of conduct, and some, for better or worse, hold the rest of the world to the same standards. Many who swear this oath are devoted to gods of law and good and use their gods' tenets as the measure of their devotion. They hold angels—the perfect servants of good—as their ideals, and incorporate images of angelic wings into their helmets or coats of arms.\n\n### Tenets of Devotion\n\nThough the exact words and strictures of the Oath of Devotion vary, paladins of this oath share these tenets.\n\n***Honesty.*** Don't lie or cheat. Let your word be your promise.\n\n***Courage.*** Never fear to act, though caution is wise.\n\n***Compassion.*** Aid others, protect the weak, and punish those who threaten them. Show mercy to your foes, but temper it with wisdom.\n\n***Honor.*** Treat others with fairness, and let your honorable deeds be an example to them. Do as much good as possible while causing the least amount of harm.\n\n***Duty.*** Be responsible for your actions and their consequences, protect those entrusted to your care, and obey those who have just authority over you.\n\n### Oath Spells\n\nYou gain oath spells at the paladin levels listed.\n\n##### Oath of Devotion Spells\n\n|Paladin Level|Spells|\n|---|---|\n|3rd|[protection from evil and good](level 1 \"Protection from Evil and Good\"), [sanctuary](level 1 \"Sanctuary\")|\n|5th|[lesser restoration](level 2 \"Lesser Restoration\"), [zone of truth](level 2 \"Zone of Truth\")|\n|9th|[beacon of hope](level 3 \"Beacon of Hope\"), [dispel magic](level 3 \"Dispel Magic\")|\n|13th|[freedom of movement](level 4 \"Freedom of Movement\"), [guardian of faith](level 4 \"Guardian of Faith\")|\n|17th|[commune](level 5 \"Commune\"), [flame strike](level 5 \"Flame Strike\")|",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Aura of Devotion": {
        "description": "Starting at 7th level, you and friendly creatures within 10 feet of you can't be charmed while you are conscious.\n\nAt 18th level, the range of this aura increases to 30 feet.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Purity of Spirit": {
        "description": "Beginning at 15th level, you are always under the effects of a protection from evil and good spell.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Holy Nimbus": {
        "description": "At 20th level, as an action, you can emanate an aura of sunlight. For 1 minute, bright light shines from you in a 30-foot radius, and dim light shines 30 feet beyond that.\n\nWhenever an enemy creature starts its turn in the bright light, the creature takes [10 radiant damage](roll \"10\").\n\nIn addition, for the duration, you have advantage on saving throws against spells cast by fiends or undead.\n\nOnce you use this feature, you can't use it again until you finish a long rest.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Spellcasting (Ranger)": {
        "description": "By the time you reach 2nd level, you have learned to use the magical essence of nature to cast spells, much as a druid does. See chapter 10 for the general rules of spellcasting and chapter 11 for the ranger spell list.\n\n#### Spell Slots\n\nThe Ranger table shows how many spell slots you have to cast your ranger spells of 1st level and higher. To cast one of these spells, you must expend a slot of the spell's level or higher. You regain all expended spell slots when you finish a long rest.\n\nFor example, if you know the 1st-level spell animal friendship and have a 1st-level and a 2nd-level spell slot available, you can cast animal friendship using either slot.\n\n#### Spells Known of 1st Level and Higher\n\nYou know two 1st-level spells of your choice from the ranger spell list.\n\nThe Spells Known column of the Ranger table shows when you learn more ranger spells of your choice. Each of these spells must be of a level for which you have spell slots. For instance, when you reach 5th level in this class, you can learn one new spell of 1st or 2nd level.\n\nAdditionally, when you gain a level in this class, you can choose one of the ranger spells you know and replace it with another spell from the ranger spell list, which also must be of a level for which you have spell slots.\n\n#### Spellcasting Ability\n\nWisdom is your spellcasting ability for your ranger spells, since your magic draws on your attunement to nature. You use your Wisdom whenever a spell refers to your spellcasting ability. In addition, you use your Wisdom modifier when setting the saving throw DC for a ranger spell you cast and when making an attack roll with one.\n\n**Spell save DC** = 8 + your proficiency bonus + your Wisdom modifier  \n**Spell attack modifier** = your proficiency bonus + your Wisdom modifier",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Ranger Archetype": {
        "description": "At 3rd level, you choose an archetype that you strive to emulate from the list of available archetypes. Your choice grants features at 3rd level, and again at 7th, 11th, and 15th level.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Primeval Awareness": {
        "description": "Beginning at 3rd level, you can use your action and expend one ranger spell slot to focus your awareness on the region around you. For 1 minute per level of the spell slot you expend, you can sense whether the following types of creatures are present within 1 mile of you (or within up to 6 miles if you are in your favored terrain): aberrations, celestials, dragons, elementals, fey, fiends, and undead. This feature doesn't reveal the creatures' location or number.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Hide in Plain Sight": {
        "description": "Starting at 10th level, you can spend 1 minute creating camouflage for yourself. You must have access to fresh mud, dirt, plants, soot, and other naturally occurring materials with which to create your camouflage.\n\nOnce you are camouflaged in this way, you can try to hide by pressing yourself up against a solid surface, such as a tree or wall, that is at least as tall and wide as you are. You gain a +10 bonus to Dexterity (Stealth) checks as long as you remain there without moving or taking actions. Once you move or take an action or a reaction, you must camouflage yourself again to gain this benefit.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Vanish": {
        "description": "Starting at 14th level, you can use the Hide action as a bonus action on your turn. Also, you can't be tracked by nonmagical means, unless you choose to leave a trail.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Feral Senses": {
        "description": "At 18th level, you gain preternatural senses that help you fight creatures you can't see. When you attack a creature you can't see, your inability to see it doesn't impose disadvantage on your attack rolls against it. You are also aware of the location of any invisible creature within 30 feet of you, provided that the creature isn't hidden from you and you aren't blinded or deafened.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Foe Slayer": {
        "description": "At 20th level, you become an unparalleled hunter of your enemies. Once on each of your turns, you can add your Wisdom modifier to the attack roll or the damage roll of an attack you make against one of your favored enemies. You can choose to use this feature before or after the roll, but before any effects of the roll are applied.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Hunter": {
        "description": "Emulating the Hunter archetype means accepting your place as a bulwark between civilization and the terrors of the wilderness. As you walk the Hunter's path, you learn specialized techniques for fighting the threats you face, from rampaging ogres and hordes of orcs to towering giants and terrifying dragons.\n\n### Hunter's Prey\n\nAt 3rd level, you gain one of the following features of your choice: Colossus Slayer, Giant Killer, or Horde Breaker.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Defensive Tactics": {
        "description": "At 7th level, you gain one of the following features of your choice: Escape the Horde, Multiattack Defense, or Steel Will.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Multiattack": {
        "description": "At 11th level, you gain one of the following features of your choice: Volley or Whirlwind Attack.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Colossus Slayer": {
        "description": "Your tenacity can wear down the most potent foes. When you hit a creature with a weapon attack, the creature takes an extra [1d8 damage](roll \"1d8\") if it's below its hit point maximum. You can deal this extra damage only once per turn.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Giant Killer": {
        "description": "When a Large or larger creature within 5 feet of you hits or misses you with an attack, you can use your reaction to attack that creature immediately after its attack, provided that you can see the creature.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Horde Breaker": {
        "description": "Once on each of your turns when you make a weapon attack, you can make another attack with the same weapon against a different creature that is within 5 feet of the original target and within range of your weapon.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Escape the Horde": {
        "description": "Opportunity attacks against you are made with disadvantage.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Multiattack Defense": {
        "description": "When a creature hits you with an attack, you gain a +4 bonus to AC against all subsequent attacks made by that creature for the rest of the turn.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Steel Will": {
        "description": "You have advantage on saving throws against being frightened.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Superior Hunter's Defense": {
        "description": "At 15th level, you gain one of the following features of your choice: Evasion, Stand Against the Tide, or Uncanny Dodge.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Evasion (Ranger)": {
        "description": "You can nimbly dodge out of the way of certain area effects, such as a red dragon's fiery breath or a lightning bolt spell. When you are subjected to an effect that allows you to make a Dexterity saving throw to take only half damage, you instead take no damage if you succeed on the saving throw, and only half damage if you fail.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Stand Against the Tide": {
        "description": "When a hostile creature misses you with a melee attack, you can use your reaction to force that creature to repeat the same attack against another creature (other than itself) of your choice.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Uncanny Dodge (Ranger)": {
        "description": "When an attacker that you can see hits you with an attack, you can use your reaction to halve the attack's damage against you.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Cunning Action": {
        "description": "Starting at 2nd level, your quick thinking and agility allow you to move and act quickly. You can take a bonus action on each of your turns in combat. This action can be used only to take the Dash, Disengage, or Hide action.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Roguish Archetype": {
        "description": "At 3rd level, you choose an archetype that you emulate in the exercise of your rogue abilities from the list of available archetypes. Your archetype choice grants you features at 3rd level and then again at 9th, 13th, and 17th level.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Uncanny Dodge": {
        "description": "Starting at 5th level, when an attacker that you can see hits you with an attack, you can use your reaction to halve the attack's damage against you.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Evasion (Rogue)": {
        "description": "Beginning at 7th level, you can nimbly dodge out of the way of certain area effects, such as a red dragon's fiery breath or an ice storm spell. When you are subjected to an effect that allows you to make a Dexterity saving throw to take only half damage, you instead take no damage if you succeed on the saving throw, and only half damage if you fail.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Reliable Talent": {
        "description": "By 11th level, you have refined your chosen skills until they approach perfection. Whenever you make an ability check that lets you add your proficiency bonus, you can treat a d20 roll of 9 or lower as a 10.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Blindsense": {
        "description": "Starting at 14th level, if you are able to hear, you are aware of the location of any hidden or invisible creature within 10 feet of you.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Slippery Mind": {
        "description": "By 15th level, you have acquired greater mental strength. You gain proficiency in Wisdom saving throws.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Elusive": {
        "description": "Beginning at 18th level, you are so evasive that attackers rarely gain the upper hand against you. No attack roll has advantage against you while you aren't incapacitated.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Stroke of Luck": {
        "description": "At 20th level, you have an uncanny knack for succeeding when you need to. If your attack misses a target within range, you can turn the miss into a hit. Alternatively, if you fail an ability check, you can treat the d20 roll as a 20.\n\nOnce you use this feature, you can't use it again until you finish a short or long rest.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Thief": {
        "description": "You hone your skills in the larcenous arts. Burglars, bandits, cutpurses, and other criminals typically follow this archetype, but so do rogues who prefer to think of themselves as professional treasure seekers, explorers, delvers, and investigators. In addition to improving your agility and stealth, you learn skills useful for delving into ancient ruins, reading unfamiliar languages, and using magic items you normally couldn't employ.\n\n### Fast Hands\n\nStarting at 3rd level, you can use the bonus action granted by your Cunning Action to make a Dexterity (Sleight of Hand) check, use your thieves' tools to disarm a trap or open a lock, or take the Use an Object action.\n\n### Second-Story Work\n\nWhen you choose this archetype at 3rd level, you gain the ability to climb faster than normal; climbing no longer costs you extra movement.\n\nIn addition, when you make a running jump, the distance you cover increases by a number of feet equal to your Dexterity modifier.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Supreme Sneak": {
        "description": "Starting at 9th level, you have advantage on a Dexterity (Stealth) check if you move no more than half your speed on the same turn.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Use Magic Device": {
        "description": "By 13th level, you have learned enough about the workings of magic that you can improvise the use of items even when they are not intended for you. You ignore all class, race, and level requirements on the use of magic items.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Thief's Reflexes": {
        "description": "When you reach 17th level, you have become adept at laying ambushes and quickly escaping danger. You can take two turns during the first round of any combat. You take your first turn at your normal initiative and your second turn at your initiative minus 10. You can't use this feature when you are surprised.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Font of Magic": {
        "description":"At 2nd level, you tap into a deep wellspring of magic within yourself. This wellspring is represented by sorcery points, which allow you to create a variety of magical effects.\n\n#### Sorcery Points\n\nYou have 2 sorcery points, and you gain one additional point every time you level up, to a maximum of 20 at level 20. You can never have more sorcery points than shown on the table for your level. You regain all spent sorcery points when you finish a long rest.\n\n#### Flexible Casting\n\nYou can use your sorcery points to gain additional spell slots, or sacrifice spell slots to gain additional sorcery points. You learn other ways to use your sorcery points as you reach higher levels.\n\nCreating Spell Slots. You can transform unexpended sorcery points into one spell slot as a bonus action on your turn. The created spell slots vanish at the end of a long rest. The Creating Spell Slots table shows the cost of creating a spell slot of a given level. You can create spell slots no higher in level than 5th.\n\n##### Creating Spell Slots\n\n|Spell Slot Level	|Sorcery Point Cost|\n|:---:|:---:|\n|1st	|2|\n|2nd	|3|\n|3rd	|5|\n|4th	|6|\n|5th	|7|\n\nConverting a Spell Slot to Sorcery Points. As a bonus action on your turn, you can expend one spell slot and gain a number of sorcery points equal to the slot's level.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Metamagic": {
        "description": "At 3rd level, you gain the ability to twist your spells to suit your needs. You gain two of the following Metamagic options of your choice. You gain another one at 10th and 17th level.\n\nYou can use only one Metamagic option on a spell when you cast it, unless otherwise noted.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Sorcerous Restoration": {
        "description": "At 20th level, you regain 4 expended sorcery points whenever you finish a short rest.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Elemental Affinity": {
        "description": "Starting at 6th level, when you cast a spell that deals damage of the type associated with your draconic ancestry, you can add your Charisma modifier to one damage roll of that spell. At the same time, you can spend 1 sorcery point to gain resistance to that damage type for 1 hour.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Dragon Wings": {
        "description": "At 14th level, you gain the ability to sprout a pair of dragon wings from your back, gaining a flying speed equal to your current speed. You can create these wings as a bonus action on your turn. They last until you dismiss them as a bonus action on your turn.\n\nYou can't manifest your wings while wearing armor unless the armor is made to accommodate them, and clothing not made to accommodate your wings might be destroyed when you manifest them.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Draconic Presence": {
        "description": "Beginning at 18th level, you can channel the dread presence of your dragon ancestor, causing those around you to become awestruck or frightened. As an action, you can spend 5 sorcery points to draw on this power and exude an aura of awe or fear (your choice) to a distance of 60 feet. For 1 minute or until you lose your concentration (as if you were casting a concentration spell), each hostile creature that starts its turn in this aura must succeed on a Wisdom saving throw or be charmed (if you chose awe) or frightened (if you chose fear) until the aura ends. A creature that succeeds on this saving throw is immune to your aura for 24 hours.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Eldritch Invocations": {
        "description": "In your study of occult lore, you have unearthed eldritch invocations, fragments of forbidden knowledge that imbue you with an abiding magical ability.\n\nAt 2nd level, you gain two eldritch invocations of your choice. Your invocalion oplions are delailed at the end\nof the class description. When you gain certain warlock levels, you gain additional invocations of your choice, as shown in the Invocalions Known column of the\nWarlock table.\n\nAdditionally, when you gain a level in this class, you can choose one of the invocations you know and replace it with another invocation that you could learn at that level.\n\nA level prerequisite in an invocation refers to warlock level, not character level.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Pact Boon": {
        "description": "At 3rd level, your otherworldly patron bestows a gift upon you for your loyal service. You gain one of the following features of your choice: Pact of the Blade, Pact of the Chain or Pact of the Tome.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Pact of the Blade": {
        "description": "You can use your action to create a pact weapon in your empty hand. You can choose the form that this melee weapon takes each time you create it (see chapter 5 for weapon options). You are proficient with it while you wield it. This weapon counts as magical for the purpose of overcoming resistance and immunity to nonmagical attacks and damage.\n\nYour pact weapon disappears if it is more than 5 feet away from you for 1 minute or more. It also disappears if you use this feature again, if you dismiss the weapon (no action required), or if you die.\n\nYou can transform one magic weapon into your pact weapon by performing a special ritual while you hold the weapon. You perform the ritual over the course of 1 hour, which can be done during a short rest. You can then dismiss the weapon, shunting it into an extradimensional space, and it appears whenever you create your pact weapon thereafter. You can't affect an artifact or a sentient weapon in this way. The weapon ceases being your pact weapon if you die, if you perform the 1-hour ritual on a different weapon, or if you use a 1-hour ritual to break your bond to it. The weapon appears at your feet if it is in the extradimensional space when the bond breaks.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Pact of the Chain": {
        "description": "You learn the find familiar spell and can cast it as a ritual. The spell doesn't count against your number of spells known.\n\nWhen you cast the spell, you can choose one of the normal forms for your familiar or one of the following special forms: imp, pseudodragon, quasit, or sprite.\n\nAdditionally, when you take the Attack action, you can forgo one of your own attacks to allow your familiar to use its reaction to make one attack of its own.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Pact of the Tome": {
        "description": "Your patron gives you a grimoire called a Book of Shadows. When you gain this feature, choose three cantrips from any class's spell list. The cantrips do not need to be from the same spell list. While the book is on your person, you can cast those cantrips at will. They don't count against your number of cantrips known. Any cantrip you cast with this feature is considered a warlock cantrip for you. If you lose your Book of Shadows, you can perform a 1-hour ceremony to receive a replacement from your patron. This ceremony can be performed during a short or long rest, and it destroys the previous book. The book turns to ash when you die.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Mystic Arcanum": {
        "description": "At 11th level, your patron bestows upon you a magical secret called an arcanum. Choose one 6th-level spell from the warlock spell list as this arcanum.\n\nYou can cast your arcanum spell once without expending a spell slot. You must finish a long rest before you can do so again.\n\nAt higher levels, you gain more warlock spells of your choice that can be cast in this way: one 7th-level spell at 13th level, one 8th-level spell at 15th level, and one 9th-level spell at 17th level. You regain all uses of your Mystic Arcanum when you finish a long rest.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Dark One's Own Luck": {
        "description": "Starting at 6th level, you can call on your patron to alter fate in your favor. When you make an ability check or a saving throw, you can use this feature to add a [d10](roll \"1d10\") to your roll. You can do so after seeing the initial roll but before any of the roll's effects occur.\n\nOnce you use this feature, you can't use it again until you finish a short or long rest.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Fiendish Resilience": {
        "description": "Starting at 10th level, you can choose one damage type when you finish a short or long rest. You gain resistance to that damage type until you choose a different one with this feature. Damage from magical weapons or silver weapons ignores this resistance.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Hurl Through Hell": {
        "description": "Starting at 14th level, when you hit a creature with an attack, you can use this feature to instantly transport the target through the lower planes. The creature disappears and hurtles through a nightmare landscape.\n\nAt the end of your next turn, the target returns to the space it previously occupied, or the nearest unoccupied space. If the target is not a fiend, it takes [10d10 psychic damage](roll \"10d10\") as it reels from its horrific experience.\n\nOnce you use this feature, you can't use it again until you finish a long rest.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Ability Score Improvement": {
        "description": "When you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can’t increase an ability score above 20 using this feature.\n\nIf your DM allows the use of feats, you may instead take a feat.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Ability Score Improvement (Fighter)": {
        "description": "When you reach 4th level, and again at 6th, 8th, 12th, 14th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can’t increase an ability score above 20 using this feature.\n\nIf your DM allows the use of feats, you may instead take a feat.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Ability Score Improvement (Rogue)": {
        "description": "When you reach 4th level, and again at 8th, 10th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can’t increase an ability score above 20 using this feature.\n\nIf your DM allows the use of feats, you may instead take a feat.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Arcane Tradition": {
        "description": "When you reach 2nd level, you choose an arcane tradition from the list of available traditions, shaping your practice of magic. Your choice grants you features at 2nd level and again at 6th, 10th, and 14th level.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Spell Mastery": {
        "description": "At 18th level, you have achieved such mastery over certain spells that you can cast them at will. Choose a 1st-level wizard spell and a 2nd-level wizard spell that are in your spellbook. You can cast those spells at their lowest level without expending a spell slot when you have them prepared. If you want to cast either spell at a higher level, you must expend a spell slot as normal.\n\nBy spending 8 hours in study, you can exchange one or both of the spells you chose for different spells of the same levels.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Signature Spells": {
        "description": "When you reach 20th level, you gain mastery over two powerful spells and can cast them with little effort. Choose two 3rd-level wizard spells in your spellbook as your signature spells. You always have these spells prepared, they don't count against the number of spells you have prepared, and you can cast each of them once at 3rd level without expending a spell slot. When you do so, you can't do so again until you finish a short or long rest.\n\nIf you want to cast either spell at a higher level, you must expend a spell slot as normal.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "School of Evocation": {
        "description": "You focus your study on magic that creates powerful elemental effects such as bitter cold, searing flame, rolling thunder, crackling lightning, and burning acid. Some evokers find employment in military forces, serving as artillery to blast enemy armies from afar. Others use their spectacular power to protect the weak, while some seek their own gain as bandits, adventurers, or aspiring tyrants.\n\n### Evocation Savant\n\nBeginning when you select this school at 2nd level, the gold and time you must spend to copy an evocation spell into your spellbook is halved.\n\n### Sculpt Spells\n\nBeginning at 2nd level, you can create pockets of relative safety within the effects of your evocation spells. When you cast an evocation spell that affects other creatures that you can see, you can choose a number of them equal to 1 + the spell's level. The chosen creatures automatically succeed on their saving throws against the spell, and they take no damage if they would normally take half damage on a successful save.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Potent Cantrip": {
        "description": "Starting at 6th level, your damaging cantrips affect even creatures that avoid the brunt of the effect. When a creature succeeds on a saving throw against your cantrip, the creature takes half the cantrip's damage (if any) but suffers no additional effect from the cantrip.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Empowered Evocation": {
        "description": "Beginning at 10th level, you can add your Intelligence modifier to one damage roll of any wizard evocation spell you cast.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Overchannel": {
        "description": "Starting at 14th level, you can increase the power of your simpler spells. When you cast a wizard spell of 1st through 5th-level that deals damage, you can deal maximum damage with that spell.\n\nThe first time you do so, you suffer no adverse effect. If you use this feature again before you finish a long rest, you take 2d12 necrotic damage for each level of the spell, immediately after you cast it. Each time you use this feature again before finishing a long rest, the necrotic damage per spell level increases by 1d12. This damage ignores resistance and immunity.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Primal Champion": {
        "description": "At 20th level, you embody the power of the wilds. Your Strength and Constitution scores increase by 4. Your maximum for those scores is now 24.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Perfect Self": {
        "description": "At 20th level, when you roll for initiative and have no ki points remaining, you regain 4 ki points.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Eldritch Master": {
        "description": "At 20th level, you can draw on your inner reserve of mystical power while entreating your patron to regain expended spell slots. You can spend 1 minute entreating your patron for aid to regain all your expended spell slots from your Pact Magic feature. Once you regain spell slots with this feature, you must finish a long rest before you can do so again.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Remarkable Athlete": {
        "description": "Starting at 7th level, you can add half your proficiency bonus (round up) to any Strength, Dexterity, or Constitution check you make that doesn't already use your proficiency bonus.\n\nIn addition, when you make a running long jump, the distance you can cover increases by a number of feet equal to your Strength modifier.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Volley": {
        "description": "You can use your action to make a ranged attack against any number of creatures within 10 feet of a point you can see within your weapon's range. You must have ammunition for each target, as normal, and you make a separate attack roll for each target.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Whirlwind Attack": {
        "description": "You can use your action to make a melee attack against any number of creatures within 5 feet of you, with a separate attack roll for each target.",
        "sources": [
            "SRD",
            "PHB"
        ]
    },
    "Acolyte": {
        "description": "**Skill Proficiencies:** Insight, Religion  \n**Languages:** Two of your choice  \n**Equipment:** A holy symbol (a gift to you when you entered the priesthood), a prayer book or prayer wheel, 5 sticks of incense, vestments, a set of common clothes, and a belt pouch containing 15 gp\n\n#### Suggested Characteristics\n\nAcolytes are shaped by their experience in temples or other religious communities. Their study of the history and tenets of their faith and their relationships to temples, shrines, or hierarchies affect their mannerisms and ideals. Their flaws might be some hidden hypocrisy or heretical idea, or an ideal or bond taken to an extreme.\n\n| [d8](roll \"1d8\") | Personality Trait |\n|:---:|--------------------------------------------------------------------------------------------------------------------|\n| 1 | I idolize a particular hero of my faith, and constantly refer to that person's deeds and example. |\n| 2 | I can find common ground between the fiercest enemies, empathizing with them and always working toward peace. |\n| 3 | I see omens in every event and action. The gods try to speak to us, we just need to listen. |\n| 4 | Nothing can shake my optimistic attitude. |\n| 5 | I quote (or misquote) sacred texts and proverbs in almost every situation. |\n| 6 | I am tolerant (or intolerant) of other faiths and respect (or condemn) the worship of other gods. |\n| 7 | I've enjoyed fine food, drink, and high society among my temple's elite. Rough living grates on me. |\n| 8 | I've spent so long in the temple that I have little practical experience dealing with people in the outside world. |\n\n| [d6](roll \"1d6\") | Ideal |\n|:---:|------------------------------------------------------------------------------------------------------------------------|\n| 1 | Tradition. The ancient traditions of worship and sacrifice must be preserved and upheld. (Lawful) |\n| 2 | Charity. I always try to help those in need, no matter what the personal cost. (Good) |\n| 3 | Change. We must help bring about the changes the gods are constantly working in the world. (Chaotic) |\n| 4 | Power. I hope to one day rise to the top of my faith's religious hierarchy. (Lawful) |\n| 5 | Faith. I trust that my deity will guide my actions. I have faith that if I work hard, things will go well. (Lawful) |\n| 6 | Aspiration. I seek to prove myself worthy of my god's favor by matching my actions against his or her teachings. (Any) |\n\n| [d6](roll \"1d6\") | Bond |\n|:---:|------------------------------------------------------------------------------------------|\n| 1 | I would die to recover an ancient relic of my faith that was lost long ago. |\n| 2 | I will someday get revenge on the corrupt temple hierarchy who branded me a heretic. |\n| 3 | I owe my life to the priest who took me in when my parents died. |\n| 4 | Everything I do is for the common people. |\n| 5 | I will do anything to protect the temple where I served. |\n| 6 | I seek to preserve a sacred text that my enemies consider heretical and seek to destroy. |\n\n| [d6](roll \"1d6\") | Flaw |\n|:---:|-----------------------------------------------------------------------------------------------|\n| 1 | I judge others harshly, and myself even more severely. |\n| 2 | I put too much trust in those who wield power within my temple's hierarchy. |\n| 3 | My piety sometimes leads me to blindly trust those that profess faith in my god. |\n| 4 | I am inflexible in my thinking. |\n| 5 | I am suspicious of strangers and expect the worst of them. |\n| 6 | Once I pick a goal, I become obsessed with it to the detriment of everything else in my life. |",
        "sources": [
            "SRD",
            "PHB"
        ]
    }
}
